/* automatically generated by rust-bindgen 0.56.0 */

#[allow(non_camel_case_types,non_snake_case,non_upper_case_globals,dead_code)]

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align> {
    storage: Storage,
    align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {

pub const SIGQUIT: u32 = 3;
pub const SIGILL: u32 = 4;
pub const SIGTRAP: u32 = 5;
pub const SIGIOT: u32 = 6;
pub const SIGABRT: u32 = 6;
pub const SIGEMT: u32 = 7;
pub const SIGFPE: u32 = 8;
pub const SIGKILL: u32 = 9;
pub const SIGBUS: u32 = 10;
pub const SIGSEGV: u32 = 11;
pub const SIGSYS: u32 = 12;
pub const SIGPIPE: u32 = 13;
pub const SIGALRM: u32 = 14;
pub const SIGTERM: u32 = 15;
pub const SIGURG: u32 = 16;
pub const SIGSTOP: u32 = 17;
pub const SIGTSTP: u32 = 18;
pub const SIGCONT: u32 = 19;
pub const SIGCHLD: u32 = 20;
pub const SIGCLD: u32 = 20;
pub const SIGTTIN: u32 = 21;
pub const SIGTTOU: u32 = 22;
pub const SIGIO: u32 = 23;
pub const SIGPOLL: u32 = 23;
pub const SIGXCPU: u32 = 24;
pub const SIGXFSZ: u32 = 25;
pub const SIGVTALRM: u32 = 26;
pub const SIGPROF: u32 = 27;
pub const SIGWINCH: u32 = 28;
pub const SIGLOST: u32 = 29;
pub const SIGUSR1: u32 = 30;
pub const SIGUSR2: u32 = 31;
pub const NSIG: u32 = 32;
pub const CLOCK_ENABLED: u32 = 1;
pub const CLOCK_DISABLED: u32 = 0;
pub const CLOCK_ALLOWED: u32 = 1;
pub const CLOCK_DISALLOWED: u32 = 0;
pub const TIMER_ABSTIME: u32 = 4;
pub const SOL_SOCKET: i32 = -1;
pub const INADDR_ANY: u32 = 0;
pub const INADDR_BROADCAST: u32 = 4294967295;
pub const PF_UNSPEC: u32 = 0;
pub const PF_INET: u32 = 2;
pub const PF_INET6: u32 = 23;
pub const AF_UNSPEC: u32 = 0;
pub const AF_INET: u32 = 2;
pub const AF_INET6: u32 = 23;
pub const SOCK_STREAM: u32 = 1;
pub const SOCK_DGRAM: u32 = 2;
pub const MSG_OOB: u32 = 1;
pub const MSG_PEEK: u32 = 2;
pub const MSG_DONTROUTE: u32 = 4;
pub const MSG_DONTWAIT: u32 = 32;
pub const SHUT_RD: u32 = 0;
pub const SHUT_WR: u32 = 1;
pub const SHUT_RDWR: u32 = 2;
pub const IPPROTO_IP: u32 = 0;
pub const IPPROTO_TCP: u32 = 6;
pub const IPPROTO_UDP: u32 = 17;
pub const SO_REUSEADDR: u32 = 4;
pub const SO_BROADCAST: u32 = 32;
pub const SO_LINGER: u32 = 128;
pub const SO_OOBINLINE: u32 = 256;
pub const SO_TCPSACK: u32 = 512;
pub const SO_WINSCALE: u32 = 1024;
pub const SO_SNDBUF: u32 = 4097;
pub const SO_RCVBUF: u32 = 4098;
pub const SO_SNDLOWAT: u32 = 4099;
pub const SO_RCVLOWAT: u32 = 4100;
pub const SO_TYPE: u32 = 4104;
pub const SO_ERROR: u32 = 4105;
pub const SO_NBIO: u32 = 4116;
pub const SO_BIO: u32 = 4117;
pub const SO_NONBLOCK: u32 = 4118;
pub const NSN_EAGAIN: u32 = 6;
pub const NSN_EWOULDBLOCK: u32 = 6;
extern "C" {
    pub fn __assert(arg1: *const cty::c_char, arg2: cty::c_int, arg3: *const cty::c_char);
}
extern "C" {
    pub fn __assert_func(
        arg1: *const cty::c_char,
        arg2: cty::c_int,
        arg3: *const cty::c_char,
        arg4: *const cty::c_char,
    );
}
pub type size_t = cty::c_ulong;
pub type wchar_t = cty::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __max_align_ll: cty::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __max_align_ld: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<max_align_t>())).__max_align_ll as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__max_align_ll)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<max_align_t>())).__max_align_ld as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__max_align_ld)
        )
    );
}
pub type __int8_t = cty::c_schar;
pub type __uint8_t = cty::c_uchar;
pub type __int16_t = cty::c_short;
pub type __uint16_t = cty::c_ushort;
pub type __int32_t = cty::c_int;
pub type __uint32_t = cty::c_uint;
pub type __int64_t = cty::c_longlong;
pub type __uint64_t = cty::c_ulonglong;
pub type __int_least8_t = cty::c_schar;
pub type __uint_least8_t = cty::c_uchar;
pub type __int_least16_t = cty::c_short;
pub type __uint_least16_t = cty::c_ushort;
pub type __int_least32_t = cty::c_int;
pub type __uint_least32_t = cty::c_uint;
pub type __int_least64_t = cty::c_longlong;
pub type __uint_least64_t = cty::c_ulonglong;
pub type __intmax_t = cty::c_longlong;
pub type __uintmax_t = cty::c_ulonglong;
pub type __intptr_t = cty::c_long;
pub type __uintptr_t = cty::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type int_least8_t = __int_least8_t;
pub type uint_least8_t = __uint_least8_t;
pub type int_least16_t = __int_least16_t;
pub type uint_least16_t = __uint_least16_t;
pub type int_least32_t = __int_least32_t;
pub type uint_least32_t = __uint_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = cty::c_schar;
pub type uint_fast8_t = cty::c_uchar;
pub type int_fast16_t = cty::c_short;
pub type uint_fast16_t = cty::c_ushort;
pub type int_fast32_t = cty::c_int;
pub type uint_fast32_t = cty::c_uint;
pub type int_fast64_t = cty::c_longlong;
pub type uint_fast64_t = cty::c_ulonglong;
pub type BOOL = i32;
pub mod AVMDrcScanMode {
    pub type Type = cty::c_uint;
    pub const AVM_DRC_SCAN_MODE_UNKNOWN_0: Type = 0;
    pub const AVM_DRC_SCAN_MODE_UNKNOWN_1: Type = 1;
    pub const AVM_DRC_SCAN_MODE_UNKNOWN_3: Type = 3;
    pub const AVM_DRC_SCAN_MODE_UNKNOWN_255: Type = 255;
}
extern "C" {
    pub fn AVMGetDRCScanMode(outScanMode: *mut AVMDrcScanMode::Type) -> BOOL;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSContext {
    #[doc = "! Should always be set to the value OS_CONTEXT_TAG."]
    pub tag: u64,
    pub gpr: [u32; 32usize],
    pub cr: u32,
    pub lr: u32,
    pub ctr: u32,
    pub xer: u32,
    pub srr0: u32,
    pub srr1: u32,
    pub dsisr: u32,
    pub dar: u32,
    pub __unk0: [cty::c_char; 12usize],
    pub fpscr: u32,
    pub fpr: [f64; 32usize],
    pub spinLockCount: u16,
    pub state: u16,
    pub gqr: [u32; 8usize],
    pub __unk1: [cty::c_char; 4usize],
    pub psf: [f64; 32usize],
    pub coretime: [u64; 3usize],
    pub starttime: u64,
    pub error: u32,
    pub __unk2: [cty::c_char; 4usize],
    pub pmc1: u32,
    pub pmc2: u32,
    pub pmc3: u32,
    pub pmc4: u32,
    pub mmcr0: u32,
    pub mmcr1: u32,
}
#[test]
fn bindgen_test_layout_OSContext() {
    assert_eq!(
        ::core::mem::size_of::<OSContext>(),
        800usize,
        concat!("Size of: ", stringify!(OSContext))
    );
    assert_eq!(
        ::core::mem::align_of::<OSContext>(),
        8usize,
        concat!("Alignment of ", stringify!(OSContext))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).tag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).gpr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(gpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).cr as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(cr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).lr as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(lr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).ctr as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(ctr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).xer as *const _ as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(xer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).srr0 as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(srr0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).srr1 as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(srr1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).dsisr as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(dsisr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).dar as *const _ as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(dar)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).__unk0 as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(__unk0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).fpscr as *const _ as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(fpscr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).fpr as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(fpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).spinLockCount as *const _ as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(spinLockCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).state as *const _ as usize },
        442usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).gqr as *const _ as usize },
        444usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(gqr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).__unk1 as *const _ as usize },
        476usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(__unk1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).psf as *const _ as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(psf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).coretime as *const _ as usize },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(coretime)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).starttime as *const _ as usize },
        760usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(starttime)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).error as *const _ as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(error)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).__unk2 as *const _ as usize },
        772usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(__unk2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).pmc1 as *const _ as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(pmc1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).pmc2 as *const _ as usize },
        780usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(pmc2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).pmc3 as *const _ as usize },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(pmc3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).pmc4 as *const _ as usize },
        788usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(pmc4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).mmcr0 as *const _ as usize },
        792usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(mmcr0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSContext>())).mmcr1 as *const _ as usize },
        796usize,
        concat!(
            "Offset of field: ",
            stringify!(OSContext),
            "::",
            stringify!(mmcr1)
        )
    );
}
extern "C" {
    pub fn OSInitContext(context: *mut OSContext, entry: *mut cty::c_void, stack: *mut cty::c_void);
}
extern "C" {
    pub fn OSDumpContext(context: *mut OSContext);
}
extern "C" {
    pub fn OSLoadContext(context: *mut OSContext);
}
extern "C" {
    pub fn OSSaveContext(context: *mut OSContext) -> u32;
}
extern "C" {
    pub fn OSLoadFPUContext(context: *mut OSContext);
}
extern "C" {
    pub fn OSSaveFPUContext(context: *mut OSContext);
}
extern "C" {
    pub fn OSGetCurrentContext() -> *mut OSContext;
}
extern "C" {
    pub fn OSSetCurrentContext(context: *mut OSContext);
}
extern "C" {
    pub fn OSSwitchStack(stack: *mut cty::c_void) -> *mut cty::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSSystemInfo {
    pub busClockSpeed: u32,
    pub coreClockSpeed: u32,
    pub baseTime: i64,
    pub __unk3: [cty::c_char; 16usize],
}
#[test]
fn bindgen_test_layout_OSSystemInfo() {
    assert_eq!(
        ::core::mem::size_of::<OSSystemInfo>(),
        32usize,
        concat!("Size of: ", stringify!(OSSystemInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<OSSystemInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(OSSystemInfo))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSSystemInfo>())).busClockSpeed as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSSystemInfo),
            "::",
            stringify!(busClockSpeed)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSSystemInfo>())).coreClockSpeed as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSSystemInfo),
            "::",
            stringify!(coreClockSpeed)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSSystemInfo>())).baseTime as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OSSystemInfo),
            "::",
            stringify!(baseTime)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSSystemInfo>())).__unk3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(OSSystemInfo),
            "::",
            stringify!(__unk3)
        )
    );
}
extern "C" {
    pub fn OSGetSystemInfo() -> *mut OSSystemInfo;
}
extern "C" {
    pub fn OSEnableHomeButtonMenu(enable: BOOL) -> BOOL;
}
extern "C" {
    pub fn OSIsHomeButtonMenuEnabled() -> BOOL;
}
extern "C" {
    pub fn OSGetOSID() -> u64;
}
extern "C" {
    pub fn __OSGetProcessSDKVersion() -> u32;
}
pub type OSTick = i32;
pub type OSTime = i64;
#[doc = "! Same as std c struct tm but with msec and usec added."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSCalendarTime {
    pub tm_sec: i32,
    pub tm_min: i32,
    pub tm_hour: i32,
    pub tm_mday: i32,
    pub tm_mon: i32,
    pub tm_year: i32,
    pub tm_wday: i32,
    pub tm_yday: i32,
    pub tm_msec: i32,
    pub tm_usec: i32,
}
#[test]
fn bindgen_test_layout_OSCalendarTime() {
    assert_eq!(
        ::core::mem::size_of::<OSCalendarTime>(),
        40usize,
        concat!("Size of: ", stringify!(OSCalendarTime))
    );
    assert_eq!(
        ::core::mem::align_of::<OSCalendarTime>(),
        4usize,
        concat!("Alignment of ", stringify!(OSCalendarTime))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCalendarTime>())).tm_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCalendarTime),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCalendarTime>())).tm_min as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCalendarTime),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCalendarTime>())).tm_hour as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCalendarTime),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCalendarTime>())).tm_mday as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCalendarTime),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCalendarTime>())).tm_mon as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCalendarTime),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCalendarTime>())).tm_year as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCalendarTime),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCalendarTime>())).tm_wday as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCalendarTime),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCalendarTime>())).tm_yday as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCalendarTime),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCalendarTime>())).tm_msec as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCalendarTime),
            "::",
            stringify!(tm_msec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCalendarTime>())).tm_usec as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCalendarTime),
            "::",
            stringify!(tm_usec)
        )
    );
}
extern "C" {
    pub fn OSGetTime() -> OSTime;
}
extern "C" {
    pub fn OSGetSystemTime() -> OSTime;
}
extern "C" {
    pub fn OSGetTick() -> OSTick;
}
extern "C" {
    pub fn OSGetSystemTick() -> OSTick;
}
extern "C" {
    pub fn OSCalendarTimeToTicks(calendarTime: *mut OSCalendarTime) -> OSTime;
}
extern "C" {
    pub fn OSTicksToCalendarTime(time: OSTime, calendarTime: *mut OSCalendarTime);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSThreadLink {
    pub prev: *mut OSThread,
    pub next: *mut OSThread,
}
#[test]
fn bindgen_test_layout_OSThreadLink() {
    assert_eq!(
        ::core::mem::size_of::<OSThreadLink>(),
        8usize,
        concat!("Size of: ", stringify!(OSThreadLink))
    );
    assert_eq!(
        ::core::mem::align_of::<OSThreadLink>(),
        4usize,
        concat!("Alignment of ", stringify!(OSThreadLink))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThreadLink>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThreadLink),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThreadLink>())).next as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThreadLink),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSThreadQueue {
    pub head: *mut OSThread,
    pub tail: *mut OSThread,
    pub parent: *mut cty::c_void,
    pub __unk4: [cty::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_OSThreadQueue() {
    assert_eq!(
        ::core::mem::size_of::<OSThreadQueue>(),
        16usize,
        concat!("Size of: ", stringify!(OSThreadQueue))
    );
    assert_eq!(
        ::core::mem::align_of::<OSThreadQueue>(),
        4usize,
        concat!("Alignment of ", stringify!(OSThreadQueue))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThreadQueue>())).head as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThreadQueue),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThreadQueue>())).tail as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThreadQueue),
            "::",
            stringify!(tail)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThreadQueue>())).parent as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThreadQueue),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThreadQueue>())).__unk4 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThreadQueue),
            "::",
            stringify!(__unk4)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSThreadSimpleQueue {
    pub head: *mut OSThread,
    pub tail: *mut OSThread,
}
#[test]
fn bindgen_test_layout_OSThreadSimpleQueue() {
    assert_eq!(
        ::core::mem::size_of::<OSThreadSimpleQueue>(),
        8usize,
        concat!("Size of: ", stringify!(OSThreadSimpleQueue))
    );
    assert_eq!(
        ::core::mem::align_of::<OSThreadSimpleQueue>(),
        4usize,
        concat!("Alignment of ", stringify!(OSThreadSimpleQueue))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThreadSimpleQueue>())).head as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThreadSimpleQueue),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThreadSimpleQueue>())).tail as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThreadSimpleQueue),
            "::",
            stringify!(tail)
        )
    );
}
extern "C" {
    pub fn OSInitThreadQueue(queue: *mut OSThreadQueue);
}
extern "C" {
    pub fn OSInitThreadQueueEx(queue: *mut OSThreadQueue, parent: *mut cty::c_void);
}
#[doc = "! A value from enum OS_THREAD_STATE."]
pub type OSThreadState = u8;
#[doc = "! A value from enum OS_THREAD_REQUEST."]
pub type OSThreadRequest = u32;
#[doc = "! A bitfield of enum OS_THREAD_ATTRIB."]
pub type OSThreadAttributes = u8;
pub type OSThreadEntryPointFn = ::core::option::Option<
    unsafe extern "C" fn(argc: cty::c_int, argv: *mut *const cty::c_char) -> cty::c_int,
>;
pub type OSThreadCleanupCallbackFn =
    ::core::option::Option<unsafe extern "C" fn(thread: *mut OSThread, stack: *mut cty::c_void)>;
pub type OSThreadDeallocatorFn =
    ::core::option::Option<unsafe extern "C" fn(thread: *mut OSThread, stack: *mut cty::c_void)>;
pub mod OS_THREAD_STATE {
    pub type Type = cty::c_uint;
    pub const OS_THREAD_STATE_NONE: Type = 0;
    #[doc = "! Thread is ready to run"]
    pub const OS_THREAD_STATE_READY: Type = 1;
    #[doc = "! Thread is running"]
    pub const OS_THREAD_STATE_RUNNING: Type = 2;
    #[doc = "! Thread is waiting, i.e. on a mutex"]
    pub const OS_THREAD_STATE_WAITING: Type = 4;
    #[doc = "! Thread is about to terminate"]
    pub const OS_THREAD_STATE_MORIBUND: Type = 8;
}
pub mod OS_THREAD_REQUEST {
    pub type Type = cty::c_uint;
    pub const OS_THREAD_REQUEST_NONE: Type = 0;
    pub const OS_THREAD_REQUEST_SUSPEND: Type = 1;
    pub const OS_THREAD_REQUEST_CANCEL: Type = 2;
}
pub mod OS_THREAD_ATTRIB {
    pub type Type = cty::c_uint;
    #[doc = "! Allow the thread to run on CPU0."]
    pub const OS_THREAD_ATTRIB_AFFINITY_CPU0: Type = 1;
    #[doc = "! Allow the thread to run on CPU1."]
    pub const OS_THREAD_ATTRIB_AFFINITY_CPU1: Type = 2;
    #[doc = "! Allow the thread to run on CPU2."]
    pub const OS_THREAD_ATTRIB_AFFINITY_CPU2: Type = 4;
    #[doc = "! Allow the thread to run any CPU."]
    pub const OS_THREAD_ATTRIB_AFFINITY_ANY: Type = 7;
    #[doc = "! Start the thread detached."]
    pub const OS_THREAD_ATTRIB_DETACHED: Type = 8;
    #[doc = "! Enables tracking of stack usage."]
    pub const OS_THREAD_ATTRIB_STACK_USAGE: Type = 32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSMutexQueue {
    pub head: *mut OSMutex,
    pub tail: *mut OSMutex,
    pub parent: *mut cty::c_void,
    pub __unk5: [cty::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_OSMutexQueue() {
    assert_eq!(
        ::core::mem::size_of::<OSMutexQueue>(),
        16usize,
        concat!("Size of: ", stringify!(OSMutexQueue))
    );
    assert_eq!(
        ::core::mem::align_of::<OSMutexQueue>(),
        4usize,
        concat!("Alignment of ", stringify!(OSMutexQueue))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMutexQueue>())).head as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMutexQueue),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMutexQueue>())).tail as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMutexQueue),
            "::",
            stringify!(tail)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMutexQueue>())).parent as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMutexQueue),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMutexQueue>())).__unk5 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMutexQueue),
            "::",
            stringify!(__unk5)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSFastMutexQueue {
    pub head: *mut OSFastMutex,
    pub tail: *mut OSFastMutex,
}
#[test]
fn bindgen_test_layout_OSFastMutexQueue() {
    assert_eq!(
        ::core::mem::size_of::<OSFastMutexQueue>(),
        8usize,
        concat!("Size of: ", stringify!(OSFastMutexQueue))
    );
    assert_eq!(
        ::core::mem::align_of::<OSFastMutexQueue>(),
        4usize,
        concat!("Alignment of ", stringify!(OSFastMutexQueue))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSFastMutexQueue>())).head as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSFastMutexQueue),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSFastMutexQueue>())).tail as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSFastMutexQueue),
            "::",
            stringify!(tail)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct OSThread {
    pub context: OSContext,
    #[doc = "! Should always be set to the value OS_THREAD_TAG."]
    pub tag: u32,
    #[doc = "! Bitfield of OS_THREAD_STATE"]
    pub state: OSThreadState,
    #[doc = "! Bitfield of OS_THREAD_ATTRIB"]
    pub attr: OSThreadAttributes,
    #[doc = "! Unique thread ID"]
    pub id: u16,
    #[doc = "! Suspend count (increased by OSSuspendThread)."]
    pub suspendCounter: i32,
    #[doc = "! Actual priority of thread."]
    pub priority: i32,
    #[doc = "! Base priority of thread, 0 is highest priority, 31 is lowest priority."]
    pub basePriority: i32,
    #[doc = "! Exit value"]
    pub exitValue: i32,
    pub __unk6: [cty::c_char; 36usize],
    #[doc = "! Queue the thread is currently waiting on"]
    pub queue: *mut OSThreadQueue,
    #[doc = "! Link used for thread queue"]
    pub link: OSThreadLink,
    #[doc = "! Queue of threads waiting to join this thread"]
    pub joinQueue: OSThreadQueue,
    #[doc = "! Mutex this thread is waiting to lock"]
    pub mutex: *mut OSMutex,
    #[doc = "! Queue of mutexes this thread owns"]
    pub mutexQueue: OSMutexQueue,
    #[doc = "! Link for global active thread queue"]
    pub activeLink: OSThreadLink,
    #[doc = "! Stack start (top, highest address)"]
    pub stackStart: *mut cty::c_void,
    #[doc = "! Stack end (bottom, lowest address)"]
    pub stackEnd: *mut cty::c_void,
    #[doc = "! Thread entry point"]
    pub entryPoint: OSThreadEntryPointFn,
    pub __unk7: [cty::c_char; 476usize],
    #[doc = "! Thread specific values, accessed with OSSetThreadSpecific and OSGetThreadSpecific."]
    pub specific: [*mut cty::c_void; 16usize],
    pub __unk8: [cty::c_char; 4usize],
    #[doc = "! Thread name, accessed with OSSetThreadName and OSGetThreadName."]
    pub name: *const cty::c_char,
    pub __unk9: [cty::c_char; 4usize],
    #[doc = "! The stack pointer passed in OSCreateThread."]
    pub userStackPointer: *mut cty::c_void,
    #[doc = "! Called just before thread is terminated, set with OSSetThreadCleanupCallback"]
    pub cleanupCallback: OSThreadCleanupCallbackFn,
    #[doc = "! Called just after a thread is terminated, set with OSSetThreadDeallocator"]
    pub deallocator: OSThreadDeallocatorFn,
    #[doc = "! If TRUE then a thread can be cancelled or suspended, set with OSSetThreadCancelState"]
    pub cancelState: BOOL,
    #[doc = "! Current thread request, used for cancelleing and suspending the thread."]
    pub requestFlag: OSThreadRequest,
    #[doc = "! Pending suspend request count"]
    pub needSuspend: i32,
    #[doc = "! Result of thread suspend"]
    pub suspendResult: i32,
    #[doc = "! Queue of threads waiting for a thread to be suspended."]
    pub suspendQueue: OSThreadQueue,
    pub __unk10: [cty::c_char; 172usize],
}
#[test]
fn bindgen_test_layout_OSThread() {
    assert_eq!(
        ::core::mem::size_of::<OSThread>(),
        1696usize,
        concat!("Size of: ", stringify!(OSThread))
    );
    assert_eq!(
        ::core::mem::align_of::<OSThread>(),
        8usize,
        concat!("Alignment of ", stringify!(OSThread))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).context as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).tag as *const _ as usize },
        800usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).state as *const _ as usize },
        804usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).attr as *const _ as usize },
        805usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(attr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).id as *const _ as usize },
        806usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).suspendCounter as *const _ as usize },
        808usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(suspendCounter)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).priority as *const _ as usize },
        812usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).basePriority as *const _ as usize },
        816usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(basePriority)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).exitValue as *const _ as usize },
        820usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(exitValue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).__unk6 as *const _ as usize },
        824usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(__unk6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).queue as *const _ as usize },
        860usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(queue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).link as *const _ as usize },
        864usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(link)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).joinQueue as *const _ as usize },
        872usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(joinQueue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).mutex as *const _ as usize },
        888usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(mutex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).mutexQueue as *const _ as usize },
        892usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(mutexQueue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).activeLink as *const _ as usize },
        908usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(activeLink)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).stackStart as *const _ as usize },
        916usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(stackStart)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).stackEnd as *const _ as usize },
        920usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(stackEnd)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).entryPoint as *const _ as usize },
        924usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(entryPoint)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).__unk7 as *const _ as usize },
        928usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(__unk7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).specific as *const _ as usize },
        1404usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(specific)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).__unk8 as *const _ as usize },
        1468usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(__unk8)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).name as *const _ as usize },
        1472usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).__unk9 as *const _ as usize },
        1476usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(__unk9)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).userStackPointer as *const _ as usize },
        1480usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(userStackPointer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).cleanupCallback as *const _ as usize },
        1484usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(cleanupCallback)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).deallocator as *const _ as usize },
        1488usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(deallocator)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).cancelState as *const _ as usize },
        1492usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(cancelState)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).requestFlag as *const _ as usize },
        1496usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(requestFlag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).needSuspend as *const _ as usize },
        1500usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(needSuspend)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).suspendResult as *const _ as usize },
        1504usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(suspendResult)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).suspendQueue as *const _ as usize },
        1508usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(suspendQueue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSThread>())).__unk10 as *const _ as usize },
        1524usize,
        concat!(
            "Offset of field: ",
            stringify!(OSThread),
            "::",
            stringify!(__unk10)
        )
    );
}
extern "C" {
    #[doc = " Cancels a thread."]
    #[doc = ""]
    #[doc = " This sets the threads requestFlag to OS_THREAD_REQUEST_CANCEL, the thread will"]
    #[doc = " be terminated next time OSTestThreadCancel is called."]
    pub fn OSCancelThread(thread: *mut OSThread);
}
extern "C" {
    #[doc = " Returns the count of active threads."]
    pub fn OSCheckActiveThreads() -> i32;
}
extern "C" {
    #[doc = " Get the maximum amount of stack the thread has used."]
    pub fn OSCheckThreadStackUsage(thread: *mut OSThread) -> i32;
}
extern "C" {
    #[doc = " Disable tracking of thread stack usage"]
    pub fn OSClearThreadStackUsage(thread: *mut OSThread);
}
extern "C" {
    #[doc = " Clears a thread's suspend counter and resumes it."]
    pub fn OSContinueThread(thread: *mut OSThread);
}
extern "C" {
    #[doc = " Create a new thread."]
    #[doc = ""]
    #[doc = " \\param thread Thread to initialise."]
    #[doc = " \\param entry Thread entry point."]
    #[doc = " \\param argc argc argument passed to entry point."]
    #[doc = " \\param argv argv argument passed to entry point."]
    #[doc = " \\param stack Top of stack (highest address)."]
    #[doc = " \\param stackSize Size of stack."]
    #[doc = " \\param priority Thread priority, 0 is highest priorty, 31 is lowest."]
    #[doc = " \\param attributes Thread attributes, see OSThreadAttributes."]
    pub fn OSCreateThread(
        thread: *mut OSThread,
        entry: OSThreadEntryPointFn,
        argc: i32,
        argv: *mut cty::c_char,
        stack: *mut cty::c_void,
        stackSize: u32,
        priority: i32,
        attributes: OSThreadAttributes,
    ) -> BOOL;
}
extern "C" {
    #[doc = " Detach thread."]
    pub fn OSDetachThread(thread: *mut OSThread);
}
extern "C" {
    #[doc = " Exit the current thread with a exit code."]
    #[doc = ""]
    #[doc = " This function is implicitly called when the thread entry point returns."]
    pub fn OSExitThread(result: i32);
}
extern "C" {
    #[doc = " Get the next and previous thread in the thread's active queue."]
    pub fn OSGetActiveThreadLink(thread: *mut OSThread, link: *mut OSThreadLink);
}
extern "C" {
    #[doc = " Return pointer to OSThread object for the current thread."]
    pub fn OSGetCurrentThread() -> *mut OSThread;
}
extern "C" {
    #[doc = " Returns the default thread for a specific core."]
    #[doc = ""]
    #[doc = " Each core has 1 default thread created before the game boots. The default"]
    #[doc = " thread for core 1 calls the RPX entry point, the default threads for core 0"]
    #[doc = " and 2 are suspended and can be used with OSRunThread."]
    pub fn OSGetDefaultThread(coreID: u32) -> *mut OSThread;
}
extern "C" {
    #[doc = " Return current stack pointer, value of r1 register."]
    pub fn OSGetStackPointer() -> u32;
}
extern "C" {
    #[doc = " Get a thread's affinity."]
    pub fn OSGetThreadAffinity(thread: *mut OSThread) -> u32;
}
extern "C" {
    #[doc = " Get a thread's name."]
    pub fn OSGetThreadName(thread: *mut OSThread) -> *const cty::c_char;
}
extern "C" {
    #[doc = " Get a thread's base priority."]
    pub fn OSGetThreadPriority(thread: *mut OSThread) -> i32;
}
extern "C" {
    #[doc = " Get a thread's specific value set by OSSetThreadSpecific."]
    pub fn OSGetThreadSpecific(id: u32) -> *mut cty::c_void;
}
extern "C" {
    #[doc = " Returns TRUE if a thread is suspended."]
    pub fn OSIsThreadSuspended(thread: *mut OSThread) -> BOOL;
}
extern "C" {
    #[doc = " Returns TRUE if a thread is terminated."]
    pub fn OSIsThreadTerminated(thread: *mut OSThread) -> BOOL;
}
extern "C" {
    #[doc = " Wait until thread is terminated."]
    #[doc = ""]
    #[doc = " If the target thread is detached, returns FALSE."]
    #[doc = ""]
    #[doc = " \\param thread Thread to wait for"]
    #[doc = " \\param threadResult Pointer to store thread exit value in."]
    #[doc = " \\returns Returns TRUE if thread has terminated, FALSE if thread is detached."]
    pub fn OSJoinThread(thread: *mut OSThread, threadResult: *mut cty::c_int) -> BOOL;
}
extern "C" {
    #[doc = " Resumes a thread."]
    #[doc = ""]
    #[doc = " Decrements the thread's suspend counter, if the counter reaches 0 the thread"]
    #[doc = " is resumed."]
    #[doc = ""]
    #[doc = " \\returns Returns the previous value of the suspend counter."]
    pub fn OSResumeThread(thread: *mut OSThread) -> i32;
}
extern "C" {
    #[doc = " Run a function on an already created thread."]
    #[doc = ""]
    #[doc = " Can only be used on idle threads."]
    pub fn OSRunThread(
        thread: *mut OSThread,
        entry: OSThreadEntryPointFn,
        argc: cty::c_int,
        argv: *mut *const cty::c_char,
    ) -> BOOL;
}
extern "C" {
    #[doc = " Set a thread's affinity."]
    pub fn OSSetThreadAffinity(thread: *mut OSThread, affinity: u32) -> BOOL;
}
extern "C" {
    #[doc = " Set a thread's cancellation state."]
    #[doc = ""]
    #[doc = " If the state is TRUE then the thread can be suspended or cancelled when"]
    #[doc = " OSTestThreadCancel is called."]
    pub fn OSSetThreadCancelState(state: BOOL) -> BOOL;
}
extern "C" {
    #[doc = " Set the callback to be called just before a thread is terminated."]
    pub fn OSSetThreadCleanupCallback(
        thread: *mut OSThread,
        callback: OSThreadCleanupCallbackFn,
    ) -> OSThreadCleanupCallbackFn;
}
extern "C" {
    #[doc = " Set the callback to be called just after a thread is terminated."]
    pub fn OSSetThreadDeallocator(
        thread: *mut OSThread,
        deallocator: OSThreadDeallocatorFn,
    ) -> OSThreadDeallocatorFn;
}
extern "C" {
    #[doc = " Set a thread's name."]
    pub fn OSSetThreadName(thread: *mut OSThread, name: *const cty::c_char);
}
extern "C" {
    #[doc = " Set a thread's priority."]
    pub fn OSSetThreadPriority(thread: *mut OSThread, priority: i32) -> BOOL;
}
extern "C" {
    #[doc = " Set a thread's run quantum."]
    #[doc = ""]
    #[doc = " This is the maximum amount of time the thread can run for before being forced"]
    #[doc = " to yield."]
    pub fn OSSetThreadRunQuantum(thread: *mut OSThread, quantum: u32) -> BOOL;
}
extern "C" {
    #[doc = " Set a thread specific value."]
    #[doc = ""]
    #[doc = " Can be read with OSGetThreadSpecific."]
    pub fn OSSetThreadSpecific(id: u32, value: *mut cty::c_void);
}
extern "C" {
    #[doc = " Set thread stack usage tracking."]
    pub fn OSSetThreadStackUsage(thread: *mut OSThread) -> BOOL;
}
extern "C" {
    #[doc = " Sleep the current thread and add it to a thread queue."]
    #[doc = ""]
    #[doc = " Will sleep until the thread queue is woken with OSWakeupThread."]
    pub fn OSSleepThread(queue: *mut OSThreadQueue);
}
extern "C" {
    #[doc = " Sleep the current thread for a period of time."]
    pub fn OSSleepTicks(ticks: OSTime);
}
extern "C" {
    #[doc = " Suspend a thread."]
    #[doc = ""]
    #[doc = " Increases a thread's suspend counter, if the counter is >0 then the thread is"]
    #[doc = " suspended."]
    #[doc = ""]
    #[doc = " \\returns Returns the thread's previous suspend counter value"]
    pub fn OSSuspendThread(thread: *mut OSThread) -> u32;
}
extern "C" {
    #[doc = " Check to see if the current thread should be cancelled or suspended."]
    #[doc = ""]
    #[doc = " This is implicitly called in:"]
    #[doc = " - OSLockMutex"]
    #[doc = " - OSTryLockMutex"]
    #[doc = " - OSUnlockMutex"]
    #[doc = " - OSAcquireSpinLock"]
    #[doc = " - OSTryAcquireSpinLock"]
    #[doc = " - OSTryAcquireSpinLockWithTimeout"]
    #[doc = " - OSReleaseSpinLock"]
    #[doc = " - OSCancelThread"]
    pub fn OSTestThreadCancel();
}
extern "C" {
    #[doc = " Wake up all threads in queue."]
    #[doc = ""]
    #[doc = " Clears the thread queue."]
    pub fn OSWakeupThread(queue: *mut OSThreadQueue);
}
extern "C" {
    #[doc = " Yield execution to waiting threads with same priority."]
    #[doc = ""]
    #[doc = " This will never switch to a thread with a lower priority than the current"]
    #[doc = " thread."]
    pub fn OSYieldThread();
}
pub type OSAlarmCallback =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut OSAlarm, arg2: *mut OSContext)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSAlarmQueue {
    #[doc = "! Should always be set to the value OS_ALARM_QUEUE_TAG."]
    pub tag: u32,
    #[doc = "! Name set by OSInitAlarmQueueEx"]
    pub name: *const cty::c_char,
    pub __unk11: [cty::c_char; 4usize],
    pub threadQueue: OSThreadQueue,
    pub head: *mut OSAlarm,
    pub tail: *mut OSAlarm,
}
#[test]
fn bindgen_test_layout_OSAlarmQueue() {
    assert_eq!(
        ::core::mem::size_of::<OSAlarmQueue>(),
        36usize,
        concat!("Size of: ", stringify!(OSAlarmQueue))
    );
    assert_eq!(
        ::core::mem::align_of::<OSAlarmQueue>(),
        4usize,
        concat!("Alignment of ", stringify!(OSAlarmQueue))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarmQueue>())).tag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarmQueue),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarmQueue>())).name as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarmQueue),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarmQueue>())).__unk11 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarmQueue),
            "::",
            stringify!(__unk11)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarmQueue>())).threadQueue as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarmQueue),
            "::",
            stringify!(threadQueue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarmQueue>())).head as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarmQueue),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarmQueue>())).tail as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarmQueue),
            "::",
            stringify!(tail)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSAlarmLink {
    pub prev: *mut OSAlarm,
    pub next: *mut OSAlarm,
}
#[test]
fn bindgen_test_layout_OSAlarmLink() {
    assert_eq!(
        ::core::mem::size_of::<OSAlarmLink>(),
        8usize,
        concat!("Size of: ", stringify!(OSAlarmLink))
    );
    assert_eq!(
        ::core::mem::align_of::<OSAlarmLink>(),
        4usize,
        concat!("Alignment of ", stringify!(OSAlarmLink))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarmLink>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarmLink),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarmLink>())).next as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarmLink),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSAlarm {
    #[doc = "! Should always be set to the value OS_ALARM_TAG."]
    pub tag: u32,
    #[doc = "! Name set from OSCreateAlarmEx."]
    pub name: *const cty::c_char,
    pub __unk12: [cty::c_char; 4usize],
    #[doc = "! The callback to execute once the alarm is triggered."]
    pub callback: OSAlarmCallback,
    #[doc = "! Used with OSCancelAlarms for bulk cancellation of alarms."]
    pub group: u32,
    pub __unk13: [cty::c_char; 4usize],
    #[doc = "! The time when the alarm will next be triggered."]
    pub nextFire: OSTime,
    #[doc = "! Link used for when this OSAlarm object is inside an OSAlarmQueue"]
    pub link: OSAlarmLink,
    #[doc = "! The period between alarm triggers, this is only set for periodic alarms."]
    pub period: OSTime,
    #[doc = "! The time the alarm was started."]
    pub start: OSTime,
    #[doc = "! User data set with OSSetAlarmUserData and retrieved with OSGetAlarmUserData."]
    pub userData: *mut cty::c_void,
    #[doc = "! The current state of the alarm, internal values."]
    pub state: u32,
    #[doc = "! Queue of threads currently waiting for the alarm to trigger with OSWaitAlarm."]
    pub threadQueue: OSThreadQueue,
    #[doc = "! The queue that this alarm is currently in."]
    pub alarmQueue: *mut OSAlarmQueue,
    #[doc = "! The context the alarm was triggered on."]
    pub context: *mut OSContext,
}
#[test]
fn bindgen_test_layout_OSAlarm() {
    assert_eq!(
        ::core::mem::size_of::<OSAlarm>(),
        88usize,
        concat!("Size of: ", stringify!(OSAlarm))
    );
    assert_eq!(
        ::core::mem::align_of::<OSAlarm>(),
        8usize,
        concat!("Alignment of ", stringify!(OSAlarm))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarm>())).tag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarm),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarm>())).name as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarm),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarm>())).__unk12 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarm),
            "::",
            stringify!(__unk12)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarm>())).callback as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarm),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarm>())).group as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarm),
            "::",
            stringify!(group)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarm>())).__unk13 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarm),
            "::",
            stringify!(__unk13)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarm>())).nextFire as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarm),
            "::",
            stringify!(nextFire)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarm>())).link as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarm),
            "::",
            stringify!(link)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarm>())).period as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarm),
            "::",
            stringify!(period)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarm>())).start as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarm),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarm>())).userData as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarm),
            "::",
            stringify!(userData)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarm>())).state as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarm),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarm>())).threadQueue as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarm),
            "::",
            stringify!(threadQueue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarm>())).alarmQueue as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarm),
            "::",
            stringify!(alarmQueue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSAlarm>())).context as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(OSAlarm),
            "::",
            stringify!(context)
        )
    );
}
extern "C" {
    #[doc = " Cancel an alarm."]
    pub fn OSCancelAlarm(alarm: *mut OSAlarm) -> BOOL;
}
extern "C" {
    #[doc = " Cancel all alarms which have a matching tag set by OSSetAlarmTag."]
    #[doc = ""]
    #[doc = " \\param group The alarm tag to cancel."]
    pub fn OSCancelAlarms(group: u32);
}
extern "C" {
    #[doc = " Initialise an alarm structure."]
    pub fn OSCreateAlarm(alarm: *mut OSAlarm);
}
extern "C" {
    #[doc = " Initialise an alarm structure with a name."]
    pub fn OSCreateAlarmEx(alarm: *mut OSAlarm, name: *const cty::c_char);
}
extern "C" {
    #[doc = " Return user data set by OSSetAlarmUserData."]
    pub fn OSGetAlarmUserData(alarm: *mut OSAlarm) -> *mut cty::c_void;
}
extern "C" {
    #[doc = " Initialise an alarm queue structure."]
    pub fn OSInitAlarmQueue(queue: *mut OSAlarmQueue);
}
extern "C" {
    #[doc = " Initialise an alarm queue structure with a name."]
    pub fn OSInitAlarmQueueEx(queue: *mut OSAlarmQueue, name: *const cty::c_char);
}
extern "C" {
    #[doc = " Set a one shot alarm to perform a callback after a set amount of time."]
    #[doc = ""]
    #[doc = " \\param alarm The alarm to set."]
    #[doc = " \\param time The duration until the alarm should be triggered."]
    #[doc = " \\param callback The alarm callback to call when the alarm is triggered."]
    pub fn OSSetAlarm(alarm: *mut OSAlarm, time: OSTime, callback: OSAlarmCallback) -> BOOL;
}
extern "C" {
    #[doc = " Set a repeated alarm to execute a callback every interval from start."]
    #[doc = ""]
    #[doc = " \\param alarm The alarm to set."]
    #[doc = " \\param start The duration until the alarm should first be triggered."]
    #[doc = " \\param interval The interval between triggers after the first trigger."]
    #[doc = " \\param callback The alarm callback to call when the alarm is triggered."]
    pub fn OSSetPeriodicAlarm(
        alarm: *mut OSAlarm,
        start: OSTime,
        interval: OSTime,
        callback: OSAlarmCallback,
    ) -> BOOL;
}
extern "C" {
    #[doc = " Set an alarm tag which is used in OSCancelAlarms for bulk cancellation."]
    pub fn OSSetAlarmTag(alarm: *mut OSAlarm, group: u32);
}
extern "C" {
    #[doc = " Set alarm user data which is returned by OSGetAlarmUserData."]
    pub fn OSSetAlarmUserData(alarm: *mut OSAlarm, data: *mut cty::c_void);
}
extern "C" {
    #[doc = " Sleep the current thread until the alarm has been triggered or cancelled."]
    pub fn OSWaitAlarm(alarm: *mut OSAlarm) -> BOOL;
}
extern "C" {
    pub fn OSCompareAndSwapAtomic(ptr: *mut u32, compare: u32, value: u32) -> BOOL;
}
extern "C" {
    pub fn OSCompareAndSwapAtomicEx(ptr: *mut u32, compare: u32, value: u32, old: *mut u32)
        -> BOOL;
}
extern "C" {
    pub fn OSSwapAtomic(ptr: *mut u32, value: u32) -> u32;
}
extern "C" {
    pub fn OSAddAtomic(ptr: *mut i32, value: i32) -> i32;
}
extern "C" {
    pub fn OSAndAtomic(ptr: *mut u32, value: u32) -> u32;
}
extern "C" {
    pub fn OSOrAtomic(ptr: *mut u32, value: u32) -> u32;
}
extern "C" {
    pub fn OSXorAtomic(ptr: *mut u32, value: u32) -> u32;
}
extern "C" {
    pub fn OSTestAndClearAtomic(ptr: *mut u32, bit: u32) -> BOOL;
}
extern "C" {
    pub fn OSTestAndSetAtomic(ptr: *mut u32, bit: u32) -> BOOL;
}
extern "C" {
    pub fn OSGetAtomic64(ptr: *mut u64) -> u64;
}
extern "C" {
    pub fn OSSetAtomic64(ptr: *mut u64, value: u64) -> u64;
}
extern "C" {
    pub fn OSCompareAndSwapAtomic64(ptr: *mut u64, compare: u64, value: u64) -> BOOL;
}
extern "C" {
    pub fn OSCompareAndSwapAtomicEx64(
        ptr: *mut u64,
        compare: u64,
        value: u64,
        old: *mut u64,
    ) -> BOOL;
}
extern "C" {
    pub fn OSSwapAtomic64(ptr: *mut u64, value: u64) -> u64;
}
extern "C" {
    pub fn OSAddAtomic64(ptr: *mut i64, value: i64) -> i64;
}
extern "C" {
    pub fn OSAndAtomic64(ptr: *mut u64, value: u64) -> u64;
}
extern "C" {
    pub fn OSOrAtomic64(ptr: *mut u64, value: u64) -> u64;
}
extern "C" {
    pub fn OSXorAtomic64(ptr: *mut u64, value: u64) -> u64;
}
extern "C" {
    pub fn OSTestAndClearAtomic64(ptr: *mut u64, bit: u32) -> BOOL;
}
extern "C" {
    pub fn OSTestAndSetAtomic64(ptr: *mut u64, bit: u32) -> BOOL;
}
pub type BSPError = i32;
pub type BSPHardwareVersion = u32;
pub mod BSPErrors {
    pub type Type = cty::c_uint;
    pub const BSP_ERROR_OK: Type = 0;
    pub const BSP_ERROR_IOS_ERROR: Type = 64;
    pub const BSP_ERROR_RESPONSE_TOO_LARGE: Type = 128;
}
pub mod BSPHardwareVersions {
    pub type Type = cty::c_uint;
    pub const BSP_HARDWARE_VERSION_UNKNOWN: Type = 0;
    pub const BSP_HARDWARE_VERSION_HOLLYWOOD_ENG_SAMPLE_1: Type = 1;
    pub const BSP_HARDWARE_VERSION_HOLLYWOOD_ENG_SAMPLE_2: Type = 268435457;
    pub const BSP_HARDWARE_VERSION_HOLLYWOOD_PROD_FOR_WII: Type = 269484033;
    pub const BSP_HARDWARE_VERSION_HOLLYWOOD_CORTADO: Type = 269484040;
    pub const BSP_HARDWARE_VERSION_HOLLYWOOD_CORTADO_ESPRESSO: Type = 269484044;
    pub const BSP_HARDWARE_VERSION_BOLLYWOOD: Type = 536870913;
    pub const BSP_HARDWARE_VERSION_BOLLYWOOD_PROD_FOR_WII: Type = 537919489;
    pub const BSP_HARDWARE_VERSION_LATTE_A11_EV: Type = 554696720;
    pub const BSP_HARDWARE_VERSION_LATTE_A11_CAT: Type = 554696736;
    pub const BSP_HARDWARE_VERSION_LATTE_A12_EV: Type = 555745296;
    pub const BSP_HARDWARE_VERSION_LATTE_A12_CAT: Type = 555745312;
    pub const BSP_HARDWARE_VERSION_LATTE_A2X_EV: Type = 571473936;
    pub const BSP_HARDWARE_VERSION_LATTE_A2X_CAT: Type = 571473952;
    pub const BSP_HARDWARE_VERSION_LATTE_A3X_EV: Type = 588251152;
    pub const BSP_HARDWARE_VERSION_LATTE_A3X_CAT: Type = 588251168;
    pub const BSP_HARDWARE_VERSION_LATTE_A3X_CAFE: Type = 588251176;
    pub const BSP_HARDWARE_VERSION_LATTE_A4X_EV: Type = 605028368;
    pub const BSP_HARDWARE_VERSION_LATTE_A4X_CAT: Type = 605028384;
    pub const BSP_HARDWARE_VERSION_LATTE_A4X_CAFE: Type = 605028392;
    pub const BSP_HARDWARE_VERSION_LATTE_A5X_EV: Type = 621805584;
    pub const BSP_HARDWARE_VERSION_LATTE_A5X_EV_Y: Type = 621805585;
    pub const BSP_HARDWARE_VERSION_LATTE_A5X_CAT: Type = 621805600;
    pub const BSP_HARDWARE_VERSION_LATTE_A5X_CAFE: Type = 621805608;
    pub const BSP_HARDWARE_VERSION_LATTE_B1X_EV: Type = 638582800;
    pub const BSP_HARDWARE_VERSION_LATTE_B1X_EV_Y: Type = 638582801;
    pub const BSP_HARDWARE_VERSION_LATTE_B1X_CAT: Type = 638582816;
    pub const BSP_HARDWARE_VERSION_LATTE_B1X_CAFE: Type = 638582824;
}
extern "C" {
    pub fn bspInitializeShimInterface() -> BSPError;
}
extern "C" {
    pub fn bspGetHardwareVersion(version: *mut BSPHardwareVersion) -> BSPError;
}
extern "C" {
    #[doc = " Invalidates a range of cached data, in blocks. Equivalent to a loop of"]
    #[doc = " PowerPC \\c dcbi instructions."]
    #[doc = ""]
    #[doc = " This function forces the next reads from the given address to bypass the"]
    #[doc = " the cache and go straight to memory, resulting in slower reads that are"]
    #[doc = " guaranteed to reflect main memory."]
    #[doc = ""]
    #[doc = " \\param addr"]
    #[doc = " The effective address of the data to invalidate."]
    #[doc = ""]
    #[doc = " \\param size"]
    #[doc = " The size of the range to invalidate. Will be rounded up to the next 0x20."]
    #[doc = ""]
    #[doc = " \\note"]
    #[doc = " Unnecessary use of caching functions can have an adverse performance impact."]
    #[doc = " They should only be used when needed while interfacing with hardware."]
    pub fn DCInvalidateRange(addr: *mut cty::c_void, size: u32);
}
extern "C" {
    #[doc = " Flushes a range of cached data, in blocks. Equivalent to a loop of PowerPC"]
    #[doc = " \\c dcbf instructions, followed by a \\c sync and \\c eieio."]
    #[doc = ""]
    #[doc = " This function flushes any recently cached data into main memory."]
    #[doc = " This allows other hardware in the console to read the data without worry"]
    #[doc = " of main memory being outdated. It will also invalidate cached data."]
    #[doc = ""]
    #[doc = " \\param addr"]
    #[doc = " The effective address of the data to flush."]
    #[doc = ""]
    #[doc = " \\param size"]
    #[doc = " The size of the range to flush. Will be rounded up to the next 0x20."]
    #[doc = ""]
    #[doc = " \\note"]
    #[doc = " Unnecessary use of caching functions can have an adverse performance impact."]
    #[doc = " They should only be used when needed while interfacing with hardware."]
    pub fn DCFlushRange(addr: *mut cty::c_void, size: u32);
}
extern "C" {
    #[doc = " Stores a range of cached data, in blocks. Equivalent to a loop of PowerPC"]
    #[doc = " \\c dcbst instructions, followed by a \\c sync and \\c eieio."]
    #[doc = ""]
    #[doc = " This function writes any recently cached data into main memory."]
    #[doc = " This allows other hardware in the console to read the data without worry"]
    #[doc = " of main memory being outdated. This function does <em>not</em> invalidate"]
    #[doc = " the cached data."]
    #[doc = ""]
    #[doc = " \\param addr"]
    #[doc = " The effective address of the data to store."]
    #[doc = ""]
    #[doc = " \\param size"]
    #[doc = " The size of the range to store. Will be rounded up to the next 0x20."]
    #[doc = ""]
    #[doc = " \\note"]
    #[doc = " Unnecessary use of caching functions can have an adverse performance impact."]
    #[doc = " They should only be used when needed while interfacing with hardware."]
    pub fn DCStoreRange(addr: *mut cty::c_void, size: u32);
}
extern "C" {
    #[doc = " Similar to \\link DCFlushRange \\endlink, though this function will"]
    #[doc = " <em>not</em> run PowerPC \\c sync and \\c eieio instructions after flushing."]
    #[doc = ""]
    #[doc = " \\param addr"]
    #[doc = " The effective address of the data to flush."]
    #[doc = ""]
    #[doc = " \\param size"]
    #[doc = " The size of the range to flush. Will be rounded up to the next 0x20."]
    #[doc = ""]
    #[doc = " \\note"]
    #[doc = " Unnecessary use of caching functions can have an adverse performance impact."]
    #[doc = " They should only be used when needed while interfacing with hardware."]
    pub fn DCFlushRangeNoSync(addr: *mut cty::c_void, size: u32);
}
extern "C" {
    #[doc = " Similar to \\link DCStoreRange \\endlink, though this function will"]
    #[doc = " <em>not</em> run PowerPC \\c sync and \\c eieio instructions after storing."]
    #[doc = ""]
    #[doc = " \\param addr"]
    #[doc = " The effective address of the data to store."]
    #[doc = ""]
    #[doc = " \\param size"]
    #[doc = " The size of the range to store. Will be rounded up to the next 0x20."]
    #[doc = ""]
    #[doc = " \\note"]
    #[doc = " Unnecessary use of caching functions can have an adverse performance impact."]
    #[doc = " They should only be used when needed while interfacing with hardware."]
    pub fn DCStoreRangeNoSync(addr: *mut cty::c_void, size: u32);
}
extern "C" {
    #[doc = " Zeroes the given area of the data cache (to the nearest block) with a loop of"]
    #[doc = " PowerPC \\c dcbz instructions."]
    #[doc = " This will not affect main memory immediately, though it will eventually"]
    #[doc = " trickle down. Can be combined with \\link DCFlushRange \\endlink or"]
    #[doc = " \\link DCStoreRange \\endlink to efficiently set memory to 0."]
    #[doc = ""]
    #[doc = " \\warning"]
    #[doc = " The size of the range passed into this function will be internally rounded up"]
    #[doc = " to the next multiple of 0x20. Failing to account for this could result in"]
    #[doc = " delayed, hard-to-diagnose memory corruption."]
    #[doc = ""]
    #[doc = " \\param addr"]
    #[doc = " The effective address of the data to zero."]
    #[doc = ""]
    #[doc = " \\param size"]
    #[doc = " The size of the range to zero. Will be rounded up to the next 0x20."]
    pub fn DCZeroRange(addr: *mut cty::c_void, size: u32);
}
extern "C" {
    #[doc = " Gives the processor a hint that the given range of memory is likely to be"]
    #[doc = " accessed soon, and that performance would be improved if it were cached."]
    #[doc = " The processor does not have to cache the requested area, but it may do so in"]
    #[doc = " response to this function. This function is equvalent to a loop of PowerPC"]
    #[doc = " \\c dcbt instructions."]
    #[doc = ""]
    #[doc = " \\param addr"]
    #[doc = " The effective address of the data to cache."]
    #[doc = ""]
    #[doc = " \\param size"]
    #[doc = " The size of the range to cache. Will be rounded up to the next 0x20."]
    pub fn DCTouchRange(addr: *mut cty::c_void, size: u32);
}
extern "C" {
    #[doc = " Invalidates a range of cached instructions, in blocks. Equivalent to a loop"]
    #[doc = " of PowerPC \\c icbi instructions."]
    #[doc = ""]
    #[doc = " This function forces the next instruction fetches from the given address to"]
    #[doc = " bypass the the cache and go straight to memory, resulting in slower fetches"]
    #[doc = " that are guaranteed to reflect main memory."]
    #[doc = ""]
    #[doc = " \\param addr"]
    #[doc = " The effective address of the instructions to invalidate."]
    #[doc = ""]
    #[doc = " \\param size"]
    #[doc = " The size of the range to invalidate. Will be rounded up to the next 0x20."]
    #[doc = ""]
    #[doc = " \\note"]
    #[doc = " Unnecessary use of caching functions can have an adverse performance impact."]
    #[doc = " They should only be used when needed while interfacing with hardware."]
    pub fn ICInvalidateRange(addr: *mut cty::c_void, size: u32);
}
extern "C" {
    pub fn OSMemoryBarrier();
}
pub mod OSCodegenSecMode {
    #[doc = "! The memory permissions for the codegen area."]
    pub type Type = cty::c_uint;
    #[doc = "! The area can be read or written to, but not executed."]
    pub const CODEGEN_RW_: Type = 0;
    #[doc = "! The area can be read or executed, but not written to."]
    pub const CODEGEN_R_X: Type = 1;
}
extern "C" {
    #[doc = " Gets the location and size of codegen memory, if available."]
    #[doc = ""]
    #[doc = " \\param outVirtualAddress"]
    #[doc = " Pointer to write the virtual address of the codegen area to. Will write 0 if"]
    #[doc = " codegen isn't available."]
    #[doc = ""]
    #[doc = " \\param outSize"]
    #[doc = " Pointer to write the size of the codegen area to. Will write 0 if codegen"]
    #[doc = " isn't available."]
    #[doc = ""]
    #[doc = " \\sa"]
    #[doc = " - \\link OSGetSecCodeGenMode \\endlink"]
    pub fn OSCodegenGetVirtAddrRange(outVirtualAddress: *mut u32, outSize: *mut u32);
}
extern "C" {
    #[doc = " Gets the CPU core that's allowed to use codegen."]
    #[doc = ""]
    #[doc = " \\return"]
    #[doc = " The core id of the core that can use codegen."]
    #[doc = ""]
    #[doc = " \\sa"]
    #[doc = " - \\link OSGetCoreId \\endlink"]
    #[doc = ""]
    #[doc = " <!-- NOTE this appears to come from cos.xml: bottom few bits -->"]
    pub fn OSGetCodegenCore() -> u32;
}
extern "C" {
    pub fn OSGetCodegenMode() -> u32;
}
extern "C" {
    #[doc = " Switches the permissions on the codegen memory area. Use this function to"]
    #[doc = " move between writing code and executing it."]
    #[doc = ""]
    #[doc = " \\param mode"]
    #[doc = " The memory permission mode to use - one of \\link OSCodegenSecMode \\endlink."]
    #[doc = ""]
    #[doc = " \\returns"]
    #[doc = " \\c true on success, or \\c false on a failure, such as codegen not being"]
    #[doc = " available for this app or CPU core."]
    pub fn OSSwitchSecCodeGenMode(mode: OSCodegenSecMode::Type) -> BOOL;
}
extern "C" {
    pub fn OSGetSecCodeGenMode() -> u32;
}
extern "C" {
    #[doc = " Copies data from normal memory into the codegen area, leaving the area in"]
    #[doc = " \\link CODEGEN_R_X \\endlink mode."]
    #[doc = " This function copies into the codegen area regardless"]
    #[doc = " of the current permission status by switching modes as required for the copy."]
    #[doc = ""]
    #[doc = " \\param dst"]
    #[doc = " The starting virtual address of the area in codegen memory to copy to. Must"]
    #[doc = " be a valid pointer"]
    #[doc = ""]
    #[doc = " \\param src"]
    #[doc = " The starting virtual address of the source to copy from. Must be a valid"]
    #[doc = " pointer."]
    #[doc = ""]
    #[doc = " \\param size"]
    #[doc = " The size of the data to copy. Must not be 0, and must be small"]
    #[doc = " enough such that <tt>dst + size</tt> does not pass the end of the codegen"]
    #[doc = " area (see \\link OSCodegenGetVirtAddrRange \\endlink)."]
    #[doc = ""]
    #[doc = " \\return"]
    #[doc = " \\c TRUE on success, indicating the codegen area is now in"]
    #[doc = " \\link CODEGEN_R_X \\endlink, or \\c FALSE on an error, such as invalid pointers"]
    #[doc = " or codegen not being available."]
    #[doc = ""]
    #[doc = " <!-- NOTE this function has a specific bit required in cox.xml: 1 << 30? -->"]
    pub fn OSCodegenCopy(dst: *mut cty::c_void, src: *mut cty::c_void, size: size_t) -> BOOL;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSCondition {
    #[doc = "! Should always be set to the value OS_CONDITION_TAG."]
    pub tag: u32,
    #[doc = "! Name set by OSInitCondEx."]
    pub name: *const cty::c_char,
    pub __unk14: [cty::c_char; 4usize],
    #[doc = "! Queue of threads currently waiting on condition with OSWaitCond."]
    pub queue: OSThreadQueue,
}
#[test]
fn bindgen_test_layout_OSCondition() {
    assert_eq!(
        ::core::mem::size_of::<OSCondition>(),
        28usize,
        concat!("Size of: ", stringify!(OSCondition))
    );
    assert_eq!(
        ::core::mem::align_of::<OSCondition>(),
        4usize,
        concat!("Alignment of ", stringify!(OSCondition))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCondition>())).tag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCondition),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCondition>())).name as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCondition),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCondition>())).__unk14 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCondition),
            "::",
            stringify!(__unk14)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCondition>())).queue as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCondition),
            "::",
            stringify!(queue)
        )
    );
}
extern "C" {
    #[doc = " Initialise a condition variable structure."]
    pub fn OSInitCond(condition: *mut OSCondition);
}
extern "C" {
    #[doc = " Initialise a condition variable structure with a name."]
    pub fn OSInitCondEx(condition: *mut OSCondition, name: *const cty::c_char);
}
extern "C" {
    #[doc = " Sleep the current thread until the condition variable has been signalled."]
    #[doc = ""]
    #[doc = " The mutex must be locked when entering this function."]
    #[doc = " Will unlock the mutex and then sleep, reacquiring the mutex when woken."]
    #[doc = ""]
    #[doc = " Similar to <a href=\"http://en.cppreference.com/w/cpp/thread/condition_variable/wait\">std::condition_variable::wait</a>."]
    pub fn OSWaitCond(condition: *mut OSCondition, mutex: *mut OSMutex);
}
extern "C" {
    #[doc = " Will wake up any threads waiting on the condition with OSWaitCond."]
    #[doc = ""]
    #[doc = " Similar to <a href=\"http://en.cppreference.com/w/cpp/thread/condition_variable/notify_all\">std::condition_variable::notify_all</a>."]
    pub fn OSSignalCond(condition: *mut OSCondition);
}
extern "C" {
    #[doc = " Gets the number of cores in the system. On a retail Wii U, this is always 3."]
    #[doc = ""]
    #[doc = " \\returns"]
    #[doc = " The core count of the system."]
    pub fn OSGetCoreCount() -> u32;
}
extern "C" {
    #[doc = " Gets the core executing the current thread."]
    #[doc = ""]
    #[doc = " \\returns"]
    #[doc = " The ID of the current core."]
    pub fn OSGetCoreId() -> u32;
}
extern "C" {
    #[doc = " Gets the main core of the system. On a retail Wii U, this is always core 1."]
    #[doc = ""]
    #[doc = " \\returns"]
    #[doc = " The ID of the main core."]
    pub fn OSGetMainCoreId() -> u32;
}
extern "C" {
    #[doc = " Determines whether the current thread is running on the main core."]
    #[doc = " On a retail Wii U, the main core is always core 1."]
    #[doc = ""]
    #[doc = " \\returns"]
    #[doc = " \\c true if the current core is the main core."]
    #[doc = ""]
    #[doc = " \\sa"]
    #[doc = " <ul><li>\\link OSGetMainCoreId \\endlink</li></ul>"]
    pub fn OSIsMainCore() -> BOOL;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSCoroutine {
    pub nia: u32,
    pub cr: u32,
    pub ugqr1: u32,
    pub stack: u32,
    pub sda2Base: u32,
    pub sdaBase: u32,
    pub gpr: [u32; 18usize],
    pub fpr: [f64; 18usize],
    pub psr: [f64; 18usize],
}
#[test]
fn bindgen_test_layout_OSCoroutine() {
    assert_eq!(
        ::core::mem::size_of::<OSCoroutine>(),
        384usize,
        concat!("Size of: ", stringify!(OSCoroutine))
    );
    assert_eq!(
        ::core::mem::align_of::<OSCoroutine>(),
        8usize,
        concat!("Alignment of ", stringify!(OSCoroutine))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCoroutine>())).nia as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCoroutine),
            "::",
            stringify!(nia)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCoroutine>())).cr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCoroutine),
            "::",
            stringify!(cr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCoroutine>())).ugqr1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCoroutine),
            "::",
            stringify!(ugqr1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCoroutine>())).stack as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCoroutine),
            "::",
            stringify!(stack)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCoroutine>())).sda2Base as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCoroutine),
            "::",
            stringify!(sda2Base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCoroutine>())).sdaBase as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCoroutine),
            "::",
            stringify!(sdaBase)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCoroutine>())).gpr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCoroutine),
            "::",
            stringify!(gpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCoroutine>())).fpr as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCoroutine),
            "::",
            stringify!(fpr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSCoroutine>())).psr as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(OSCoroutine),
            "::",
            stringify!(psr)
        )
    );
}
extern "C" {
    pub fn OSInitCoroutine(
        coroutine: *mut OSCoroutine,
        entry: *mut cty::c_void,
        stack: *mut cty::c_void,
    );
}
extern "C" {
    pub fn OSLoadCoroutine(coroutine: *mut OSCoroutine, result: u32) -> u32;
}
extern "C" {
    pub fn OSSaveCoroutine(coroutine: *mut OSCoroutine) -> u32;
}
extern "C" {
    pub fn OSSwitchCoroutine(from: *mut OSCoroutine, to: *mut OSCoroutine);
}
pub mod COSReportLevel {
    pub type Type = cty::c_uint;
    pub const COS_REPORT_LEVEL_ERROR: Type = 0;
    pub const COS_REPORT_LEVEL_WARN: Type = 1;
    pub const COS_REPORT_LEVEL_INFO: Type = 2;
    pub const COS_REPORT_LEVEL_VERBOSE: Type = 3;
}
pub mod COSReportModule {
    pub type Type = cty::c_uint;
    pub const COS_REPORT_MODULE_UNKNOWN_0: Type = 0;
    pub const COS_REPORT_MODULE_UNKNOWN_1: Type = 1;
    pub const COS_REPORT_MODULE_UNKNOWN_2: Type = 2;
    pub const COS_REPORT_MODULE_UNKNOWN_5: Type = 5;
}
extern "C" {
    pub fn COSVReport(
        module: COSReportModule::Type,
        level: COSReportLevel::Type,
        fmt: *const cty::c_char,
        ...
    );
}
extern "C" {
    pub fn COSError(module: COSReportModule::Type, fmt: *const cty::c_char, ...);
}
extern "C" {
    pub fn COSInfo(module: COSReportModule::Type, fmt: *const cty::c_char, ...);
}
extern "C" {
    pub fn COSVerbose(module: COSReportModule::Type, fmt: *const cty::c_char, ...);
}
extern "C" {
    pub fn COSWarn(module: COSReportModule::Type, fmt: *const cty::c_char, ...);
}
pub type DisassemblyPrintFn =
    ::core::option::Option<unsafe extern "C" fn(fmt: *const cty::c_char, ...)>;
pub type DisassemblyFindSymbolFn = ::core::option::Option<
    unsafe extern "C" fn(addr: u32, symbolNameBuf: *mut cty::c_char, symbolNameBufSize: u32) -> u32,
>;
pub mod DisassemblePPCFlags {
    pub type Type = cty::c_uint;
    pub const DISASSEMBLE_PPC_FLAGS_NONE: Type = 0;
}
extern "C" {
    pub fn OSConsoleWrite(msg: *const cty::c_char, size: u32);
}
extern "C" {
    pub fn OSReport(fmt: *const cty::c_char, ...);
}
extern "C" {
    pub fn OSReportVerbose(fmt: *const cty::c_char, ...);
}
extern "C" {
    pub fn OSReportInfo(fmt: *const cty::c_char, ...);
}
extern "C" {
    pub fn OSReportWarn(fmt: *const cty::c_char, ...);
}
extern "C" {
    pub fn OSPanic(file: *const cty::c_char, line: u32, fmt: *const cty::c_char, ...);
}
extern "C" {
    pub fn OSFatal(msg: *const cty::c_char);
}
extern "C" {
    pub fn OSGetSymbolName(
        addr: u32,
        symbolNameBuf: *mut cty::c_char,
        symbolNameBufSize: u32,
    ) -> u32;
}
extern "C" {
    pub fn OSGetUPID() -> u32;
}
extern "C" {
    pub fn OSIsDebuggerInitialized() -> BOOL;
}
extern "C" {
    pub fn OSIsDebuggerPresent() -> BOOL;
}
extern "C" {
    pub fn OSIsECOBoot() -> BOOL;
}
extern "C" {
    pub fn OSIsECOMode() -> BOOL;
}
extern "C" {
    pub fn DisassemblePPCOpcode(
        opcode: *mut u32,
        buffer: *mut cty::c_char,
        bufferSize: u32,
        findSymbolFn: DisassemblyFindSymbolFn,
        flags: DisassemblePPCFlags::Type,
    ) -> BOOL;
}
extern "C" {
    pub fn DisassemblePPCRange(
        start: *mut cty::c_void,
        end: *mut cty::c_void,
        printFn: DisassemblyPrintFn,
        findSymbolFn: DisassemblyFindSymbolFn,
        flags: DisassemblePPCFlags::Type,
    );
}
pub type OSDynLoad_Module = *mut cty::c_void;
pub mod OSDynLoad_Error {
    pub type Type = cty::c_uint;
    pub const OS_DYNLOAD_OK: Type = 0;
    pub const OS_DYNLOAD_OUT_OF_MEMORY: Type = 3134259202;
    pub const OS_DYNLOAD_INVALID_NOTIFY_PTR: Type = 3134259214;
    pub const OS_DYNLOAD_INVALID_MODULE_NAME_PTR: Type = 3134259215;
    pub const OS_DYNLOAD_INVALID_MODULE_NAME: Type = 3134259216;
    pub const OS_DYNLOAD_INVALID_ACQUIRE_PTR: Type = 3134259217;
    pub const OS_DYNLOAD_EMPTY_MODULE_NAME: Type = 3134259218;
    pub const OS_DYNLOAD_INVALID_ALLOCATOR_PTR: Type = 3134259223;
    pub const OS_DYNLOAD_OUT_OF_SYSTEM_MEMORY: Type = 3134259247;
    pub const OS_DYNLOAD_TLS_ALLOCATOR_LOCKED: Type = 3134259249;
}
pub type OSDynLoadAllocFn = ::core::option::Option<
    unsafe extern "C" fn(
        size: i32,
        align: i32,
        outAddr: *mut *mut cty::c_void,
    ) -> OSDynLoad_Error::Type,
>;
pub type OSDynLoadFreeFn = ::core::option::Option<unsafe extern "C" fn(addr: *mut cty::c_void)>;
pub mod OSDynLoad_EntryReason {
    pub type Type = cty::c_uint;
    pub const OS_DYNLOAD_LOADED: Type = 0;
    pub const OS_DYNLOAD_UNLOADED: Type = 1;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSDynLoad_NotifyData {
    pub name: *mut cty::c_char,
    pub textAddr: u32,
    pub textOffset: u32,
    pub textSize: u32,
    pub dataAddr: u32,
    pub dataOffset: u32,
    pub dataSize: u32,
    pub readAddr: u32,
    pub readOffset: u32,
    pub readSize: u32,
}
#[test]
fn bindgen_test_layout_OSDynLoad_NotifyData() {
    assert_eq!(
        ::core::mem::size_of::<OSDynLoad_NotifyData>(),
        40usize,
        concat!("Size of: ", stringify!(OSDynLoad_NotifyData))
    );
    assert_eq!(
        ::core::mem::align_of::<OSDynLoad_NotifyData>(),
        4usize,
        concat!("Alignment of ", stringify!(OSDynLoad_NotifyData))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSDynLoad_NotifyData>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSDynLoad_NotifyData),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSDynLoad_NotifyData>())).textAddr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSDynLoad_NotifyData),
            "::",
            stringify!(textAddr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<OSDynLoad_NotifyData>())).textOffset as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OSDynLoad_NotifyData),
            "::",
            stringify!(textOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSDynLoad_NotifyData>())).textSize as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(OSDynLoad_NotifyData),
            "::",
            stringify!(textSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSDynLoad_NotifyData>())).dataAddr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(OSDynLoad_NotifyData),
            "::",
            stringify!(dataAddr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<OSDynLoad_NotifyData>())).dataOffset as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(OSDynLoad_NotifyData),
            "::",
            stringify!(dataOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSDynLoad_NotifyData>())).dataSize as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(OSDynLoad_NotifyData),
            "::",
            stringify!(dataSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSDynLoad_NotifyData>())).readAddr as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(OSDynLoad_NotifyData),
            "::",
            stringify!(readAddr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<OSDynLoad_NotifyData>())).readOffset as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(OSDynLoad_NotifyData),
            "::",
            stringify!(readOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSDynLoad_NotifyData>())).readSize as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(OSDynLoad_NotifyData),
            "::",
            stringify!(readSize)
        )
    );
}
extern "C" {
    #[doc = " Load a module."]
    #[doc = ""]
    #[doc = " If the module is already loaded, increase reference count."]
    #[doc = " Similar to LoadLibrary on Windows."]
    pub fn OSDynLoad_Acquire(
        name: *const cty::c_char,
        outModule: *mut OSDynLoad_Module,
    ) -> OSDynLoad_Error::Type;
}
extern "C" {
    #[doc = " Retrieve the address of a function or data export from a module."]
    #[doc = ""]
    #[doc = " Similar to GetProcAddress on Windows."]
    pub fn OSDynLoad_FindExport(
        module: OSDynLoad_Module,
        isData: BOOL,
        name: *const cty::c_char,
        outAddr: *mut *mut cty::c_void,
    ) -> OSDynLoad_Error::Type;
}
extern "C" {
    #[doc = " Free a module handle returned from OSDynLoad_Acquire."]
    #[doc = ""]
    #[doc = " Will decrease reference count and only unload the module if count reaches 0."]
    #[doc = " Similar to FreeLibrary on Windows."]
    pub fn OSDynLoad_Release(module: OSDynLoad_Module);
}
extern "C" {
    #[doc = " Set the allocator functions to use for dynamic loading."]
    pub fn OSDynLoad_SetAllocator(
        allocFn: OSDynLoadAllocFn,
        freeFn: OSDynLoadFreeFn,
    ) -> OSDynLoad_Error::Type;
}
extern "C" {
    #[doc = " Get the allocator functions used for dynamic loading."]
    pub fn OSDynLoad_GetAllocator(
        outAllocFn: *mut OSDynLoadAllocFn,
        outFreeFn: *mut OSDynLoadFreeFn,
    ) -> OSDynLoad_Error::Type;
}
extern "C" {
    #[doc = " Set the allocator functions to use for thread local storage."]
    pub fn OSDynLoad_SetTLSAllocator(
        allocFn: OSDynLoadAllocFn,
        freeFn: OSDynLoadFreeFn,
    ) -> OSDynLoad_Error::Type;
}
extern "C" {
    #[doc = " Get the allocator functions used for thread local storage."]
    pub fn OSDynLoad_GetTLSAllocator(
        outAllocFn: *mut OSDynLoadAllocFn,
        outFreeFn: *mut OSDynLoadFreeFn,
    ) -> OSDynLoad_Error::Type;
}
extern "C" {
    #[doc = " Gets the name for a given module handle."]
    #[doc = " Using the value \"-1\" as module handle gets the name of the running main rpl"]
    pub fn OSDynLoad_GetModuleName(
        module: OSDynLoad_Module,
        nameBuf: *mut cty::c_char,
        nameBufSize: *mut i32,
    ) -> OSDynLoad_Error::Type;
}
extern "C" {
    #[doc = " Gets the number of currently loaded RPLs."]
    #[doc = ""]
    #[doc = " Always returns 0 on release versions of CafeOS."]
    #[doc = " Requires OSGetSecurityLevel() > 0."]
    pub fn OSDynLoad_GetNumberOfRPLs() -> i32;
}
extern "C" {
    #[doc = " Get information about the currently loaded RPLs."]
    #[doc = ""]
    #[doc = " \\param first the index of the first RPL to retrieve info for."]
    #[doc = " \\param count the number of RPLs to retrieve info for"]
    #[doc = " \\param outInfos buffer of RPL info to be filled, should be an array of at"]
    #[doc = "                 least count size."]
    #[doc = ""]
    #[doc = " Always returns FALSE on release versions of CafeOS."]
    #[doc = " Requires OSGetSecurityLevel() > 0."]
    pub fn OSDynLoad_GetRPLInfo(
        first: u32,
        count: u32,
        outInfos: *mut OSDynLoad_NotifyData,
    ) -> BOOL;
}
extern "C" {
    #[doc = " The prototype for an RPL entry point."]
    #[doc = ""]
    #[doc = " Use this instead of main when creating .rpl files"]
    pub fn rpl_entry(module: OSDynLoad_Module, reason: OSDynLoad_EntryReason::Type) -> cty::c_int;
}
pub type IMError = i32;
extern "C" {
    pub fn IMDisableAPD() -> IMError;
}
extern "C" {
    pub fn IMDisableDim() -> IMError;
}
extern "C" {
    pub fn IMEnableAPD() -> IMError;
}
extern "C" {
    pub fn IMEnableDim() -> IMError;
}
extern "C" {
    pub fn IMIsAPDEnabled(outValue: *mut u32) -> IMError;
}
extern "C" {
    pub fn IMIsAPDEnabledBySysSettings(outValue: *mut u32) -> IMError;
}
extern "C" {
    pub fn IMIsDimEnabled(outValue: *mut u32) -> IMError;
}
extern "C" {
    pub fn IMGetDimEnableDrc(outValue: *mut u32) -> IMError;
}
extern "C" {
    pub fn IMGetDimEnableTv(outValue: *mut u32) -> IMError;
}
extern "C" {
    pub fn IMGetDimPeriod(outValue: *mut u32) -> IMError;
}
extern "C" {
    pub fn IMGetTimeBeforeAPD(outSeconds: *mut u32) -> IMError;
}
extern "C" {
    pub fn IMGetTimeBeforeDimming(outSeconds: *mut u32) -> IMError;
}
extern "C" {
    pub fn IMSetDimEnableDrc(value: BOOL) -> IMError;
}
extern "C" {
    pub fn IMSetDimEnableTv(value: BOOL) -> IMError;
}
extern "C" {
    pub fn IMStartAPDVideoMode() -> IMError;
}
pub mod OSEventMode {
    pub type Type = cty::c_uint;
    #[doc = "! A manual event will only reset when OSResetEvent is called."]
    pub const OS_EVENT_MODE_MANUAL: Type = 0;
    #[doc = "! An auto event will reset everytime a thread is woken."]
    pub const OS_EVENT_MODE_AUTO: Type = 1;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSEvent {
    #[doc = "! Should always be set to the value OS_EVENT_TAG."]
    pub tag: u32,
    #[doc = "! Name set by OSInitEventEx."]
    pub name: *const cty::c_char,
    pub __unk15: [cty::c_char; 4usize],
    #[doc = "! The current value of the event object."]
    pub value: BOOL,
    #[doc = "! The threads currently waiting on this event object with OSWaitEvent."]
    pub queue: OSThreadQueue,
    #[doc = "! The mode of the event object, set by OSInitEvent."]
    pub mode: OSEventMode::Type,
}
#[test]
fn bindgen_test_layout_OSEvent() {
    assert_eq!(
        ::core::mem::size_of::<OSEvent>(),
        36usize,
        concat!("Size of: ", stringify!(OSEvent))
    );
    assert_eq!(
        ::core::mem::align_of::<OSEvent>(),
        4usize,
        concat!("Alignment of ", stringify!(OSEvent))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSEvent>())).tag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSEvent),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSEvent>())).name as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSEvent),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSEvent>())).__unk15 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OSEvent),
            "::",
            stringify!(__unk15)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSEvent>())).value as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(OSEvent),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSEvent>())).queue as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(OSEvent),
            "::",
            stringify!(queue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSEvent>())).mode as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(OSEvent),
            "::",
            stringify!(mode)
        )
    );
}
extern "C" {
    #[doc = " Initialise an event object with value and mode."]
    pub fn OSInitEvent(event: *mut OSEvent, value: BOOL, mode: OSEventMode::Type);
}
extern "C" {
    #[doc = " Initialise an event object with value, mode and name."]
    pub fn OSInitEventEx(
        event: *mut OSEvent,
        value: BOOL,
        mode: OSEventMode::Type,
        name: *mut cty::c_char,
    );
}
extern "C" {
    #[doc = " Signals the event."]
    #[doc = ""]
    #[doc = " If no threads are waiting the event value is set."]
    #[doc = ""]
    #[doc = " If the event mode is OS_EVENT_MODE_MANUAL this will wake all waiting threads"]
    #[doc = " and the event will remain set until OSResetEvent is called."]
    #[doc = ""]
    #[doc = " If the event mode is OS_EVENT_MODE_AUTO this will wake only one thread"]
    #[doc = " and the event will be reset immediately."]
    #[doc = ""]
    #[doc = " Similar to <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms686211(v=vs.85).aspx\">SetEvent</a>."]
    pub fn OSSignalEvent(event: *mut OSEvent);
}
extern "C" {
    #[doc = " Signals all threads waiting on an event."]
    #[doc = ""]
    #[doc = " If no threads are waiting the event value is set."]
    #[doc = ""]
    #[doc = " If the event mode is OS_EVENT_MODE_MANUAL this will wake all waiting threads"]
    #[doc = " and the event will remain set until OSResetEvent is called."]
    #[doc = ""]
    #[doc = " If the event mode is OS_EVENT_MODE_AUTO this will wake all waiting threads"]
    #[doc = " and the event will be reset."]
    pub fn OSSignalEventAll(event: *mut OSEvent);
}
extern "C" {
    #[doc = " Wait until an event is signalled."]
    #[doc = ""]
    #[doc = " If the event is already set, this returns immediately."]
    #[doc = ""]
    #[doc = " If the event mode is OS_EVENT_MODE_AUTO the event will be reset before"]
    #[doc = " returning from this method."]
    #[doc = ""]
    #[doc = " Similar to <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms687032(v=vs.85).aspx\">WaitForSingleObject</a>."]
    pub fn OSWaitEvent(event: *mut OSEvent);
}
extern "C" {
    #[doc = " Resets the event object."]
    #[doc = ""]
    #[doc = " Similar to <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms685081(v=vs.85).aspx\">ResetEvent</a>."]
    pub fn OSResetEvent(event: *mut OSEvent);
}
extern "C" {
    #[doc = " Wait until an event is signalled or a timeout has occurred."]
    #[doc = ""]
    #[doc = " Similar to <a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms687032(v=vs.85).aspx\">WaitForSingleObject</a>."]
    pub fn OSWaitEventWithTimeout(event: *mut OSEvent, timeout: OSTime) -> BOOL;
}
pub type OSExceptionCallbackFn =
    ::core::option::Option<unsafe extern "C" fn(context: *mut OSContext) -> BOOL>;
pub mod OSExceptionMode {
    pub type Type = cty::c_uint;
    pub const OS_EXCEPTION_MODE_SYSTEM: Type = 0;
    pub const OS_EXCEPTION_MODE_THREAD: Type = 1;
    pub const OS_EXCEPTION_MODE_GLOBAL: Type = 2;
    pub const OS_EXCEPTION_MODE_THREAD_ALL_CORES: Type = 3;
    pub const OS_EXCEPTION_MODE_GLOBAL_ALL_CORES: Type = 4;
}
pub mod OSExceptionType {
    pub type Type = cty::c_uint;
    pub const OS_EXCEPTION_TYPE_SYSTEM_RESET: Type = 0;
    pub const OS_EXCEPTION_TYPE_MACHINE_CHECK: Type = 1;
    pub const OS_EXCEPTION_TYPE_DSI: Type = 2;
    pub const OS_EXCEPTION_TYPE_ISI: Type = 3;
    pub const OS_EXCEPTION_TYPE_EXTERNAL_INTERRUPT: Type = 4;
    pub const OS_EXCEPTION_TYPE_ALIGNMENT: Type = 5;
    pub const OS_EXCEPTION_TYPE_PROGRAM: Type = 6;
    pub const OS_EXCEPTION_TYPE_FLOATING_POINT: Type = 7;
    pub const OS_EXCEPTION_TYPE_DECREMENTER: Type = 8;
    pub const OS_EXCEPTION_TYPE_SYSTEM_CALL: Type = 9;
    pub const OS_EXCEPTION_TYPE_TRACE: Type = 10;
    pub const OS_EXCEPTION_TYPE_PERFORMANCE_MONITOR: Type = 11;
    pub const OS_EXCEPTION_TYPE_BREAKPOINT: Type = 12;
    pub const OS_EXCEPTION_TYPE_SYSTEM_INTERRUPT: Type = 13;
    pub const OS_EXCEPTION_TYPE_ICI: Type = 14;
}
extern "C" {
    pub fn OSSetExceptionCallback(
        exceptionType: OSExceptionType::Type,
        callback: OSExceptionCallbackFn,
    ) -> OSExceptionCallbackFn;
}
extern "C" {
    pub fn OSSetExceptionCallbackEx(
        mode: OSExceptionMode::Type,
        exceptionType: OSExceptionType::Type,
        callback: OSExceptionCallbackFn,
    ) -> OSExceptionCallbackFn;
}
extern "C" {
    pub fn __rplwrap_exit(code: cty::c_int);
}
extern "C" {
    pub fn _Exit(code: cty::c_int);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSFastCondition {
    pub tag: u32,
    pub name: *const cty::c_char,
    pub __unk16: [cty::c_char; 4usize],
    pub queue: OSThreadQueue,
}
#[test]
fn bindgen_test_layout_OSFastCondition() {
    assert_eq!(
        ::core::mem::size_of::<OSFastCondition>(),
        28usize,
        concat!("Size of: ", stringify!(OSFastCondition))
    );
    assert_eq!(
        ::core::mem::align_of::<OSFastCondition>(),
        4usize,
        concat!("Alignment of ", stringify!(OSFastCondition))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSFastCondition>())).tag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSFastCondition),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSFastCondition>())).name as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSFastCondition),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSFastCondition>())).__unk16 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OSFastCondition),
            "::",
            stringify!(__unk16)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSFastCondition>())).queue as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(OSFastCondition),
            "::",
            stringify!(queue)
        )
    );
}
extern "C" {
    pub fn OSFastCond_Init(condition: *mut OSFastCondition, name: *const cty::c_char);
}
extern "C" {
    pub fn OSFastCond_Wait(condition: *mut OSFastCondition, mutex: *mut OSFastMutex);
}
extern "C" {
    pub fn OSFastCond_Signal(condition: *mut OSFastCondition);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSFastMutexLink {
    pub next: *mut OSFastMutex,
    pub prev: *mut OSFastMutex,
}
#[test]
fn bindgen_test_layout_OSFastMutexLink() {
    assert_eq!(
        ::core::mem::size_of::<OSFastMutexLink>(),
        8usize,
        concat!("Size of: ", stringify!(OSFastMutexLink))
    );
    assert_eq!(
        ::core::mem::align_of::<OSFastMutexLink>(),
        4usize,
        concat!("Alignment of ", stringify!(OSFastMutexLink))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSFastMutexLink>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSFastMutexLink),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSFastMutexLink>())).prev as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSFastMutexLink),
            "::",
            stringify!(prev)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSFastMutex {
    pub tag: u32,
    pub name: *const cty::c_char,
    pub __unk17: [cty::c_char; 4usize],
    pub queue: OSThreadSimpleQueue,
    pub link: OSFastMutexLink,
    pub __unk18: [cty::c_char; 16usize],
}
#[test]
fn bindgen_test_layout_OSFastMutex() {
    assert_eq!(
        ::core::mem::size_of::<OSFastMutex>(),
        44usize,
        concat!("Size of: ", stringify!(OSFastMutex))
    );
    assert_eq!(
        ::core::mem::align_of::<OSFastMutex>(),
        4usize,
        concat!("Alignment of ", stringify!(OSFastMutex))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSFastMutex>())).tag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSFastMutex),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSFastMutex>())).name as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSFastMutex),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSFastMutex>())).__unk17 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OSFastMutex),
            "::",
            stringify!(__unk17)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSFastMutex>())).queue as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(OSFastMutex),
            "::",
            stringify!(queue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSFastMutex>())).link as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(OSFastMutex),
            "::",
            stringify!(link)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSFastMutex>())).__unk18 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(OSFastMutex),
            "::",
            stringify!(__unk18)
        )
    );
}
extern "C" {
    pub fn OSFastMutex_Init(mutex: *mut OSFastMutex, name: *const cty::c_char);
}
extern "C" {
    pub fn OSFastMutex_Lock(mutex: *mut OSFastMutex);
}
extern "C" {
    pub fn OSFastMutex_Unlock(mutex: *mut OSFastMutex);
}
extern "C" {
    pub fn OSFastMutex_TryLock(mutex: *mut OSFastMutex) -> BOOL;
}
pub type OSFiberEntryFn = ::core::option::Option<unsafe extern "C" fn()>;
pub type OSFiberExEntryFn =
    ::core::option::Option<unsafe extern "C" fn(arg1: u32, arg2: u32, arg3: u32, arg4: u32)>;
extern "C" {
    pub fn OSSwitchFiber(entry: OSFiberEntryFn, stack: *mut cty::c_void) -> i32;
}
extern "C" {
    pub fn OSSwitchFiberEx(
        arg1: u32,
        arg2: u32,
        arg3: u32,
        arg4: u32,
        entry: OSFiberExEntryFn,
        stack: *mut cty::c_void,
    ) -> i32;
}
pub mod OSMessageFlags {
    pub type Type = cty::c_uint;
    pub const OS_MESSAGE_FLAGS_NONE: Type = 0;
    pub const OS_MESSAGE_FLAGS_BLOCKING: Type = 1;
    pub const OS_MESSAGE_FLAGS_HIGH_PRIORITY: Type = 2;
}
pub mod OSFunctionType {
    pub type Type = cty::c_uint;
    pub const OS_FUNCTION_TYPE_HIO_OPEN: Type = 1;
    pub const OS_FUNCTION_TYPE_HIO_READ_ASYNC: Type = 2;
    pub const OS_FUNCTION_TYPE_HIO_WRITE_ASYNC: Type = 3;
    pub const OS_FUNCTION_TYPE_FSA_CMD_ASYNC: Type = 4;
    pub const OS_FUNCTION_TYPE_FSA_PR_CMD_ASYNC: Type = 5;
    pub const OS_FUNCTION_TYPE_FSA_PR_CMD_ASYNC_NO_ALLOC: Type = 6;
    pub const OS_FUNCTION_TYPE_FSA_ATTACH_EVENT: Type = 7;
    pub const OS_FUNCTION_TYPE_FS_CMD_ASYNC: Type = 8;
    pub const OS_FUNCTION_TYPE_FS_CMD_HANDLER: Type = 9;
    pub const OS_FUNCTION_TYPE_FS_ATTACH_EVENT: Type = 10;
    pub const OS_FUNCTION_TYPE_FS_STATE_CHANGE_EVENT: Type = 11;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSMessage {
    pub message: *mut cty::c_void,
    pub args: [u32; 3usize],
}
#[test]
fn bindgen_test_layout_OSMessage() {
    assert_eq!(
        ::core::mem::size_of::<OSMessage>(),
        16usize,
        concat!("Size of: ", stringify!(OSMessage))
    );
    assert_eq!(
        ::core::mem::align_of::<OSMessage>(),
        4usize,
        concat!("Alignment of ", stringify!(OSMessage))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMessage>())).message as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMessage),
            "::",
            stringify!(message)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMessage>())).args as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMessage),
            "::",
            stringify!(args)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSMessageQueue {
    pub tag: u32,
    pub name: *const cty::c_char,
    pub __unk19: [cty::c_char; 4usize],
    pub sendQueue: OSThreadQueue,
    pub recvQueue: OSThreadQueue,
    pub messages: *mut OSMessage,
    pub size: u32,
    pub first: u32,
    pub used: u32,
}
#[test]
fn bindgen_test_layout_OSMessageQueue() {
    assert_eq!(
        ::core::mem::size_of::<OSMessageQueue>(),
        60usize,
        concat!("Size of: ", stringify!(OSMessageQueue))
    );
    assert_eq!(
        ::core::mem::align_of::<OSMessageQueue>(),
        4usize,
        concat!("Alignment of ", stringify!(OSMessageQueue))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMessageQueue>())).tag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMessageQueue),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMessageQueue>())).name as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMessageQueue),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMessageQueue>())).__unk19 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMessageQueue),
            "::",
            stringify!(__unk19)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMessageQueue>())).sendQueue as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMessageQueue),
            "::",
            stringify!(sendQueue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMessageQueue>())).recvQueue as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMessageQueue),
            "::",
            stringify!(recvQueue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMessageQueue>())).messages as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMessageQueue),
            "::",
            stringify!(messages)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMessageQueue>())).size as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMessageQueue),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMessageQueue>())).first as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMessageQueue),
            "::",
            stringify!(first)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMessageQueue>())).used as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMessageQueue),
            "::",
            stringify!(used)
        )
    );
}
extern "C" {
    pub fn OSInitMessageQueue(queue: *mut OSMessageQueue, messages: *mut OSMessage, size: i32);
}
extern "C" {
    pub fn OSInitMessageQueueEx(
        queue: *mut OSMessageQueue,
        messages: *mut OSMessage,
        size: i32,
        name: *const cty::c_char,
    );
}
extern "C" {
    pub fn OSSendMessage(
        queue: *mut OSMessageQueue,
        message: *mut OSMessage,
        flags: OSMessageFlags::Type,
    ) -> BOOL;
}
extern "C" {
    pub fn OSReceiveMessage(
        queue: *mut OSMessageQueue,
        message: *mut OSMessage,
        flags: OSMessageFlags::Type,
    ) -> BOOL;
}
extern "C" {
    pub fn OSPeekMessage(queue: *mut OSMessageQueue, message: *mut OSMessage) -> BOOL;
}
extern "C" {
    pub fn OSGetSystemMessageQueue() -> *mut OSMessageQueue;
}
pub type FSDirectoryHandle = u32;
pub type FSFileHandle = u32;
pub type FSPriority = u32;
pub mod FSStatus {
    pub type Type = cty::c_int;
    pub const FS_STATUS_OK: Type = 0;
    pub const FS_STATUS_CANCELLED: Type = -1;
    pub const FS_STATUS_END: Type = -2;
    pub const FS_STATUS_MAX: Type = -3;
    pub const FS_STATUS_ALREADY_OPEN: Type = -4;
    pub const FS_STATUS_EXISTS: Type = -5;
    pub const FS_STATUS_NOT_FOUND: Type = -6;
    pub const FS_STATUS_NOT_FILE: Type = -7;
    pub const FS_STATUS_NOT_DIR: Type = -8;
    pub const FS_STATUS_ACCESS_ERROR: Type = -9;
    pub const FS_STATUS_PERMISSION_ERROR: Type = -10;
    pub const FS_STATUS_FILE_TOO_BIG: Type = -11;
    pub const FS_STATUS_STORAGE_FULL: Type = -12;
    pub const FS_STATUS_JOURNAL_FULL: Type = -13;
    pub const FS_STATUS_UNSUPPORTED_CMD: Type = -14;
    pub const FS_STATUS_MEDIA_NOT_READY: Type = -15;
    pub const FS_STATUS_MEDIA_ERROR: Type = -17;
    pub const FS_STATUS_CORRUPTED: Type = -18;
    pub const FS_STATUS_FATAL_ERROR: Type = -1024;
}
pub mod FSError {
    pub type Type = cty::c_int;
    pub const FS_ERROR_NOT_INIT: Type = -196609;
    pub const FS_ERROR_BUSY: Type = -196610;
    pub const FS_ERROR_CANCELLED: Type = -196611;
    pub const FS_ERROR_END_OF_DIR: Type = -196612;
    pub const FS_ERROR_END_OF_FILE: Type = -196613;
    pub const FS_ERROR_MAX_MOUNT_POINTS: Type = -196624;
    pub const FS_ERROR_MAX_VOLUMES: Type = -196625;
    pub const FS_ERROR_MAX_CLIENTS: Type = -196626;
    pub const FS_ERROR_MAX_FILES: Type = -196627;
    pub const FS_ERROR_MAX_DIRS: Type = -196628;
    pub const FS_ERROR_ALREADY_OPEN: Type = -196629;
    pub const FS_ERROR_ALREADY_EXISTS: Type = -196630;
    pub const FS_ERROR_NOT_FOUND: Type = -196631;
    pub const FS_ERROR_NOT_EMPTY: Type = -196632;
    pub const FS_ERROR_ACCESS_ERROR: Type = -196633;
    pub const FS_ERROR_PERMISSION_ERROR: Type = -196634;
    pub const FS_ERROR_DATA_CORRUPTED: Type = -196635;
    pub const FS_ERROR_STORAGE_FULL: Type = -196636;
    pub const FS_ERROR_JOURNAL_FULL: Type = -196637;
    pub const FS_ERROR_UNAVAILABLE_COMMAND: Type = -196639;
    pub const FS_ERROR_UNSUPPORTED_COMMAND: Type = -196640;
    pub const FS_ERROR_INVALID_PARAM: Type = -196641;
    pub const FS_ERROR_INVALID_PATH: Type = -196642;
    pub const FS_ERROR_INVALID_BUFFER: Type = -196643;
    pub const FS_ERROR_INVALID_ALIGNMENT: Type = -196644;
    pub const FS_ERROR_INVALID_CLIENTHANDLE: Type = -196645;
    pub const FS_ERROR_INVALID_FILEHANDLE: Type = -196646;
    pub const FS_ERROR_INVALID_DIRHANDLE: Type = -196647;
    pub const FS_ERROR_NOT_FILE: Type = -196648;
    pub const FS_ERROR_NOT_DIR: Type = -196649;
    pub const FS_ERROR_FILE_TOO_BIG: Type = -196650;
    pub const FS_ERROR_OUT_OF_RANGE: Type = -196651;
    pub const FS_ERROR_OUT_OF_RESOURCES: Type = -196652;
    pub const FS_ERROR_MEDIA_NOT_READY: Type = -196656;
    pub const FS_ERROR_MEDIA_ERROR: Type = -196657;
    pub const FS_ERROR_WRITE_PROTECTED: Type = -196658;
    pub const FS_ERROR_INVALID_MEDIA: Type = -196659;
}
pub mod FSMode {
    pub type Type = cty::c_uint;
    pub const FS_MODE_READ_OWNER: Type = 1024;
    pub const FS_MODE_WRITE_OWNER: Type = 512;
    pub const FS_MODE_EXEC_OWNER: Type = 256;
    pub const FS_MODE_READ_GROUP: Type = 64;
    pub const FS_MODE_WRITE_GROUP: Type = 32;
    pub const FS_MODE_EXEC_GROUP: Type = 16;
    pub const FS_MODE_READ_OTHER: Type = 4;
    pub const FS_MODE_WRITE_OTHER: Type = 2;
    pub const FS_MODE_EXEC_OTHER: Type = 1;
}
pub mod FSStatFlags {
    pub type Type = cty::c_uint;
    pub const FS_STAT_DIRECTORY: Type = 2147483648;
}
pub mod FSVolumeState {
    pub type Type = cty::c_uint;
    pub const FS_VOLUME_STATE_INITIAL: Type = 0;
    pub const FS_VOLUME_STATE_READY: Type = 1;
    pub const FS_VOLUME_STATE_NO_MEDIA: Type = 2;
    pub const FS_VOLUME_STATE_INVALID_MEDIA: Type = 3;
    pub const FS_VOLUME_STATE_DIRTY_MEDIA: Type = 4;
    pub const FS_VOLUME_STATE_WRONG_MEDIA: Type = 5;
    pub const FS_VOLUME_STATE_MEDIA_ERROR: Type = 6;
    pub const FS_VOLUME_STATE_DATA_CORRUPTED: Type = 7;
    pub const FS_VOLUME_STATE_WRITE_PROTECTED: Type = 8;
    pub const FS_VOLUME_STATE_JOURNAL_FULL: Type = 9;
    pub const FS_VOLUME_STATE_FATAL: Type = 10;
    pub const FS_VOLUME_STATE_INVALID: Type = 11;
}
pub mod FSMountSourceType {
    pub type Type = cty::c_uint;
    pub const FS_MOUNT_SOURCE_SD: Type = 0;
    pub const FS_MOUNT_SOURCE_UNK: Type = 1;
}
pub type FSAsyncCallback = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut FSClient,
        arg2: *mut FSCmdBlock,
        arg3: FSStatus::Type,
        arg4: u32,
    ),
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct FSClient {
    pub __unk20: [cty::c_char; 5888usize],
}
#[test]
fn bindgen_test_layout_FSClient() {
    assert_eq!(
        ::core::mem::size_of::<FSClient>(),
        5888usize,
        concat!("Size of: ", stringify!(FSClient))
    );
    assert_eq!(
        ::core::mem::align_of::<FSClient>(),
        1usize,
        concat!("Alignment of ", stringify!(FSClient))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSClient>())).__unk20 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FSClient),
            "::",
            stringify!(__unk20)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct FSCmdBlock {
    pub __unk21: [cty::c_char; 2688usize],
}
#[test]
fn bindgen_test_layout_FSCmdBlock() {
    assert_eq!(
        ::core::mem::size_of::<FSCmdBlock>(),
        2688usize,
        concat!("Size of: ", stringify!(FSCmdBlock))
    );
    assert_eq!(
        ::core::mem::align_of::<FSCmdBlock>(),
        1usize,
        concat!("Alignment of ", stringify!(FSCmdBlock))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSCmdBlock>())).__unk21 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FSCmdBlock),
            "::",
            stringify!(__unk21)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct FSStat {
    pub flags: FSStatFlags::Type,
    pub mode: FSMode::Type,
    pub owner: u32,
    pub group: u32,
    pub size: u32,
    pub allocSize: u32,
    pub quotaSize: u64,
    pub entryId: u32,
    pub created: i64,
    pub modified: i64,
    pub __unk22: [cty::c_char; 48usize],
}
#[test]
fn bindgen_test_layout_FSStat() {
    assert_eq!(
        ::core::mem::size_of::<FSStat>(),
        100usize,
        concat!("Size of: ", stringify!(FSStat))
    );
    assert_eq!(
        ::core::mem::align_of::<FSStat>(),
        1usize,
        concat!("Alignment of ", stringify!(FSStat))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSStat>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FSStat),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSStat>())).mode as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FSStat),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSStat>())).owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FSStat),
            "::",
            stringify!(owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSStat>())).group as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FSStat),
            "::",
            stringify!(group)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSStat>())).size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FSStat),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSStat>())).allocSize as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FSStat),
            "::",
            stringify!(allocSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSStat>())).quotaSize as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FSStat),
            "::",
            stringify!(quotaSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSStat>())).entryId as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FSStat),
            "::",
            stringify!(entryId)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSStat>())).created as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FSStat),
            "::",
            stringify!(created)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSStat>())).modified as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(FSStat),
            "::",
            stringify!(modified)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSStat>())).__unk22 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(FSStat),
            "::",
            stringify!(__unk22)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FSStateChangeInfo {
    pub __unk23: [cty::c_char; 12usize],
}
#[test]
fn bindgen_test_layout_FSStateChangeInfo() {
    assert_eq!(
        ::core::mem::size_of::<FSStateChangeInfo>(),
        12usize,
        concat!("Size of: ", stringify!(FSStateChangeInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<FSStateChangeInfo>(),
        1usize,
        concat!("Alignment of ", stringify!(FSStateChangeInfo))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSStateChangeInfo>())).__unk23 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FSStateChangeInfo),
            "::",
            stringify!(__unk23)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FSMessage {
    #[doc = "! Message data"]
    pub data: *mut cty::c_void,
    pub __unk24: [cty::c_char; 8usize],
    #[doc = "! Type of message"]
    pub type_: OSFunctionType::Type,
}
#[test]
fn bindgen_test_layout_FSMessage() {
    assert_eq!(
        ::core::mem::size_of::<FSMessage>(),
        16usize,
        concat!("Size of: ", stringify!(FSMessage))
    );
    assert_eq!(
        ::core::mem::align_of::<FSMessage>(),
        4usize,
        concat!("Alignment of ", stringify!(FSMessage))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSMessage>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FSMessage),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSMessage>())).__unk24 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FSMessage),
            "::",
            stringify!(__unk24)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSMessage>())).type_ as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FSMessage),
            "::",
            stringify!(type_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FSAsyncData {
    pub callback: FSAsyncCallback,
    pub param: u32,
    pub ioMsgQueue: *mut OSMessageQueue,
}
#[test]
fn bindgen_test_layout_FSAsyncData() {
    assert_eq!(
        ::core::mem::size_of::<FSAsyncData>(),
        12usize,
        concat!("Size of: ", stringify!(FSAsyncData))
    );
    assert_eq!(
        ::core::mem::align_of::<FSAsyncData>(),
        4usize,
        concat!("Alignment of ", stringify!(FSAsyncData))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSAsyncData>())).callback as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAsyncData),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSAsyncData>())).param as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAsyncData),
            "::",
            stringify!(param)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSAsyncData>())).ioMsgQueue as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAsyncData),
            "::",
            stringify!(ioMsgQueue)
        )
    );
}
#[doc = " Stores the result of an async FS command."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FSAsyncResult {
    #[doc = "! User supplied async data."]
    pub asyncData: FSAsyncData,
    #[doc = "! Message to put into asyncdata.ioMsgQueue."]
    pub ioMsg: FSMessage,
    #[doc = "! FSClient which owns this result."]
    pub client: *mut FSClient,
    #[doc = "! FSCmdBlock which owns this result."]
    pub block: *mut FSCmdBlock,
    #[doc = "! The result of the command."]
    pub status: FSStatus::Type,
}
#[test]
fn bindgen_test_layout_FSAsyncResult() {
    assert_eq!(
        ::core::mem::size_of::<FSAsyncResult>(),
        40usize,
        concat!("Size of: ", stringify!(FSAsyncResult))
    );
    assert_eq!(
        ::core::mem::align_of::<FSAsyncResult>(),
        4usize,
        concat!("Alignment of ", stringify!(FSAsyncResult))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSAsyncResult>())).asyncData as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAsyncResult),
            "::",
            stringify!(asyncData)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSAsyncResult>())).ioMsg as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAsyncResult),
            "::",
            stringify!(ioMsg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSAsyncResult>())).client as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAsyncResult),
            "::",
            stringify!(client)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSAsyncResult>())).block as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAsyncResult),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSAsyncResult>())).status as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(FSAsyncResult),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct FSDirectoryEntry {
    pub info: FSStat,
    pub name: [cty::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_FSDirectoryEntry() {
    assert_eq!(
        ::core::mem::size_of::<FSDirectoryEntry>(),
        356usize,
        concat!("Size of: ", stringify!(FSDirectoryEntry))
    );
    assert_eq!(
        ::core::mem::align_of::<FSDirectoryEntry>(),
        1usize,
        concat!("Alignment of ", stringify!(FSDirectoryEntry))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSDirectoryEntry>())).info as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FSDirectoryEntry),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSDirectoryEntry>())).name as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(FSDirectoryEntry),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct FSMountSource {
    pub __unk25: [cty::c_char; 768usize],
}
#[test]
fn bindgen_test_layout_FSMountSource() {
    assert_eq!(
        ::core::mem::size_of::<FSMountSource>(),
        768usize,
        concat!("Size of: ", stringify!(FSMountSource))
    );
    assert_eq!(
        ::core::mem::align_of::<FSMountSource>(),
        1usize,
        concat!("Alignment of ", stringify!(FSMountSource))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<FSMountSource>())).__unk25 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FSMountSource),
            "::",
            stringify!(__unk25)
        )
    );
}
extern "C" {
    pub fn FSInit();
}
extern "C" {
    pub fn FSShutdown();
}
extern "C" {
    pub fn FSAddClient(client: *mut FSClient, flags: u32) -> FSStatus::Type;
}
extern "C" {
    pub fn FSDelClient(client: *mut FSClient, flags: u32) -> FSStatus::Type;
}
extern "C" {
    pub fn FSGetClientNum() -> u32;
}
extern "C" {
    pub fn FSInitCmdBlock(block: *mut FSCmdBlock);
}
extern "C" {
    pub fn FSSetCmdPriority(block: *mut FSCmdBlock, priority: FSPriority) -> FSStatus::Type;
}
extern "C" {
    pub fn FSSetStateChangeNotification(client: *mut FSClient, info: *mut FSStateChangeInfo);
}
extern "C" {
    pub fn FSGetCwd(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        buffer: *mut cty::c_char,
        bufferSize: u32,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSChangeDir(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        path: *const cty::c_char,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSChangeDirAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        path: *const cty::c_char,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSGetAsyncResult(message: *mut FSMessage) -> *mut FSAsyncResult;
}
extern "C" {
    pub fn FSGetStat(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        path: *const cty::c_char,
        stat: *mut FSStat,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSGetStatAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        path: *const cty::c_char,
        stat: *mut FSStat,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSRemove(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        path: *const cty::c_char,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSRemoveAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        path: *const cty::c_char,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSOpenFile(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        path: *const cty::c_char,
        mode: *const cty::c_char,
        handle: *mut FSFileHandle,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSOpenFileAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        path: *const cty::c_char,
        mode: *const cty::c_char,
        outHandle: *mut FSFileHandle,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSCloseFile(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        handle: FSFileHandle,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSCloseFileAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        handle: FSFileHandle,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSOpenDir(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        path: *const cty::c_char,
        handle: *mut FSDirectoryHandle,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSOpenDirAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        path: *const cty::c_char,
        handle: *mut FSDirectoryHandle,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSMakeDir(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        path: *const cty::c_char,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSMakeDirAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        path: *const cty::c_char,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSReadDir(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        handle: FSDirectoryHandle,
        entry: *mut FSDirectoryEntry,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSReadDirAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        handle: FSDirectoryHandle,
        entry: *mut FSDirectoryEntry,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSRewindDir(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        handle: FSDirectoryHandle,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSCloseDir(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        handle: FSDirectoryHandle,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSCloseDirAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        handle: FSDirectoryHandle,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSChangeMode(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        path: *mut cty::c_char,
        mode: FSMode::Type,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSChangeModeAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        path: *mut cty::c_char,
        mode: FSMode::Type,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSGetFreeSpaceSize(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        path: *mut cty::c_char,
        outSize: *mut u64,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSGetFreeSpaceSizeAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        path: *mut cty::c_char,
        outSize: *mut u64,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSGetStatFile(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        handle: FSFileHandle,
        stat: *mut FSStat,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSGetStatFileAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        handle: FSFileHandle,
        stat: *mut FSStat,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSReadFile(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        buffer: *mut u8,
        size: u32,
        count: u32,
        handle: FSFileHandle,
        unk1: u32,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSReadFileAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        buffer: *mut u8,
        size: u32,
        count: u32,
        handle: FSFileHandle,
        unk1: u32,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSReadFileWithPos(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        buffer: *mut u8,
        size: u32,
        count: u32,
        pos: u32,
        handle: FSFileHandle,
        unk1: u32,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSReadFileWithPosAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        buffer: *mut u8,
        size: u32,
        count: u32,
        pos: u32,
        handle: FSFileHandle,
        unk1: u32,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSWriteFile(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        buffer: *mut u8,
        size: u32,
        count: u32,
        handle: FSFileHandle,
        unk1: u32,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSWriteFileAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        buffer: *mut u8,
        size: u32,
        count: u32,
        handle: FSFileHandle,
        unk1: u32,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSWriteFileWithPos(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        buffer: *mut u8,
        size: u32,
        count: u32,
        pos: u32,
        handle: FSFileHandle,
        unk1: u32,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSWriteFileWithPosAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        buffer: *mut u8,
        size: u32,
        count: u32,
        pos: u32,
        handle: FSFileHandle,
        unk1: u32,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSGetPosFile(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        fileHandle: FSFileHandle,
        pos: *mut u32,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSGetPosFileAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        fileHandle: FSFileHandle,
        pos: *mut u32,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSSetPosFile(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        handle: FSFileHandle,
        pos: u32,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSSetPosFileAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        handle: FSFileHandle,
        pos: u32,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSFlushFile(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        handle: FSFileHandle,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSFlushFileAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        handle: FSFileHandle,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSTruncateFile(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        handle: FSFileHandle,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSTruncateFileAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        handle: FSFileHandle,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSRename(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        oldPath: *const cty::c_char,
        newPath: *const cty::c_char,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSRenameAsync(
        client: *mut FSClient,
        block: *mut FSCmdBlock,
        oldPath: *const cty::c_char,
        newPath: *const cty::c_char,
        flags: u32,
        asyncData: *mut FSAsyncData,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSGetVolumeState(client: *mut FSClient) -> FSVolumeState::Type;
}
extern "C" {
    pub fn FSGetLastErrorCodeForViewer(client: *mut FSClient) -> FSError::Type;
}
extern "C" {
    pub fn FSGetMountSource(
        client: *mut FSClient,
        cmd: *mut FSCmdBlock,
        type_: FSMountSourceType::Type,
        out: *mut FSMountSource,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSMount(
        client: *mut FSClient,
        cmd: *mut FSCmdBlock,
        source: *mut FSMountSource,
        target: *const cty::c_char,
        bytes: u32,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSUnmount(
        client: *mut FSClient,
        cmd: *mut FSCmdBlock,
        target: *const cty::c_char,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSBindMount(
        client: *mut FSClient,
        cmd: *mut FSCmdBlock,
        source: *const cty::c_char,
        target: *const cty::c_char,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn FSbindUnmount(
        client: *mut FSClient,
        cmd: *mut FSCmdBlock,
        target: *const cty::c_char,
        flags: u32,
    ) -> FSStatus::Type;
}
extern "C" {
    pub fn OSEnableForegroundExit();
}
extern "C" {
    pub fn OSReleaseForeground();
}
extern "C" {
    pub fn OSSavesDone_ReadyToRelease();
}
extern "C" {
    pub fn __os_snprintf(
        buf: *mut cty::c_char,
        n: size_t,
        format: *const cty::c_char,
        ...
    ) -> cty::c_int;
}
pub type IOSHandle = i32;
pub mod IOSOpenMode {
    pub type Type = cty::c_uint;
    pub const IOS_OPEN_READ: Type = 1;
    pub const IOS_OPEN_WRITE: Type = 2;
    pub const IOS_OPEN_READWRITE: Type = 3;
}
pub mod IOSError {
    pub type Type = cty::c_int;
    pub const IOS_ERROR_OK: Type = 0;
    pub const IOS_ERROR_ACCESS: Type = -1;
    pub const IOS_ERROR_EXISTS: Type = -2;
    pub const IOS_ERROR_INTR: Type = -3;
    pub const IOS_ERROR_INVALID: Type = -4;
    pub const IOS_ERROR_MAX: Type = -5;
    pub const IOS_ERROR_NOEXISTS: Type = -6;
    pub const IOS_ERROR_QEMPTY: Type = -7;
    pub const IOS_ERROR_QFULL: Type = -8;
    pub const IOS_ERROR_UNKNOWN: Type = -9;
    pub const IOS_ERROR_NOTREADY: Type = -10;
    pub const IOS_ERROR_ECC: Type = -11;
    pub const IOS_ERROR_ECCCRIT: Type = -12;
    pub const IOS_ERROR_BADBLOCK: Type = -13;
    pub const IOS_ERROR_INVALIDOBJTYPE: Type = -14;
    pub const IOS_ERROR_INVALIDRNG: Type = -15;
    pub const IOS_ERROR_INVALIDFLAG: Type = -16;
    pub const IOS_ERROR_INVALIDFORMAT: Type = -17;
    pub const IOS_ERROR_INVALIDVERSION: Type = -18;
    pub const IOS_ERROR_INVALIDSIGNER: Type = -19;
    pub const IOS_ERROR_FAILCHECKVALUE: Type = -20;
    pub const IOS_ERROR_FAILINTERNAL: Type = -21;
    pub const IOS_ERROR_FAILALLOC: Type = -22;
    pub const IOS_ERROR_INVALIDSIZE: Type = -23;
    pub const IOS_ERROR_NOLINK: Type = -24;
    pub const IOS_ERROR_ANFAILED: Type = -25;
    pub const IOS_ERROR_MAXSEMCOUNT: Type = -26;
    pub const IOS_ERROR_SEMUNAVAILABLE: Type = -27;
    pub const IOS_ERROR_INVALIDHANDLE: Type = -28;
    pub const IOS_ERROR_INVALIDARG: Type = -29;
    pub const IOS_ERROR_NORESOURCE: Type = -30;
    pub const IOS_ERROR_BUSY: Type = -31;
    pub const IOS_ERROR_TIMEOUT: Type = -32;
    pub const IOS_ERROR_ALIGNMENT: Type = -33;
    pub const IOS_ERROR_BSP: Type = -34;
    pub const IOS_ERROR_DATAPENDING: Type = -35;
    pub const IOS_ERROR_EXPIRED: Type = -36;
    pub const IOS_ERROR_NOREADACCESS: Type = -37;
    pub const IOS_ERROR_NOWRITEACCESS: Type = -38;
    pub const IOS_ERROR_NOREADWRITEACCESS: Type = -39;
    pub const IOS_ERROR_CLIENTTXNLIMIT: Type = -40;
    pub const IOS_ERROR_STALEHANDLE: Type = -41;
    pub const IOS_ERROR_UNKNOWNVALUE: Type = -42;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IOSVec {
    #[doc = "! Virtual address of buffer."]
    pub vaddr: *mut cty::c_void,
    #[doc = "! Length of buffer."]
    pub len: u32,
    #[doc = "! Physical address of buffer."]
    pub paddr: *mut cty::c_void,
}
#[test]
fn bindgen_test_layout_IOSVec() {
    assert_eq!(
        ::core::mem::size_of::<IOSVec>(),
        12usize,
        concat!("Size of: ", stringify!(IOSVec))
    );
    assert_eq!(
        ::core::mem::align_of::<IOSVec>(),
        4usize,
        concat!("Alignment of ", stringify!(IOSVec))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IOSVec>())).vaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IOSVec),
            "::",
            stringify!(vaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IOSVec>())).len as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(IOSVec),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<IOSVec>())).paddr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IOSVec),
            "::",
            stringify!(paddr)
        )
    );
}
pub type IOSAsyncCallbackFn =
    ::core::option::Option<unsafe extern "C" fn(arg1: IOSError::Type, arg2: *mut cty::c_void)>;
extern "C" {
    pub fn IOS_Open(device: *const cty::c_char, mode: IOSOpenMode::Type) -> IOSError::Type;
}
extern "C" {
    pub fn IOS_OpenAsync(
        device: *const cty::c_char,
        mode: IOSOpenMode::Type,
        callback: IOSAsyncCallbackFn,
        context: *mut cty::c_void,
    ) -> IOSError::Type;
}
extern "C" {
    pub fn IOS_Close(handle: IOSHandle) -> IOSError::Type;
}
extern "C" {
    pub fn IOS_CloseAsync(
        handle: IOSHandle,
        callback: IOSAsyncCallbackFn,
        context: *mut cty::c_void,
    ) -> IOSError::Type;
}
extern "C" {
    pub fn IOS_Ioctl(
        handle: IOSHandle,
        request: u32,
        inBuf: *mut cty::c_void,
        inLen: u32,
        outBuf: *mut cty::c_void,
        outLen: u32,
    ) -> IOSError::Type;
}
extern "C" {
    pub fn IOS_IoctlAsync(
        handle: IOSHandle,
        request: u32,
        inBuf: *mut cty::c_void,
        inLen: u32,
        outBuf: *mut cty::c_void,
        outLen: u32,
        callback: IOSAsyncCallbackFn,
        context: *mut cty::c_void,
    ) -> IOSError::Type;
}
extern "C" {
    pub fn IOS_Ioctlv(
        handle: IOSHandle,
        request: u32,
        vecIn: u32,
        vecOut: u32,
        vec: *mut IOSVec,
    ) -> IOSError::Type;
}
extern "C" {
    pub fn IOS_IoctlvAsync(
        handle: IOSHandle,
        request: u32,
        vecIn: u32,
        vecOut: u32,
        vec: *mut IOSVec,
        callback: IOSAsyncCallbackFn,
        context: *mut cty::c_void,
    ) -> IOSError::Type;
}
pub type MCPError = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MCPDeviceList {
    _unused: [u8; 0],
}
pub mod MCPAppType {
    pub type Type = cty::c_uint;
    pub const MCP_APP_TYPE_GAME_UPDATE: Type = 134217755;
    pub const MCP_APP_TYPE_GAME_DLC: Type = 134217742;
    pub const MCP_APP_TYPE_BOOT1: Type = 268435465;
    pub const MCP_APP_TYPE_SYSTEM_LIBRARIES: Type = 268435466;
    pub const MCP_APP_TYPE_BLUETOOTH_FIRMWARE: Type = 268435474;
    pub const MCP_APP_TYPE_DRH_FIRMWARE: Type = 268435475;
    pub const MCP_APP_TYPE_DRC_FIRMWARE: Type = 268435476;
    pub const MCP_APP_TYPE_SYSTEM_VERSION: Type = 268435477;
    pub const MCP_APP_TYPE_DRC_LANGUAGE: Type = 268435482;
    pub const MCP_APP_TYPE_EXCEPTIONS_DATA: Type = 402653200;
    pub const MCP_APP_TYPE_SHARED_DATA: Type = 402653212;
    pub const MCP_APP_TYPE_CERT_STORE: Type = 402653214;
    pub const MCP_APP_TYPE_PATCH_MAP_DATA: Type = 402653219;
    pub const MCP_APP_TYPE_WAGONU_MIGRATION_LIST: Type = 402653225;
    pub const MCP_APP_TYPE_CAFFEINE_TITLE_LIST: Type = 402653232;
    pub const MCP_APP_TYPE_MCP_TITLE_LIST: Type = 402653233;
    pub const MCP_APP_TYPE_GAME: Type = 2147483648;
    pub const MCP_APP_TYPE_GAME_WII: Type = 2147483694;
    pub const MCP_APP_TYPE_SYSTEM_MENU: Type = 2415919105;
    pub const MCP_APP_TYPE_SYSTEM_UPDATER: Type = 2415919115;
    pub const MCP_APP_TYPE_SYSTEM_APPS: Type = 2415919136;
    pub const MCP_APP_TYPE_ACCOUNT_APPS: Type = 2415919137;
    pub const MCP_APP_TYPE_SYSTEM_SETTINGS: Type = 2415919138;
    pub const MCP_APP_TYPE_ECO_PROCESS: Type = 2415919151;
    pub const MCP_APP_TYPE_EMANUAL: Type = 3489660931;
    pub const MCP_APP_TYPE_HOME_MENU: Type = 3489660932;
    pub const MCP_APP_TYPE_ERROR_DISPLAY: Type = 3489660933;
    pub const MCP_APP_TYPE_BROWSER: Type = 3489660934;
    pub const MCP_APP_TYPE_MIIVERSE_POST: Type = 3489660941;
    pub const MCP_APP_TYPE_MIIVERSE: Type = 3489660950;
    pub const MCP_APP_TYPE_ESHOP: Type = 3489660951;
    pub const MCP_APP_TYPE_FRIEND_LIST: Type = 3489660952;
    pub const MCP_APP_TYPE_DOWNLOAD_MANAGEMENT: Type = 3489660953;
    pub const MCP_APP_TYPE_AOC_OVERLAY: Type = 3489660972;
    pub const MCP_APP_TYPE_AMIIBO_SETTINGS: Type = 3489660979;
}
pub mod MCPDeviceFlags {
    pub type Type = cty::c_uint;
    pub const MCP_DEVICE_FLAG_UNK_1: Type = 1;
    pub const MCP_DEVICE_FLAG_UNK_2: Type = 2;
    pub const MCP_DEVICE_FLAG_UNK_4: Type = 4;
    pub const MCP_DEVICE_FLAG_UNK_8: Type = 8;
}
pub mod MCPInstallTarget {
    pub type Type = cty::c_uint;
    pub const MCP_INSTALL_TARGET_MLC: Type = 0;
    pub const MCP_INSTALL_TARGET_USB: Type = 1;
}
pub mod MCPRegion {
    pub type Type = cty::c_uint;
    pub const MCP_REGION_JAPAN: Type = 1;
    pub const MCP_REGION_USA: Type = 2;
    pub const MCP_REGION_EUROPE: Type = 4;
    pub const MCP_REGION_CHINA: Type = 16;
    pub const MCP_REGION_KOREA: Type = 32;
    pub const MCP_REGION_TAIWAN: Type = 64;
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct MCPDevice {
    pub type_: [cty::c_char; 8usize],
    pub unk0x08: [cty::c_char; 128usize],
    pub filesystem: [cty::c_char; 8usize],
    pub path: [cty::c_char; 639usize],
    pub flags: MCPDeviceFlags::Type,
    pub uid: u32,
    pub index: u32,
}
#[test]
fn bindgen_test_layout_MCPDevice() {
    assert_eq!(
        ::core::mem::size_of::<MCPDevice>(),
        795usize,
        concat!("Size of: ", stringify!(MCPDevice))
    );
    assert_eq!(
        ::core::mem::align_of::<MCPDevice>(),
        1usize,
        concat!("Alignment of ", stringify!(MCPDevice))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPDevice>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPDevice),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPDevice>())).unk0x08 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPDevice),
            "::",
            stringify!(unk0x08)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPDevice>())).filesystem as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPDevice),
            "::",
            stringify!(filesystem)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPDevice>())).path as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPDevice),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPDevice>())).flags as *const _ as usize },
        783usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPDevice),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPDevice>())).uid as *const _ as usize },
        787usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPDevice),
            "::",
            stringify!(uid)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPDevice>())).index as *const _ as usize },
        791usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPDevice),
            "::",
            stringify!(index)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct MCPInstallInfo {
    pub __unk26: [cty::c_char; 639usize],
}
#[test]
fn bindgen_test_layout_MCPInstallInfo() {
    assert_eq!(
        ::core::mem::size_of::<MCPInstallInfo>(),
        639usize,
        concat!("Size of: ", stringify!(MCPInstallInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<MCPInstallInfo>(),
        1usize,
        concat!("Alignment of ", stringify!(MCPInstallInfo))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPInstallInfo>())).__unk26 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPInstallInfo),
            "::",
            stringify!(__unk26)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct MCPInstallProgress {
    pub inProgress: u32,
    pub tid: u64,
    pub sizeTotal: u64,
    pub sizeProgress: u64,
    pub contentsTotal: u32,
    pub contentsProgress: u32,
}
#[test]
fn bindgen_test_layout_MCPInstallProgress() {
    assert_eq!(
        ::core::mem::size_of::<MCPInstallProgress>(),
        36usize,
        concat!("Size of: ", stringify!(MCPInstallProgress))
    );
    assert_eq!(
        ::core::mem::align_of::<MCPInstallProgress>(),
        1usize,
        concat!("Alignment of ", stringify!(MCPInstallProgress))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPInstallProgress>())).inProgress as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPInstallProgress),
            "::",
            stringify!(inProgress)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPInstallProgress>())).tid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPInstallProgress),
            "::",
            stringify!(tid)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPInstallProgress>())).sizeTotal as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPInstallProgress),
            "::",
            stringify!(sizeTotal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<MCPInstallProgress>())).sizeProgress as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPInstallProgress),
            "::",
            stringify!(sizeProgress)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<MCPInstallProgress>())).contentsTotal as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPInstallProgress),
            "::",
            stringify!(contentsTotal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<MCPInstallProgress>())).contentsProgress as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPInstallProgress),
            "::",
            stringify!(contentsProgress)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct MCPInstallTitleInfo {
    pub __unk27: [cty::c_char; 639usize],
}
#[test]
fn bindgen_test_layout_MCPInstallTitleInfo() {
    assert_eq!(
        ::core::mem::size_of::<MCPInstallTitleInfo>(),
        639usize,
        concat!("Size of: ", stringify!(MCPInstallTitleInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<MCPInstallTitleInfo>(),
        1usize,
        concat!("Alignment of ", stringify!(MCPInstallTitleInfo))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPInstallTitleInfo>())).__unk27 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPInstallTitleInfo),
            "::",
            stringify!(__unk27)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct MCPSysProdSettings {
    pub product_area: MCPRegion::Type,
    pub eeprom_version: u16,
    pub __unk28: [cty::c_char; 2usize],
    pub game_region: MCPRegion::Type,
    pub __unk29: [cty::c_char; 4usize],
    pub ntsc_pal: [cty::c_char; 5usize],
    #[doc = "! 5ghz_country_code in xml"]
    pub wifi_5ghz_country_code: [cty::c_char; 4usize],
    #[doc = "! 5ghz_country_code_revision in xml"]
    pub wifi_5ghz_country_code_revision: u8,
    pub code_id: [cty::c_char; 8usize],
    pub serial_id: [cty::c_char; 12usize],
    pub __unk30: [cty::c_char; 4usize],
    pub model_number: [cty::c_char; 16usize],
    pub version: u32,
}
#[test]
fn bindgen_test_layout_MCPSysProdSettings() {
    assert_eq!(
        ::core::mem::size_of::<MCPSysProdSettings>(),
        70usize,
        concat!("Size of: ", stringify!(MCPSysProdSettings))
    );
    assert_eq!(
        ::core::mem::align_of::<MCPSysProdSettings>(),
        1usize,
        concat!("Alignment of ", stringify!(MCPSysProdSettings))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<MCPSysProdSettings>())).product_area as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPSysProdSettings),
            "::",
            stringify!(product_area)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<MCPSysProdSettings>())).eeprom_version as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPSysProdSettings),
            "::",
            stringify!(eeprom_version)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPSysProdSettings>())).__unk28 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPSysProdSettings),
            "::",
            stringify!(__unk28)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPSysProdSettings>())).game_region as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPSysProdSettings),
            "::",
            stringify!(game_region)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPSysProdSettings>())).__unk29 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPSysProdSettings),
            "::",
            stringify!(__unk29)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPSysProdSettings>())).ntsc_pal as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPSysProdSettings),
            "::",
            stringify!(ntsc_pal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<MCPSysProdSettings>())).wifi_5ghz_country_code as *const _
                as usize
        },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPSysProdSettings),
            "::",
            stringify!(wifi_5ghz_country_code)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<MCPSysProdSettings>())).wifi_5ghz_country_code_revision
                as *const _ as usize
        },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPSysProdSettings),
            "::",
            stringify!(wifi_5ghz_country_code_revision)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPSysProdSettings>())).code_id as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPSysProdSettings),
            "::",
            stringify!(code_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPSysProdSettings>())).serial_id as *const _ as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPSysProdSettings),
            "::",
            stringify!(serial_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPSysProdSettings>())).__unk30 as *const _ as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPSysProdSettings),
            "::",
            stringify!(__unk30)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<MCPSysProdSettings>())).model_number as *const _ as usize
        },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPSysProdSettings),
            "::",
            stringify!(model_number)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPSysProdSettings>())).version as *const _ as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPSysProdSettings),
            "::",
            stringify!(version)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct MCPTitleListType {
    pub titleId: u64,
    pub groupId: u32,
    pub path: [cty::c_char; 56usize],
    pub appType: MCPAppType::Type,
    pub titleVersion: u16,
    pub osVersion: u64,
    pub sdkVersion: u32,
    pub indexedDevice: [cty::c_char; 10usize],
    pub unk0x60: u8,
}
#[test]
fn bindgen_test_layout_MCPTitleListType() {
    assert_eq!(
        ::core::mem::size_of::<MCPTitleListType>(),
        97usize,
        concat!("Size of: ", stringify!(MCPTitleListType))
    );
    assert_eq!(
        ::core::mem::align_of::<MCPTitleListType>(),
        1usize,
        concat!("Alignment of ", stringify!(MCPTitleListType))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPTitleListType>())).titleId as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPTitleListType),
            "::",
            stringify!(titleId)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPTitleListType>())).groupId as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPTitleListType),
            "::",
            stringify!(groupId)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPTitleListType>())).path as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPTitleListType),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPTitleListType>())).appType as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPTitleListType),
            "::",
            stringify!(appType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPTitleListType>())).titleVersion as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPTitleListType),
            "::",
            stringify!(titleVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPTitleListType>())).osVersion as *const _ as usize },
        74usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPTitleListType),
            "::",
            stringify!(osVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPTitleListType>())).sdkVersion as *const _ as usize },
        82usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPTitleListType),
            "::",
            stringify!(sdkVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPTitleListType>())).indexedDevice as *const _ as usize },
        86usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPTitleListType),
            "::",
            stringify!(indexedDevice)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MCPTitleListType>())).unk0x60 as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(MCPTitleListType),
            "::",
            stringify!(unk0x60)
        )
    );
}
extern "C" {
    pub fn MCP_Open() -> MCPError;
}
extern "C" {
    pub fn MCP_Close(handle: cty::c_int) -> MCPError;
}
extern "C" {
    pub fn MCP_DeviceList(
        handle: cty::c_int,
        numDevices: *mut cty::c_int,
        outDeviceList: *mut MCPDevice,
        deviceListSizeInBytes: u32,
    ) -> MCPError;
}
extern "C" {
    pub fn MCP_FullDeviceList(
        handle: cty::c_int,
        numDevices: *mut cty::c_int,
        outDeviceList: *mut MCPDevice,
        deviceListSizeInBytes: u32,
    ) -> MCPError;
}
extern "C" {
    pub fn MCP_GetOwnTitleInfo(handle: i32, titleInfo: *mut MCPTitleListType) -> MCPError;
}
extern "C" {
    pub fn MCP_GetSysProdSettings(handle: i32, settings: *mut MCPSysProdSettings) -> MCPError;
}
extern "C" {
    pub fn MCP_GetTitleId(handle: i32, outTitleId: *mut u64) -> MCPError;
}
extern "C" {
    pub fn MCP_GetTitleInfo(
        handle: i32,
        titleId: u64,
        titleInfo: *mut MCPTitleListType,
    ) -> MCPError;
}
extern "C" {
    pub fn MCP_InstallSetTargetDevice(
        handle: cty::c_int,
        device: MCPInstallTarget::Type,
    ) -> MCPError;
}
extern "C" {
    pub fn MCP_InstallGetTargetDevice(
        handle: cty::c_int,
        deviceOut: *mut MCPInstallTarget::Type,
    ) -> MCPError;
}
extern "C" {
    pub fn MCP_InstallSetTargetUsb(handle: cty::c_int, usb: cty::c_int) -> MCPError;
}
extern "C" {
    pub fn MCP_InstallGetInfo(
        handle: cty::c_int,
        path: *mut cty::c_char,
        out: *mut MCPInstallInfo,
    ) -> MCPError;
}
extern "C" {
    pub fn MCP_InstallTitleAsync(
        handle: cty::c_int,
        path: *mut cty::c_char,
        out: *mut MCPInstallTitleInfo,
    ) -> MCPError;
}
extern "C" {
    pub fn MCP_InstallGetProgress(
        handle: cty::c_int,
        installProgressOut: *mut MCPInstallProgress,
    ) -> MCPError;
}
extern "C" {
    pub fn MCP_InstallTitleAbort(handle: cty::c_int) -> MCPError;
}
extern "C" {
    pub fn MCP_TitleCount(handle: i32) -> MCPError;
}
extern "C" {
    pub fn MCP_TitleList(
        handle: i32,
        outTitleCount: *mut u32,
        titleList: *mut MCPTitleListType,
        titleListSizeBytes: u32,
    ) -> MCPError;
}
extern "C" {
    pub fn MCP_TitleListByAppType(
        handle: i32,
        appType: MCPAppType::Type,
        outTitleCount: *mut u32,
        titleList: *mut MCPTitleListType,
        titleListSizeBytes: u32,
    ) -> MCPError;
}
extern "C" {
    pub fn MCP_TitleListByUniqueId(
        handle: i32,
        uniqueId: u32,
        outTitleCount: *mut u32,
        titleList: *mut MCPTitleListType,
        titleListSizeBytes: u32,
    ) -> MCPError;
}
extern "C" {
    pub fn MCP_TitleListByUniqueIdAndIndexedDeviceAndAppType(
        handle: i32,
        uniqueId: u32,
        indexedDevice: *const cty::c_char,
        unk0x60: u8,
        appType: MCPAppType::Type,
        outTitleCount: *mut u32,
        titleList: *mut MCPTitleListType,
        titleListSizeBytes: u32,
    ) -> MCPError;
}
extern "C" {
    pub fn MCP_UninstallTitleAsync(
        handle: cty::c_int,
        path: *mut cty::c_char,
        out: *mut MCPInstallTitleInfo,
    ) -> MCPError;
}
extern "C" {
    pub fn OSInitSpinLock(spinlock: *mut OSSpinLock);
}
extern "C" {
    pub fn OSAcquireSpinLock(spinlock: *mut OSSpinLock) -> BOOL;
}
extern "C" {
    pub fn OSTryAcquireSpinLock(spinlock: *mut OSSpinLock) -> BOOL;
}
extern "C" {
    pub fn OSTryAcquireSpinLockWithTimeout(spinlock: *mut OSSpinLock, timeout: OSTime) -> BOOL;
}
extern "C" {
    pub fn OSReleaseSpinLock(spinlock: *mut OSSpinLock) -> BOOL;
}
extern "C" {
    pub fn OSUninterruptibleSpinLock_Acquire(spinlock: *mut OSSpinLock) -> BOOL;
}
extern "C" {
    pub fn OSUninterruptibleSpinLock_TryAcquire(spinlock: *mut OSSpinLock) -> BOOL;
}
extern "C" {
    pub fn OSUninterruptibleSpinLock_TryAcquireWithTimeout(
        spinlock: *mut OSSpinLock,
        timeout: OSTime,
    ) -> BOOL;
}
extern "C" {
    pub fn OSUninterruptibleSpinLock_Release(spinlock: *mut OSSpinLock) -> BOOL;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MEMMemoryLink {
    pub prev: *mut cty::c_void,
    pub next: *mut cty::c_void,
}
#[test]
fn bindgen_test_layout_MEMMemoryLink() {
    assert_eq!(
        ::core::mem::size_of::<MEMMemoryLink>(),
        8usize,
        concat!("Size of: ", stringify!(MEMMemoryLink))
    );
    assert_eq!(
        ::core::mem::align_of::<MEMMemoryLink>(),
        4usize,
        concat!("Alignment of ", stringify!(MEMMemoryLink))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMMemoryLink>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMMemoryLink),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMMemoryLink>())).next as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMMemoryLink),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MEMMemoryList {
    pub head: *mut cty::c_void,
    pub tail: *mut cty::c_void,
    pub count: u16,
    pub offsetToMemoryLink: u16,
}
#[test]
fn bindgen_test_layout_MEMMemoryList() {
    assert_eq!(
        ::core::mem::size_of::<MEMMemoryList>(),
        12usize,
        concat!("Size of: ", stringify!(MEMMemoryList))
    );
    assert_eq!(
        ::core::mem::align_of::<MEMMemoryList>(),
        4usize,
        concat!("Alignment of ", stringify!(MEMMemoryList))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMMemoryList>())).head as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMMemoryList),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMMemoryList>())).tail as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMMemoryList),
            "::",
            stringify!(tail)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMMemoryList>())).count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMMemoryList),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<MEMMemoryList>())).offsetToMemoryLink as *const _ as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMMemoryList),
            "::",
            stringify!(offsetToMemoryLink)
        )
    );
}
extern "C" {
    pub fn MEMInitList(list: *mut MEMMemoryList, offsetToMemoryLink: u16);
}
extern "C" {
    pub fn MEMAppendListObject(list: *mut MEMMemoryList, object: *mut cty::c_void);
}
extern "C" {
    pub fn MEMPrependListObject(list: *mut MEMMemoryList, object: *mut cty::c_void);
}
extern "C" {
    pub fn MEMInsertListObject(
        list: *mut MEMMemoryList,
        before: *mut cty::c_void,
        object: *mut cty::c_void,
    );
}
extern "C" {
    pub fn MEMRemoveListObject(list: *mut MEMMemoryList, object: *mut cty::c_void);
}
extern "C" {
    pub fn MEMGetNextListObject(
        list: *mut MEMMemoryList,
        object: *mut cty::c_void,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn MEMGetPrevListObject(
        list: *mut MEMMemoryList,
        object: *mut cty::c_void,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn MEMGetNthListObject(list: *mut MEMMemoryList, n: u16) -> *mut cty::c_void;
}
pub type MEMHeapHandle = *mut MEMHeapHeader;
pub mod MEMBaseHeapType {
    pub type Type = cty::c_uint;
    pub const MEM_BASE_HEAP_MEM1: Type = 0;
    pub const MEM_BASE_HEAP_MEM2: Type = 1;
    pub const MEM_BASE_HEAP_FG: Type = 8;
}
pub mod MEMHeapFillType {
    pub type Type = cty::c_uint;
    pub const MEM_HEAP_FILL_TYPE_UNUSED: Type = 0;
    pub const MEM_HEAP_FILL_TYPE_ALLOCATED: Type = 1;
    pub const MEM_HEAP_FILL_TYPE_FREED: Type = 2;
}
pub mod MEMHeapTag {
    pub type Type = cty::c_uint;
    pub const MEM_BLOCK_HEAP_TAG: Type = 1112296264;
    pub const MEM_EXPANDED_HEAP_TAG: Type = 1163415624;
    pub const MEM_FRAME_HEAP_TAG: Type = 1179798856;
    pub const MEM_UNIT_HEAP_TAG: Type = 1431196744;
    pub const MEM_USER_HEAP_TAG: Type = 1431523912;
}
pub mod MEMHeapFlags {
    pub type Type = cty::c_uint;
    pub const MEM_HEAP_FLAG_ZERO_ALLOCATED: Type = 1;
    pub const MEM_HEAP_FLAG_DEBUG_MODE: Type = 2;
    pub const MEM_HEAP_FLAG_USE_LOCK: Type = 4;
}
#[repr(C, packed)]
pub struct MEMHeapHeader {
    #[doc = "! Tag indicating which type of heap this is"]
    pub tag: MEMHeapTag::Type,
    #[doc = "! Link for list this heap is in"]
    pub link: MEMMemoryLink,
    #[doc = "! List of all child heaps in this heap"]
    pub list: MEMMemoryList,
    #[doc = "! Pointer to start of allocatable memory"]
    pub dataStart: *mut cty::c_void,
    #[doc = "! Pointer to end of allocatable memory"]
    pub dataEnd: *mut cty::c_void,
    #[doc = "! Lock used when MEM_HEAP_FLAG_USE_LOCK is set."]
    pub lock: OSSpinLock,
    #[doc = "! Flags set during heap creation."]
    pub flags: u32,
    pub __unk33: [cty::c_char; 12usize],
}
#[test]
fn bindgen_test_layout_MEMHeapHeader() {
    assert_eq!(
        ::core::mem::size_of::<MEMHeapHeader>(),
        64usize,
        concat!("Size of: ", stringify!(MEMHeapHeader))
    );
    assert_eq!(
        ::core::mem::align_of::<MEMHeapHeader>(),
        1usize,
        concat!("Alignment of ", stringify!(MEMHeapHeader))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMHeapHeader>())).tag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMHeapHeader),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMHeapHeader>())).link as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMHeapHeader),
            "::",
            stringify!(link)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMHeapHeader>())).list as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMHeapHeader),
            "::",
            stringify!(list)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMHeapHeader>())).dataStart as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMHeapHeader),
            "::",
            stringify!(dataStart)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMHeapHeader>())).dataEnd as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMHeapHeader),
            "::",
            stringify!(dataEnd)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMHeapHeader>())).lock as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMHeapHeader),
            "::",
            stringify!(lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMHeapHeader>())).flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMHeapHeader),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMHeapHeader>())).__unk33 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMHeapHeader),
            "::",
            stringify!(__unk33)
        )
    );
}
extern "C" {
    #[doc = " Get which memory area a heap belongs to."]
    pub fn MEMGetArena(handle: MEMHeapHandle) -> MEMBaseHeapType::Type;
}
extern "C" {
    #[doc = " Get base heap for memory area."]
    pub fn MEMGetBaseHeapHandle(type_: MEMBaseHeapType::Type) -> MEMHeapHandle;
}
extern "C" {
    #[doc = " Set base heap for memory area."]
    pub fn MEMSetBaseHeapHandle(
        type_: MEMBaseHeapType::Type,
        handle: MEMHeapHandle,
    ) -> MEMHeapHandle;
}
extern "C" {
    #[doc = " Create a heap handle for a user defined heap."]
    pub fn MEMCreateUserHeapHandle(heap: *mut cty::c_void, size: u32) -> MEMHeapHandle;
}
extern "C" {
    #[doc = " Print details about heap to COSWarn"]
    pub fn MEMDumpHeap(heap: MEMHeapHandle);
}
extern "C" {
    #[doc = " Find heap which contains a memory block."]
    pub fn MEMFindContainHeap(block: *mut cty::c_void) -> *mut MEMHeapHeader;
}
extern "C" {
    #[doc = " Find the parent heap of a given heap. Return NULL if no parent was found."]
    pub fn MEMFindParentHeap(handle: MEMHeapHandle) -> MEMHeapHandle;
}
extern "C" {
    #[doc = " Get the data fill value used when MEM_HEAP_FLAG_DEBUG_MODE is set."]
    pub fn MEMGetFillValForHeap(type_: MEMHeapFillType::Type) -> u32;
}
extern "C" {
    #[doc = " Set the data fill value used when MEM_HEAP_FLAG_DEBUG_MODE is set."]
    pub fn MEMSetFillValForHeap(type_: MEMHeapFillType::Type, value: u32);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MEMBlockHeapTracking {
    pub __unk34: [cty::c_char; 8usize],
    #[doc = "! Pointer to first memory block"]
    pub blocks: *mut MEMBlockHeapBlock,
    #[doc = "! Number of blocks in this tracking heap"]
    pub blockCount: u32,
}
#[test]
fn bindgen_test_layout_MEMBlockHeapTracking() {
    assert_eq!(
        ::core::mem::size_of::<MEMBlockHeapTracking>(),
        16usize,
        concat!("Size of: ", stringify!(MEMBlockHeapTracking))
    );
    assert_eq!(
        ::core::mem::align_of::<MEMBlockHeapTracking>(),
        4usize,
        concat!("Alignment of ", stringify!(MEMBlockHeapTracking))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMBlockHeapTracking>())).__unk34 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMBlockHeapTracking),
            "::",
            stringify!(__unk34)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMBlockHeapTracking>())).blocks as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMBlockHeapTracking),
            "::",
            stringify!(blocks)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<MEMBlockHeapTracking>())).blockCount as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMBlockHeapTracking),
            "::",
            stringify!(blockCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MEMBlockHeapBlock {
    #[doc = "! First address of the data region this block has allocated"]
    pub start: *mut cty::c_void,
    #[doc = "! End address of the data region this block has allocated"]
    pub end: *mut cty::c_void,
    #[doc = "! TRUE if the block is free, FALSE if allocated"]
    pub isFree: BOOL,
    #[doc = "! Link to previous block, note that this is only set for allocated blocks"]
    pub prev: *mut MEMBlockHeapBlock,
    #[doc = "! Link to next block, always set"]
    pub next: *mut MEMBlockHeapBlock,
}
#[test]
fn bindgen_test_layout_MEMBlockHeapBlock() {
    assert_eq!(
        ::core::mem::size_of::<MEMBlockHeapBlock>(),
        20usize,
        concat!("Size of: ", stringify!(MEMBlockHeapBlock))
    );
    assert_eq!(
        ::core::mem::align_of::<MEMBlockHeapBlock>(),
        4usize,
        concat!("Alignment of ", stringify!(MEMBlockHeapBlock))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMBlockHeapBlock>())).start as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMBlockHeapBlock),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMBlockHeapBlock>())).end as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMBlockHeapBlock),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMBlockHeapBlock>())).isFree as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMBlockHeapBlock),
            "::",
            stringify!(isFree)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMBlockHeapBlock>())).prev as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMBlockHeapBlock),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMBlockHeapBlock>())).next as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMBlockHeapBlock),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C, packed)]
pub struct MEMBlockHeap {
    pub header: MEMHeapHeader,
    #[doc = "! Default tracking heap, tracks only defaultBlock"]
    pub defaultTrack: MEMBlockHeapTracking,
    #[doc = "! Default block, used so we don't have an empty block list"]
    pub defaultBlock: MEMBlockHeapBlock,
    #[doc = "! First block in this heap"]
    pub firstBlock: *mut MEMBlockHeapBlock,
    #[doc = "! Last block in this heap"]
    pub lastBlock: *mut MEMBlockHeapBlock,
    #[doc = "! First free block"]
    pub firstFreeBlock: *mut MEMBlockHeapBlock,
    #[doc = "! Free block count"]
    pub numFreeBlocks: u32,
}
#[test]
fn bindgen_test_layout_MEMBlockHeap() {
    assert_eq!(
        ::core::mem::size_of::<MEMBlockHeap>(),
        116usize,
        concat!("Size of: ", stringify!(MEMBlockHeap))
    );
    assert_eq!(
        ::core::mem::align_of::<MEMBlockHeap>(),
        1usize,
        concat!("Alignment of ", stringify!(MEMBlockHeap))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMBlockHeap>())).header as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMBlockHeap),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMBlockHeap>())).defaultTrack as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMBlockHeap),
            "::",
            stringify!(defaultTrack)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMBlockHeap>())).defaultBlock as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMBlockHeap),
            "::",
            stringify!(defaultBlock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMBlockHeap>())).firstBlock as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMBlockHeap),
            "::",
            stringify!(firstBlock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMBlockHeap>())).lastBlock as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMBlockHeap),
            "::",
            stringify!(lastBlock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMBlockHeap>())).firstFreeBlock as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMBlockHeap),
            "::",
            stringify!(firstFreeBlock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMBlockHeap>())).numFreeBlocks as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMBlockHeap),
            "::",
            stringify!(numFreeBlocks)
        )
    );
}
extern "C" {
    pub fn MEMInitBlockHeap(
        heap: *mut MEMBlockHeap,
        start: *mut cty::c_void,
        end: *mut cty::c_void,
        blocks: *mut MEMBlockHeapTracking,
        size: u32,
        flags: u32,
    ) -> MEMHeapHandle;
}
extern "C" {
    pub fn MEMDestroyBlockHeap(heap: MEMHeapHandle) -> *mut cty::c_void;
}
extern "C" {
    pub fn MEMAddBlockHeapTracking(
        heap: MEMHeapHandle,
        tracking: *mut MEMBlockHeapTracking,
        size: u32,
    ) -> cty::c_int;
}
extern "C" {
    pub fn MEMAllocFromBlockHeapAt(
        heap: MEMHeapHandle,
        addr: *mut cty::c_void,
        size: u32,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn MEMAllocFromBlockHeapEx(heap: MEMHeapHandle, size: u32, align: i32) -> *mut cty::c_void;
}
extern "C" {
    pub fn MEMFreeToBlockHeap(heap: MEMHeapHandle, data: *mut cty::c_void);
}
extern "C" {
    pub fn MEMGetAllocatableSizeForBlockHeapEx(heap: MEMHeapHandle, align: i32) -> u32;
}
extern "C" {
    pub fn MEMGetTrackingLeftInBlockHeap(heap: MEMHeapHandle) -> u32;
}
extern "C" {
    pub fn MEMGetTotalFreeSizeForBlockHeap(heap: MEMHeapHandle) -> u32;
}
pub type MEMAllocFromDefaultHeapFn =
    ::core::option::Option<unsafe extern "C" fn(size: u32) -> *mut cty::c_void>;
pub type MEMAllocFromDefaultHeapExFn =
    ::core::option::Option<unsafe extern "C" fn(size: u32, alignment: i32) -> *mut cty::c_void>;
pub type MEMFreeToDefaultHeapFn =
    ::core::option::Option<unsafe extern "C" fn(ptr: *mut cty::c_void)>;
extern "C" {
    pub static mut MEMAllocFromDefaultHeap: MEMAllocFromDefaultHeapFn;
}
extern "C" {
    pub static mut MEMAllocFromDefaultHeapEx: MEMAllocFromDefaultHeapExFn;
}
extern "C" {
    pub static mut MEMFreeToDefaultHeap: MEMFreeToDefaultHeapFn;
}
extern "C" {
    #[doc = " Default implementation of __preinit_user."]
    pub fn CoreInitDefaultHeap(
        outMem1: *mut MEMHeapHandle,
        outFG: *mut MEMHeapHandle,
        outMem2: *mut MEMHeapHandle,
    );
}
extern "C" {
    #[doc = " Allows the user to completely customise the default heaps, this runs after"]
    #[doc = " the rpx code section has loaded but before the data section as the data"]
    #[doc = " sections are allocated from the default heap."]
    #[doc = ""]
    #[doc = " This is for a user to export from their .rpx file, it is not exported from"]
    #[doc = " coreinit.rpl"]
    pub fn __preinit_user(
        outMem1: *mut MEMHeapHandle,
        outFG: *mut MEMHeapHandle,
        outMem2: *mut MEMHeapHandle,
    );
}
pub type MEMExpHeapBlockVisitor = ::core::option::Option<
    unsafe extern "C" fn(block: *mut cty::c_void, heap: MEMHeapHandle, context: *mut cty::c_void),
>;
pub mod MEMExpHeapMode {
    pub type Type = cty::c_uint;
    pub const MEM_EXP_HEAP_MODE_FIRST_FREE: Type = 0;
    pub const MEM_EXP_HEAP_MODE_NEAREST_SIZE: Type = 1;
}
pub mod MEMExpHeapDirection {
    pub type Type = cty::c_uint;
    pub const MEM_EXP_HEAP_DIR_FROM_TOP: Type = 0;
    pub const MEM_EXP_HEAP_DIR_FROM_BOTTOM: Type = 1;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MEMExpHeapBlock {
    pub attribs: u32,
    pub blockSize: u32,
    pub prev: *mut MEMExpHeapBlock,
    pub next: *mut MEMExpHeapBlock,
    pub tag: u16,
    pub __unk35: [cty::c_char; 2usize],
}
#[test]
fn bindgen_test_layout_MEMExpHeapBlock() {
    assert_eq!(
        ::core::mem::size_of::<MEMExpHeapBlock>(),
        20usize,
        concat!("Size of: ", stringify!(MEMExpHeapBlock))
    );
    assert_eq!(
        ::core::mem::align_of::<MEMExpHeapBlock>(),
        4usize,
        concat!("Alignment of ", stringify!(MEMExpHeapBlock))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMExpHeapBlock>())).attribs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMExpHeapBlock),
            "::",
            stringify!(attribs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMExpHeapBlock>())).blockSize as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMExpHeapBlock),
            "::",
            stringify!(blockSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMExpHeapBlock>())).prev as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMExpHeapBlock),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMExpHeapBlock>())).next as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMExpHeapBlock),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMExpHeapBlock>())).tag as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMExpHeapBlock),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMExpHeapBlock>())).__unk35 as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMExpHeapBlock),
            "::",
            stringify!(__unk35)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MEMExpHeapBlockList {
    pub head: *mut MEMExpHeapBlock,
    pub tail: *mut MEMExpHeapBlock,
}
#[test]
fn bindgen_test_layout_MEMExpHeapBlockList() {
    assert_eq!(
        ::core::mem::size_of::<MEMExpHeapBlockList>(),
        8usize,
        concat!("Size of: ", stringify!(MEMExpHeapBlockList))
    );
    assert_eq!(
        ::core::mem::align_of::<MEMExpHeapBlockList>(),
        4usize,
        concat!("Alignment of ", stringify!(MEMExpHeapBlockList))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMExpHeapBlockList>())).head as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMExpHeapBlockList),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMExpHeapBlockList>())).tail as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMExpHeapBlockList),
            "::",
            stringify!(tail)
        )
    );
}
#[repr(C, packed)]
pub struct MEMExpHeap {
    pub header: MEMHeapHeader,
    pub freeList: MEMExpHeapBlockList,
    pub usedList: MEMExpHeapBlockList,
    pub groupId: u16,
    pub attribs: u16,
}
#[test]
fn bindgen_test_layout_MEMExpHeap() {
    assert_eq!(
        ::core::mem::size_of::<MEMExpHeap>(),
        84usize,
        concat!("Size of: ", stringify!(MEMExpHeap))
    );
    assert_eq!(
        ::core::mem::align_of::<MEMExpHeap>(),
        1usize,
        concat!("Alignment of ", stringify!(MEMExpHeap))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMExpHeap>())).header as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMExpHeap),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMExpHeap>())).freeList as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMExpHeap),
            "::",
            stringify!(freeList)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMExpHeap>())).usedList as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMExpHeap),
            "::",
            stringify!(usedList)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMExpHeap>())).groupId as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMExpHeap),
            "::",
            stringify!(groupId)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMExpHeap>())).attribs as *const _ as usize },
        82usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMExpHeap),
            "::",
            stringify!(attribs)
        )
    );
}
extern "C" {
    pub fn MEMCreateExpHeapEx(heap: *mut cty::c_void, size: u32, flags: u16) -> MEMHeapHandle;
}
extern "C" {
    pub fn MEMDestroyExpHeap(heap: MEMHeapHandle) -> *mut cty::c_void;
}
extern "C" {
    pub fn MEMAllocFromExpHeapEx(
        heap: MEMHeapHandle,
        size: u32,
        alignment: cty::c_int,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn MEMFreeToExpHeap(heap: MEMHeapHandle, block: *mut cty::c_void);
}
extern "C" {
    pub fn MEMSetAllocModeForExpHeap(
        heap: MEMHeapHandle,
        mode: MEMExpHeapMode::Type,
    ) -> MEMExpHeapMode::Type;
}
extern "C" {
    pub fn MEMGetAllocModeForExpHeap(heap: MEMHeapHandle) -> MEMExpHeapMode::Type;
}
extern "C" {
    pub fn MEMAdjustExpHeap(heap: MEMHeapHandle) -> u32;
}
extern "C" {
    pub fn MEMResizeForMBlockExpHeap(
        heap: MEMHeapHandle,
        block: *mut cty::c_void,
        size: u32,
    ) -> u32;
}
extern "C" {
    pub fn MEMGetTotalFreeSizeForExpHeap(heap: MEMHeapHandle) -> u32;
}
extern "C" {
    pub fn MEMGetAllocatableSizeForExpHeapEx(heap: MEMHeapHandle, alignment: cty::c_int) -> u32;
}
extern "C" {
    pub fn MEMSetGroupIDForExpHeap(heap: MEMHeapHandle, id: u16) -> u16;
}
extern "C" {
    pub fn MEMGetGroupIDForExpHeap(heap: MEMHeapHandle) -> u16;
}
extern "C" {
    pub fn MEMGetSizeForMBlockExpHeap(block: *mut cty::c_void) -> u32;
}
extern "C" {
    pub fn MEMGetGroupIDForMBlockExpHeap(block: *mut cty::c_void) -> u16;
}
extern "C" {
    pub fn MEMGetAllocDirForMBlockExpHeap(block: *mut cty::c_void) -> MEMExpHeapDirection::Type;
}
extern "C" {
    pub fn MEMVisitAllocatedForExpHeap(
        heap: MEMHeapHandle,
        callback: MEMExpHeapBlockVisitor,
        context: *mut cty::c_void,
    );
}
pub mod MEMFrmHeapFreeMode {
    pub type Type = cty::c_uint;
    pub const MEM_FRM_HEAP_FREE_HEAD: Type = 1;
    pub const MEM_FRM_HEAP_FREE_TAIL: Type = 2;
    pub const MEM_FRM_HEAP_FREE_ALL: Type = 3;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MEMFrmHeapState {
    pub tag: u32,
    pub head: *mut cty::c_void,
    pub tail: *mut cty::c_void,
    pub previous: *mut MEMFrmHeapState,
}
#[test]
fn bindgen_test_layout_MEMFrmHeapState() {
    assert_eq!(
        ::core::mem::size_of::<MEMFrmHeapState>(),
        16usize,
        concat!("Size of: ", stringify!(MEMFrmHeapState))
    );
    assert_eq!(
        ::core::mem::align_of::<MEMFrmHeapState>(),
        4usize,
        concat!("Alignment of ", stringify!(MEMFrmHeapState))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMFrmHeapState>())).tag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMFrmHeapState),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMFrmHeapState>())).head as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMFrmHeapState),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMFrmHeapState>())).tail as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMFrmHeapState),
            "::",
            stringify!(tail)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMFrmHeapState>())).previous as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMFrmHeapState),
            "::",
            stringify!(previous)
        )
    );
}
#[repr(C, packed)]
pub struct MEMFrmHeap {
    pub header: MEMHeapHeader,
    pub head: *mut cty::c_void,
    pub tail: *mut cty::c_void,
    pub previousState: *mut MEMFrmHeapState,
}
#[test]
fn bindgen_test_layout_MEMFrmHeap() {
    assert_eq!(
        ::core::mem::size_of::<MEMFrmHeap>(),
        76usize,
        concat!("Size of: ", stringify!(MEMFrmHeap))
    );
    assert_eq!(
        ::core::mem::align_of::<MEMFrmHeap>(),
        1usize,
        concat!("Alignment of ", stringify!(MEMFrmHeap))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMFrmHeap>())).header as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMFrmHeap),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMFrmHeap>())).head as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMFrmHeap),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMFrmHeap>())).tail as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMFrmHeap),
            "::",
            stringify!(tail)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMFrmHeap>())).previousState as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMFrmHeap),
            "::",
            stringify!(previousState)
        )
    );
}
extern "C" {
    pub fn MEMCreateFrmHeapEx(heap: *mut cty::c_void, size: u32, flags: u32) -> MEMHeapHandle;
}
extern "C" {
    pub fn MEMDestroyFrmHeap(heap: MEMHeapHandle) -> *mut cty::c_void;
}
extern "C" {
    pub fn MEMAllocFromFrmHeapEx(
        heap: MEMHeapHandle,
        size: u32,
        alignment: cty::c_int,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn MEMFreeToFrmHeap(heap: MEMHeapHandle, mode: MEMFrmHeapFreeMode::Type);
}
extern "C" {
    pub fn MEMRecordStateForFrmHeap(heap: MEMHeapHandle, tag: u32) -> BOOL;
}
extern "C" {
    pub fn MEMFreeByStateToFrmHeap(heap: MEMHeapHandle, tag: u32) -> BOOL;
}
extern "C" {
    pub fn MEMAdjustFrmHeap(heap: MEMHeapHandle) -> u32;
}
extern "C" {
    pub fn MEMResizeForMBlockFrmHeap(heap: MEMHeapHandle, addr: u32, size: u32) -> u32;
}
extern "C" {
    pub fn MEMGetAllocatableSizeForFrmHeapEx(heap: MEMHeapHandle, alignment: cty::c_int) -> u32;
}
pub mod OSMemoryType {
    pub type Type = cty::c_uint;
    pub const OS_MEM1: Type = 1;
    pub const OS_MEM2: Type = 2;
}
pub mod OSSharedDataType {
    pub type Type = cty::c_uint;
    pub const OS_SHAREDDATATYPE_FONT_CHINESE: Type = 0;
    pub const OS_SHAREDDATATYPE_FONT_KOREAN: Type = 1;
    pub const OS_SHAREDDATATYPE_FONT_STANDARD: Type = 2;
    pub const OS_SHAREDDATATYPE_FONT_TAIWANESE: Type = 3;
    pub const OS_SHAREDDATATYPE_FONT_MAX: Type = 4;
}
extern "C" {
    pub fn OSGetSharedData(
        type_: OSSharedDataType::Type,
        unk_r4: u32,
        outPtr: *mut *mut cty::c_void,
        outSize: *mut u32,
    ) -> BOOL;
}
extern "C" {
    #[doc = " Moves chunks of memory around, similarly to memmove. Overlapping source and"]
    #[doc = " destination regions are supported."]
    #[doc = ""]
    #[doc = " \\param dst"]
    #[doc = " The destination address for the move."]
    #[doc = ""]
    #[doc = " \\param src"]
    #[doc = " The source address for the move."]
    #[doc = ""]
    #[doc = " \\param size"]
    #[doc = " The size of the data to be moved, in bytes."]
    #[doc = ""]
    #[doc = " \\param flush"]
    #[doc = " Whether to flush the data caches for the source and destination."]
    #[doc = ""]
    #[doc = " \\return"]
    #[doc = " dst is returned."]
    #[doc = ""]
    #[doc = " \\note"]
    #[doc = " This function makes use of the cache to speed up the copy, so a flush is"]
    #[doc = " recommended."]
    pub fn OSBlockMove(
        dst: *mut cty::c_void,
        src: *const cty::c_void,
        size: u32,
        flush: BOOL,
    ) -> *mut cty::c_void;
}
extern "C" {
    #[doc = " Fills a chunk of memory with the given value, like memset."]
    #[doc = ""]
    #[doc = " \\param dst"]
    #[doc = " Pointer to the memory to fill."]
    #[doc = ""]
    #[doc = " \\param val"]
    #[doc = " Byte value to be set."]
    #[doc = ""]
    #[doc = " \\param size"]
    #[doc = " Number of bytes to be set to val."]
    #[doc = ""]
    #[doc = " \\return"]
    #[doc = " dst is returned."]
    pub fn OSBlockSet(dst: *mut cty::c_void, val: u8, size: u32) -> *mut cty::c_void;
}
extern "C" {
    pub fn OSAllocFromSystem(size: u32, align: cty::c_int) -> *mut cty::c_void;
}
extern "C" {
    pub fn OSFreeToSystem(ptr: *mut cty::c_void);
}
extern "C" {
    #[doc = " Gets the location and size of the foreground bucket memory area."]
    #[doc = ""]
    #[doc = " \\note"]
    #[doc = " This function may not account for the system reserved portion of the"]
    #[doc = " foreground bucket. Consider using OSGetForegroundBucketFreeArea() instead."]
    #[doc = ""]
    #[doc = " \\param outAddr"]
    #[doc = " Pointer to write the foreground bucket's address to."]
    #[doc = ""]
    #[doc = " \\param outSize"]
    #[doc = " Pointer to write the foreground bucket's size to."]
    #[doc = ""]
    #[doc = " \\return"]
    #[doc = " \\c true on success."]
    pub fn OSGetForegroundBucket(outAddr: *mut u32, outSize: *mut u32) -> BOOL;
}
extern "C" {
    #[doc = " Gets the location and size of the application-usable portion of the"]
    #[doc = " foreground bucket area."]
    #[doc = ""]
    #[doc = " \\param outAddr"]
    #[doc = " Pointer to write the bucket area's address to."]
    #[doc = ""]
    #[doc = " \\param outSize"]
    #[doc = " Pointer to write the bucket area's size to."]
    #[doc = ""]
    #[doc = " \\return"]
    #[doc = " \\c true on success."]
    pub fn OSGetForegroundBucketFreeArea(outAddr: *mut u32, outSize: *mut u32) -> BOOL;
}
extern "C" {
    #[doc = " Gets the location and size of available memory areas."]
    #[doc = ""]
    #[doc = " \\param type"]
    #[doc = " Type of memory to get information about. See #OSMemoryType."]
    #[doc = ""]
    #[doc = " \\param outAddr"]
    #[doc = " Pointer to write the area's address to."]
    #[doc = ""]
    #[doc = " \\param outSize"]
    #[doc = " Pointer to write the area's size to."]
    #[doc = ""]
    #[doc = " \\return"]
    #[doc = " 0 on success, -1 otherwise."]
    pub fn OSGetMemBound(
        type_: OSMemoryType::Type,
        outAddr: *mut u32,
        outSize: *mut u32,
    ) -> cty::c_int;
}
extern "C" {
    #[doc = " Zeros the memory for a given proccessID."]
    #[doc = " Works only inside the ROOT process."]
    pub fn __OSZeroProcessMemory(proccesID: u32);
}
pub mod OSMemoryMapMode {
    pub type Type = cty::c_uint;
    pub const OS_MAP_MEMORY_INVALID: Type = 0;
    pub const OS_MAP_MEMORY_READ_ONLY: Type = 1;
    pub const OS_MAP_MEMORY_READ_WRITE: Type = 2;
    pub const OS_MAP_MEMORY_FREE: Type = 3;
    pub const OS_MAP_MEMORY_ALLOCATED: Type = 4;
}
extern "C" {
    pub fn OSEffectiveToPhysical(virtualAddress: u32) -> u32;
}
extern "C" {
    pub fn OSIsAddressValid(virtualAddress: u32) -> BOOL;
}
extern "C" {
    pub fn __OSValidateAddressSpaceRange(arg1: cty::c_int, virtualAddress: u32, size: u32) -> BOOL;
}
extern "C" {
    #[doc = " Allocates virtual address range for later mapping."]
    #[doc = ""]
    #[doc = " \\param virtualAddress"]
    #[doc = " Requested start address for the range. If there is no preference, NULL can be"]
    #[doc = " used."]
    #[doc = ""]
    #[doc = " \\param size"]
    #[doc = " Size of address range to allocate."]
    #[doc = ""]
    #[doc = " \\param align"]
    #[doc = " Alignment of address range to allocate."]
    #[doc = ""]
    #[doc = " \\return"]
    #[doc = " The starting address of the newly allocated range, or NULL on failure."]
    #[doc = ""]
    #[doc = " \\sa"]
    #[doc = " - OSFreeVirtAddr()"]
    #[doc = " - OSMapMemory()"]
    pub fn OSAllocVirtAddr(virtualAddress: u32, size: u32, align: u32) -> u32;
}
extern "C" {
    #[doc = " Frees a previously allocated virtual address range back to the system."]
    #[doc = ""]
    #[doc = " \\param virtualAddress"]
    #[doc = " The start of the virtual address range to free."]
    #[doc = ""]
    #[doc = " \\param size"]
    #[doc = " The size of the virtual address range to free."]
    #[doc = ""]
    #[doc = " \\return"]
    #[doc = " \\c true on success."]
    pub fn OSFreeVirtAddr(virtualAddress: u32, size: u32) -> BOOL;
}
extern "C" {
    #[doc = " Determines the status of the given virtual memory address - mapped read-write"]
    #[doc = " or read-only, free, allocated or invalid."]
    #[doc = ""]
    #[doc = " \\param virtualAddress"]
    #[doc = " The virtual address to query."]
    #[doc = ""]
    #[doc = " \\return"]
    #[doc = " The status of the memory address - see #OSMemoryMapMode."]
    pub fn OSQueryVirtAddr(virtualAddress: u32) -> OSMemoryMapMode::Type;
}
extern "C" {
    #[doc = " Maps a physical address to a virtual address, with a given size and set of"]
    #[doc = " permissions."]
    #[doc = ""]
    #[doc = " \\param virtualAddress"]
    #[doc = " The target virtual address for the mapping."]
    #[doc = ""]
    #[doc = " \\param physicalAddress"]
    #[doc = " Physical address of the memory to back the mapping."]
    #[doc = ""]
    #[doc = " \\param size"]
    #[doc = " Size, in bytes, of the desired mapping. Likely has an alignment requirement."]
    #[doc = ""]
    #[doc = " \\param mode"]
    #[doc = " Permissions to map the memory with - see #OSMemoryMapMode."]
    #[doc = ""]
    #[doc = " \\return"]
    #[doc = " \\c true on success."]
    #[doc = ""]
    #[doc = " \\sa"]
    #[doc = " - OSAllocVirtAddr()"]
    #[doc = " - OSUnmapMemory()"]
    pub fn OSMapMemory(
        virtualAddress: u32,
        physicalAddress: u32,
        size: u32,
        mode: OSMemoryMapMode::Type,
    ) -> BOOL;
}
extern "C" {
    #[doc = " Unmaps previously mapped memory."]
    #[doc = ""]
    #[doc = " \\param virtualAddress"]
    #[doc = " Starting address of the area to unmap."]
    #[doc = ""]
    #[doc = " \\param size"]
    #[doc = " Size of the memory area to unmap."]
    #[doc = ""]
    #[doc = " \\return"]
    #[doc = " \\c true on success."]
    pub fn OSUnmapMemory(virtualAddress: u32, size: u32) -> BOOL;
}
extern "C" {
    #[doc = " Gets the range of virtual addresses available for mapping."]
    #[doc = ""]
    #[doc = " \\param outVirtualAddress"]
    #[doc = " Pointer to write the starting address of the memory area to."]
    #[doc = ""]
    #[doc = " \\param outSize"]
    #[doc = " Pointer to write the size of the memory area to."]
    #[doc = ""]
    #[doc = " \\sa"]
    #[doc = " - OSMapMemory()"]
    pub fn OSGetMapVirtAddrRange(outVirtualAddress: *mut u32, outSize: *mut u32);
}
extern "C" {
    #[doc = " Gets the range of available physical memory (not reserved for app code or"]
    #[doc = " data)."]
    #[doc = ""]
    #[doc = " \\param outPhysicalAddress"]
    #[doc = " Pointer to write the starting physical address of the memory area to."]
    #[doc = ""]
    #[doc = " \\param outSize"]
    #[doc = " Pointer to write the size of the memory area to."]
    #[doc = ""]
    #[doc = " \\if false"]
    #[doc = " Is memory returned by this function actually safe to map and use? couldn't"]
    #[doc = " get a straight answer from decaf-emu's kernel_memory.cpp..."]
    #[doc = " \\endif"]
    pub fn OSGetAvailPhysAddrRange(outPhysicalAddress: *mut u32, outSize: *mut u32);
}
extern "C" {
    #[doc = " Gets the range of physical memory used for the application's data."]
    #[doc = ""]
    #[doc = " \\param outPhysicalAddress"]
    #[doc = " Pointer to write the starting physical address of the memory area to."]
    #[doc = ""]
    #[doc = " \\param outSize"]
    #[doc = " Pointer to write the size of the memory area to."]
    #[doc = ""]
    #[doc = " \\if false"]
    #[doc = " does this include the main heap?"]
    #[doc = " \\endif"]
    pub fn OSGetDataPhysAddrRange(outPhysicalAddress: *mut u32, outSize: *mut u32);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MEMUnitHeapFreeBlock {
    pub next: *mut MEMUnitHeapFreeBlock,
}
#[test]
fn bindgen_test_layout_MEMUnitHeapFreeBlock() {
    assert_eq!(
        ::core::mem::size_of::<MEMUnitHeapFreeBlock>(),
        4usize,
        concat!("Size of: ", stringify!(MEMUnitHeapFreeBlock))
    );
    assert_eq!(
        ::core::mem::align_of::<MEMUnitHeapFreeBlock>(),
        4usize,
        concat!("Alignment of ", stringify!(MEMUnitHeapFreeBlock))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMUnitHeapFreeBlock>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMUnitHeapFreeBlock),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C, packed)]
pub struct MEMUnitHeap {
    pub header: MEMHeapHeader,
    pub freeBlocks: *mut MEMUnitHeapFreeBlock,
    pub blockSize: u32,
}
#[test]
fn bindgen_test_layout_MEMUnitHeap() {
    assert_eq!(
        ::core::mem::size_of::<MEMUnitHeap>(),
        72usize,
        concat!("Size of: ", stringify!(MEMUnitHeap))
    );
    assert_eq!(
        ::core::mem::align_of::<MEMUnitHeap>(),
        1usize,
        concat!("Alignment of ", stringify!(MEMUnitHeap))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMUnitHeap>())).header as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMUnitHeap),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMUnitHeap>())).freeBlocks as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMUnitHeap),
            "::",
            stringify!(freeBlocks)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MEMUnitHeap>())).blockSize as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(MEMUnitHeap),
            "::",
            stringify!(blockSize)
        )
    );
}
extern "C" {
    pub fn MEMCreateUnitHeapEx(
        heap: *mut cty::c_void,
        size: u32,
        blockSize: u32,
        alignment: i32,
        flags: u16,
    ) -> MEMHeapHandle;
}
extern "C" {
    pub fn MEMDestroyUnitHeap(heap: MEMHeapHandle) -> *mut cty::c_void;
}
extern "C" {
    pub fn MEMAllocFromUnitHeap(heap: MEMHeapHandle) -> *mut cty::c_void;
}
extern "C" {
    pub fn MEMFreeToUnitHeap(heap: MEMHeapHandle, block: *mut cty::c_void);
}
extern "C" {
    pub fn MEMiDumpUnitHeap(heap: MEMHeapHandle);
}
extern "C" {
    pub fn MEMCountFreeBlockForUnitHeap(heap: MEMHeapHandle) -> u32;
}
extern "C" {
    pub fn MEMCalcHeapSizeForUnitHeap(blockSize: u32, count: u32, alignment: i32) -> u32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSMutexLink {
    pub next: *mut OSMutex,
    pub prev: *mut OSMutex,
}
#[test]
fn bindgen_test_layout_OSMutexLink() {
    assert_eq!(
        ::core::mem::size_of::<OSMutexLink>(),
        8usize,
        concat!("Size of: ", stringify!(OSMutexLink))
    );
    assert_eq!(
        ::core::mem::align_of::<OSMutexLink>(),
        4usize,
        concat!("Alignment of ", stringify!(OSMutexLink))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMutexLink>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMutexLink),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMutexLink>())).prev as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMutexLink),
            "::",
            stringify!(prev)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSMutex {
    #[doc = "! Should always be set to the value OS_MUTEX_TAG."]
    pub tag: u32,
    #[doc = "! Name set by OSInitMutexEx."]
    pub name: *const cty::c_char,
    pub __unk36: [cty::c_char; 4usize],
    #[doc = "! Queue of threads waiting for this mutex to unlock."]
    pub queue: OSThreadQueue,
    #[doc = "! Current owner of mutex."]
    pub owner: *mut OSThread,
    #[doc = "! Current recursion lock count of mutex."]
    pub count: i32,
    #[doc = "! Link used inside OSThread's mutex queue."]
    pub link: OSMutexLink,
}
#[test]
fn bindgen_test_layout_OSMutex() {
    assert_eq!(
        ::core::mem::size_of::<OSMutex>(),
        44usize,
        concat!("Size of: ", stringify!(OSMutex))
    );
    assert_eq!(
        ::core::mem::align_of::<OSMutex>(),
        4usize,
        concat!("Alignment of ", stringify!(OSMutex))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMutex>())).tag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMutex),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMutex>())).name as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMutex),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMutex>())).__unk36 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMutex),
            "::",
            stringify!(__unk36)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMutex>())).queue as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMutex),
            "::",
            stringify!(queue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMutex>())).owner as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMutex),
            "::",
            stringify!(owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMutex>())).count as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMutex),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSMutex>())).link as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(OSMutex),
            "::",
            stringify!(link)
        )
    );
}
extern "C" {
    #[doc = " Initialise a mutex structure."]
    pub fn OSInitMutex(mutex: *mut OSMutex);
}
extern "C" {
    #[doc = " Initialise a mutex structure with a name."]
    pub fn OSInitMutexEx(mutex: *mut OSMutex, name: *const cty::c_char);
}
extern "C" {
    #[doc = " Lock the mutex."]
    #[doc = ""]
    #[doc = " If no one owns the mutex, set current thread as owner."]
    #[doc = ""]
    #[doc = " If the lock is owned by the current thread, increase the recursion count."]
    #[doc = ""]
    #[doc = " If the lock is owned by another thread, the current thread will sleep until"]
    #[doc = " the owner has unlocked this mutex."]
    #[doc = ""]
    #[doc = " Similar to <a href=\"http://en.cppreference.com/w/cpp/thread/recursive_mutex/lock\">std::recursive_mutex::lock</a>."]
    pub fn OSLockMutex(mutex: *mut OSMutex);
}
extern "C" {
    #[doc = " Try to lock a mutex."]
    #[doc = ""]
    #[doc = " If no one owns the mutex, set current thread as owner."]
    #[doc = ""]
    #[doc = " If the lock is owned by the current thread, increase the recursion count."]
    #[doc = ""]
    #[doc = " If the lock is owned by another thread, do not block, return FALSE."]
    #[doc = ""]
    #[doc = " \\return TRUE if the mutex is locked, FALSE if the mutex is owned by another thread."]
    #[doc = ""]
    #[doc = " Similar to <a href=\"http://en.cppreference.com/w/cpp/thread/recursive_mutex/try_lock\">std::recursive_mutex::try_lock</a>."]
    pub fn OSTryLockMutex(mutex: *mut OSMutex) -> BOOL;
}
extern "C" {
    #[doc = " Unlocks the mutex."]
    #[doc = ""]
    #[doc = " Will decrease the recursion count, will only unlock the mutex when the"]
    #[doc = " recursion count reaches 0."]
    #[doc = ""]
    #[doc = " If any other threads are waiting to lock the mutex they will be woken."]
    #[doc = ""]
    #[doc = " Similar to <a href=\"http://en.cppreference.com/w/cpp/thread/recursive_mutex/unlock\">std::recursive_mutex::unlock</a>."]
    pub fn OSUnlockMutex(mutex: *mut OSMutex);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSRendezvous {
    pub core: [u32; 3usize],
    pub __unk37: [cty::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_OSRendezvous() {
    assert_eq!(
        ::core::mem::size_of::<OSRendezvous>(),
        16usize,
        concat!("Size of: ", stringify!(OSRendezvous))
    );
    assert_eq!(
        ::core::mem::align_of::<OSRendezvous>(),
        4usize,
        concat!("Alignment of ", stringify!(OSRendezvous))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSRendezvous>())).core as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSRendezvous),
            "::",
            stringify!(core)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSRendezvous>())).__unk37 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(OSRendezvous),
            "::",
            stringify!(__unk37)
        )
    );
}
extern "C" {
    pub fn OSInitRendezvous(rendezvous: *mut OSRendezvous);
}
extern "C" {
    pub fn OSWaitRendezvous(rendezvous: *mut OSRendezvous, coreMask: u32) -> BOOL;
}
extern "C" {
    pub fn OSWaitRendezvousWithTimeout(
        rendezvous: *mut OSRendezvous,
        coreMask: u32,
        timeout: OSTime,
    ) -> BOOL;
}
pub mod OSScreenID {
    #[doc = "! Defines the ID of a display usable with OSScreen."]
    pub type Type = cty::c_uint;
    #[doc = "! Represents the TV connected to the system."]
    pub const SCREEN_TV: Type = 0;
    #[doc = "! Represents the screen in the DRC (gamepad)."]
    pub const SCREEN_DRC: Type = 1;
}
extern "C" {
    #[doc = " Initialises the OSScreen library for use. This function must be called before"]
    #[doc = " using any other OSScreen functions."]
    #[doc = ""]
    #[doc = " \\sa <ul>"]
    #[doc = " <li>\\link OSScreenSetBufferEx \\endlink</li>"]
    #[doc = " <li>\\link OSScreenEnableEx \\endlink</li>"]
    #[doc = " <li>\\link OSScreenShutdown \\endlink</li>"]
    #[doc = " </ul>"]
    pub fn OSScreenInit();
}
extern "C" {
    #[doc = " Cleans up and shuts down the OSScreen library."]
    #[doc = ""]
    #[doc = " \\sa <ul>"]
    #[doc = " <li>\\link OSScreenEnableEx \\endlink</li>"]
    #[doc = " </ul>"]
    pub fn OSScreenShutdown();
}
extern "C" {
    #[doc = " Gets the amount of memory required to fit both buffers of a given screen."]
    #[doc = ""]
    #[doc = " \\param screen"]
    #[doc = " The ID of the screen to be sized."]
    #[doc = ""]
    #[doc = " \\sa <ul>"]
    #[doc = " <li>\\link OSScreenSetBufferEx \\endlink</li>"]
    #[doc = " </ul>"]
    pub fn OSScreenGetBufferSizeEx(screen: OSScreenID::Type) -> u32;
}
extern "C" {
    #[doc = " Sets the memory location for both buffers of a given screen. This location"]
    #[doc = " must be of the size prescribed by \\link OSScreenGetBufferSizeEx \\endlink and"]
    #[doc = " at an address aligned to 0x100 bytes."]
    #[doc = ""]
    #[doc = " \\param screen"]
    #[doc = " The ID of the screen whose memory location should be changed."]
    #[doc = ""]
    #[doc = " \\param addr"]
    #[doc = " Pointer to the memory to use. This area must be 0x100 aligned, and of the"]
    #[doc = " size given by \\link OSScreenGetBufferSizeEx \\endlink."]
    #[doc = ""]
    #[doc = " \\sa <ul>"]
    #[doc = " <li>\\link OSScreenGetBufferSizeEx \\endlink</li>"]
    #[doc = " </ul>"]
    pub fn OSScreenSetBufferEx(screen: OSScreenID::Type, addr: *mut cty::c_void);
}
extern "C" {
    #[doc = " Clear the work buffer of the given screen by setting all of its pixels to"]
    #[doc = " a given colour."]
    #[doc = ""]
    #[doc = " \\param screen"]
    #[doc = " The ID of the screen to clear. Only the work buffer will be cleared."]
    #[doc = ""]
    #[doc = " \\param colour"]
    #[doc = " The colour to use, in big-endian RGBX8 format - 0xRRGGBBXX, where X bits are"]
    #[doc = " ignored."]
    #[doc = ""]
    #[doc = " \\note"]
    #[doc = " Since this function only affects the <em>work buffer</em>, its effect will"]
    #[doc = " not appear on screen immediately. See \\link OSScreenFlipBuffersEx \\endlink."]
    #[doc = ""]
    #[doc = " \\sa <ul>"]
    #[doc = " <li>\\link OSScreenPutFontEx \\endlink</li>"]
    #[doc = " <li>\\link OSScreenPutPixelEx \\endlink</li>"]
    #[doc = " </ul>"]
    #[doc = ""]
    #[doc = " <!-- TODO: Are the XX bits really ignored? I'm basing this off a vague memory"]
    #[doc = " of setting them to 00 and nothing changing... Check this. -->"]
    pub fn OSScreenClearBufferEx(screen: OSScreenID::Type, colour: u32);
}
extern "C" {
    #[doc = " Swap the buffers of the given screen. The work buffer will become the visible"]
    #[doc = " buffer and will start being shown on-screen, while the visible buffer becomes"]
    #[doc = " the new work buffer. This operation is known as \"flipping\" the buffers."]
    #[doc = ""]
    #[doc = " You must call this function once drawing is complete, otherwise draws will"]
    #[doc = " not appear on-screen."]
    #[doc = ""]
    #[doc = " \\param screen"]
    #[doc = " The ID of the screen to flip."]
    pub fn OSScreenFlipBuffersEx(screen: OSScreenID::Type);
}
extern "C" {
    #[doc = " Draws text at the given position. The text will be drawn to the work"]
    #[doc = " buffer with a built-in monospace font, coloured white, and anti-aliased."]
    #[doc = " The position coordinates are in <em>characters</em>, not pixels."]
    #[doc = ""]
    #[doc = " \\param screen"]
    #[doc = " The ID of the screen to draw to. Only the work buffer will be affected."]
    #[doc = ""]
    #[doc = " \\param row"]
    #[doc = " The row, in characters, to place the text in. 0 corresponds to the top of"]
    #[doc = " the screen."]
    #[doc = ""]
    #[doc = " \\param column"]
    #[doc = " The column, in characters, to place the text at. 0 corresponds to the left of"]
    #[doc = " the screen."]
    #[doc = ""]
    #[doc = " \\param buffer"]
    #[doc = " Pointer to the string of text to draw. Null-terminated."]
    #[doc = ""]
    #[doc = " \\note"]
    #[doc = " Since this function only affects the <em>work buffer</em>, its effect will"]
    #[doc = " not appear on screen immediately. See \\link OSScreenFlipBuffersEx \\endlink."]
    #[doc = ""]
    #[doc = " \\sa <ul>"]
    #[doc = " <li>\\link OSScreenPutPixelEx \\endlink</li>"]
    #[doc = " <li>\\link OSScreenClearBufferEx \\endlink</li>"]
    #[doc = " </ul>"]
    pub fn OSScreenPutFontEx(
        screen: OSScreenID::Type,
        row: u32,
        column: u32,
        buffer: *const cty::c_char,
    );
}
extern "C" {
    #[doc = " Draws a single pixel at the given position. The pixel, a 32-bit RGBX"]
    #[doc = " colour, will be placed in the work buffer at the coordinates given."]
    #[doc = ""]
    #[doc = " \\param screen"]
    #[doc = " The ID of the screen to place the pixel in."]
    #[doc = ""]
    #[doc = " \\param x"]
    #[doc = " The x-coordinate, in pixels, to draw the pixel at."]
    #[doc = ""]
    #[doc = " \\param y"]
    #[doc = " The y-coordinate, in pixels, to draw the pixel at."]
    #[doc = ""]
    #[doc = " \\param colour"]
    #[doc = " The desired colour of the pixel to draw, in RGBX32 colour (0xRRGGBBXX, where"]
    #[doc = " the XX value is ignored)."]
    #[doc = ""]
    #[doc = " \\note"]
    #[doc = " Since this function only affects the <em>work buffer</em>, its effect will"]
    #[doc = " not appear on screen immediately. See \\link OSScreenFlipBuffersEx \\endlink."]
    #[doc = ""]
    #[doc = " \\sa <ul>"]
    #[doc = " <li>\\link OSScreenPutFontEx \\endlink</li>"]
    #[doc = " <li>\\link OSScreenClearBufferEx \\endlink</li>"]
    #[doc = " </ul>"]
    pub fn OSScreenPutPixelEx(screen: OSScreenID::Type, x: u32, y: u32, colour: u32);
}
extern "C" {
    #[doc = " Enables or disables a given screen. If a screen is disabled, it shows black."]
    #[doc = ""]
    #[doc = " \\param screen"]
    #[doc = " The ID of the screen to enable or disable."]
    #[doc = ""]
    #[doc = " \\param enable"]
    #[doc = " \\c true if the screen should be enabled, otherwise false."]
    pub fn OSScreenEnableEx(screen: OSScreenID::Type, enable: BOOL);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OSSemaphore {
    #[doc = "! Should always be set to the value OS_SEMAPHORE_TAG."]
    pub tag: u32,
    #[doc = "! Name set by OSInitMutexEx."]
    pub name: *const cty::c_char,
    pub __unk38: [cty::c_char; 4usize],
    #[doc = "! Current count of semaphore"]
    pub count: i32,
    #[doc = "! Queue of threads waiting on semaphore object with OSWaitSemaphore"]
    pub queue: OSThreadQueue,
}
#[test]
fn bindgen_test_layout_OSSemaphore() {
    assert_eq!(
        ::core::mem::size_of::<OSSemaphore>(),
        32usize,
        concat!("Size of: ", stringify!(OSSemaphore))
    );
    assert_eq!(
        ::core::mem::align_of::<OSSemaphore>(),
        4usize,
        concat!("Alignment of ", stringify!(OSSemaphore))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSSemaphore>())).tag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OSSemaphore),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSSemaphore>())).name as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(OSSemaphore),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSSemaphore>())).__unk38 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OSSemaphore),
            "::",
            stringify!(__unk38)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSSemaphore>())).count as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(OSSemaphore),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<OSSemaphore>())).queue as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(OSSemaphore),
            "::",
            stringify!(queue)
        )
    );
}
extern "C" {
    #[doc = " Initialise semaphore object with count."]
    pub fn OSInitSemaphore(semaphore: *mut OSSemaphore, count: i32);
}
extern "C" {
    #[doc = " Initialise semaphore object with count and name."]
    pub fn OSInitSemaphoreEx(semaphore: *mut OSSemaphore, count: i32, name: *const cty::c_char);
}
extern "C" {
    #[doc = " Get the current semaphore count."]
    pub fn OSGetSemaphoreCount(semaphore: *mut OSSemaphore) -> i32;
}
extern "C" {
    #[doc = " Increase the semaphore value."]
    #[doc = ""]
    #[doc = " If any threads are waiting for semaphore, they are woken."]
    pub fn OSSignalSemaphore(semaphore: *mut OSSemaphore) -> i32;
}
extern "C" {
    #[doc = " Decrease the semaphore value."]
    #[doc = ""]
    #[doc = " If the value is less than or equal to zero the current thread will be put to"]
    #[doc = " sleep until the count is above zero and it can decrement it safely."]
    pub fn OSWaitSemaphore(semaphore: *mut OSSemaphore) -> i32;
}
extern "C" {
    #[doc = " Try to decrease the semaphore value."]
    #[doc = ""]
    #[doc = " If the value is greater than zero then it will be decremented, else the function"]
    #[doc = " will return immediately with a value <= 0 indicating a failure."]
    #[doc = ""]
    #[doc = " \\return Returns previous semaphore count, before the decrement in this function."]
    #[doc = "         If the value is >0 then it means the call was succesful."]
    pub fn OSTryWaitSemaphore(semaphore: *mut OSSemaphore) -> i32;
}
pub type MPTaskFunc = ::core::option::Option<unsafe extern "C" fn(arg1: u32, arg2: u32) -> u32>;
pub mod MPTaskState {
    pub type Type = cty::c_uint;
    pub const MP_TASK_STATE_INITIALISED: Type = 1;
    pub const MP_TASK_STATE_READY: Type = 2;
    pub const MP_TASK_STATE_RUNNING: Type = 4;
    pub const MP_TASK_STATE_FINISHED: Type = 8;
}
pub mod MPTaskQueueState {
    pub type Type = cty::c_uint;
    pub const MP_TASK_QUEUE_STATE_INITIALISED: Type = 1;
    pub const MP_TASK_QUEUE_STATE_READY: Type = 2;
    pub const MP_TASK_QUEUE_STATE_STOPPING: Type = 4;
    pub const MP_TASK_QUEUE_STATE_STOPPED: Type = 8;
    pub const MP_TASK_QUEUE_STATE_FINISHED: Type = 16;
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct MPTaskInfo {
    pub state: MPTaskState::Type,
    pub result: u32,
    pub coreID: u32,
    pub duration: OSTime,
}
#[test]
fn bindgen_test_layout_MPTaskInfo() {
    assert_eq!(
        ::core::mem::size_of::<MPTaskInfo>(),
        20usize,
        concat!("Size of: ", stringify!(MPTaskInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<MPTaskInfo>(),
        1usize,
        concat!("Alignment of ", stringify!(MPTaskInfo))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskInfo>())).state as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskInfo),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskInfo>())).result as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskInfo),
            "::",
            stringify!(result)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskInfo>())).coreID as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskInfo),
            "::",
            stringify!(coreID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskInfo>())).duration as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskInfo),
            "::",
            stringify!(duration)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct MPTask {
    pub self_: *mut MPTask,
    pub queue: *mut MPTaskQueue,
    pub state: MPTaskState::Type,
    pub func: MPTaskFunc,
    pub userArg1: u32,
    pub userArg2: u32,
    pub result: u32,
    pub coreID: u32,
    pub duration: OSTime,
    pub userData: *mut cty::c_void,
}
#[test]
fn bindgen_test_layout_MPTask() {
    assert_eq!(
        ::core::mem::size_of::<MPTask>(),
        44usize,
        concat!("Size of: ", stringify!(MPTask))
    );
    assert_eq!(
        ::core::mem::align_of::<MPTask>(),
        1usize,
        concat!("Alignment of ", stringify!(MPTask))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTask>())).self_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTask),
            "::",
            stringify!(self_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTask>())).queue as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTask),
            "::",
            stringify!(queue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTask>())).state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTask),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTask>())).func as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTask),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTask>())).userArg1 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTask),
            "::",
            stringify!(userArg1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTask>())).userArg2 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTask),
            "::",
            stringify!(userArg2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTask>())).result as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTask),
            "::",
            stringify!(result)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTask>())).coreID as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTask),
            "::",
            stringify!(coreID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTask>())).duration as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTask),
            "::",
            stringify!(duration)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTask>())).userData as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTask),
            "::",
            stringify!(userData)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MPTaskQueueInfo {
    pub state: MPTaskQueueState::Type,
    pub tasks: u32,
    pub tasksReady: u32,
    pub tasksRunning: u32,
    pub tasksFinished: u32,
}
#[test]
fn bindgen_test_layout_MPTaskQueueInfo() {
    assert_eq!(
        ::core::mem::size_of::<MPTaskQueueInfo>(),
        20usize,
        concat!("Size of: ", stringify!(MPTaskQueueInfo))
    );
    assert_eq!(
        ::core::mem::align_of::<MPTaskQueueInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(MPTaskQueueInfo))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueueInfo>())).state as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueueInfo),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueueInfo>())).tasks as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueueInfo),
            "::",
            stringify!(tasks)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueueInfo>())).tasksReady as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueueInfo),
            "::",
            stringify!(tasksReady)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueueInfo>())).tasksRunning as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueueInfo),
            "::",
            stringify!(tasksRunning)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueueInfo>())).tasksFinished as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueueInfo),
            "::",
            stringify!(tasksFinished)
        )
    );
}
#[repr(C)]
#[repr(align(16))]
pub struct MPTaskQueue {
    pub self_: *mut MPTaskQueue,
    pub state: MPTaskQueueState::Type,
    pub tasks: u32,
    pub tasksReady: u32,
    pub tasksRunning: u32,
    pub __unk39: [cty::c_char; 4usize],
    pub tasksFinished: u32,
    pub __unk40: [cty::c_char; 8usize],
    pub queueIndex: u32,
    pub __unk41: [cty::c_char; 8usize],
    pub queueSize: u32,
    pub __unk42: [cty::c_char; 4usize],
    pub queue: *mut *mut MPTask,
    pub queueMaxSize: u32,
    pub lock: OSSpinLock,
}
#[test]
fn bindgen_test_layout_MPTaskQueue() {
    assert_eq!(
        ::core::mem::size_of::<MPTaskQueue>(),
        80usize,
        concat!("Size of: ", stringify!(MPTaskQueue))
    );
    assert_eq!(
        ::core::mem::align_of::<MPTaskQueue>(),
        16usize,
        concat!("Alignment of ", stringify!(MPTaskQueue))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueue>())).self_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueue),
            "::",
            stringify!(self_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueue>())).state as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueue),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueue>())).tasks as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueue),
            "::",
            stringify!(tasks)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueue>())).tasksReady as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueue),
            "::",
            stringify!(tasksReady)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueue>())).tasksRunning as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueue),
            "::",
            stringify!(tasksRunning)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueue>())).__unk39 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueue),
            "::",
            stringify!(__unk39)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueue>())).tasksFinished as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueue),
            "::",
            stringify!(tasksFinished)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueue>())).__unk40 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueue),
            "::",
            stringify!(__unk40)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueue>())).queueIndex as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueue),
            "::",
            stringify!(queueIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueue>())).__unk41 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueue),
            "::",
            stringify!(__unk41)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueue>())).queueSize as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueue),
            "::",
            stringify!(queueSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueue>())).__unk42 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueue),
            "::",
            stringify!(__unk42)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueue>())).queue as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueue),
            "::",
            stringify!(queue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueue>())).queueMaxSize as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueue),
            "::",
            stringify!(queueMaxSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<MPTaskQueue>())).lock as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(MPTaskQueue),
            "::",
            stringify!(lock)
        )
    );
}
extern "C" {
    pub fn MPInitTaskQ(queue: *mut MPTaskQueue, queueBuffer: *mut *mut MPTask, queueBufferLen: u32);
}
extern "C" {
    pub fn MPTermTaskQ(queue: *mut MPTaskQueue) -> BOOL;
}
extern "C" {
    pub fn MPGetTaskQInfo(queue: *mut MPTaskQueue, info: *mut MPTaskQueueInfo) -> BOOL;
}
extern "C" {
    pub fn MPStartTaskQ(queue: *mut MPTaskQueue) -> BOOL;
}
extern "C" {
    pub fn MPStopTaskQ(queue: *mut MPTaskQueue) -> BOOL;
}
extern "C" {
    pub fn MPResetTaskQ(queue: *mut MPTaskQueue) -> BOOL;
}
extern "C" {
    pub fn MPEnqueTask(queue: *mut MPTaskQueue, task: *mut MPTask) -> BOOL;
}
extern "C" {
    pub fn MPDequeTask(queue: *mut MPTaskQueue) -> *mut MPTask;
}
extern "C" {
    pub fn MPDequeTasks(
        queue: *mut MPTaskQueue,
        queueBuffer: *mut *mut MPTask,
        queueBufferLen: u32,
    ) -> u32;
}
extern "C" {
    pub fn MPWaitTaskQ(queue: *mut MPTaskQueue, mask: MPTaskQueueState::Type) -> BOOL;
}
extern "C" {
    pub fn MPWaitTaskQWithTimeout(
        queue: *mut MPTaskQueue,
        wmask: MPTaskQueueState::Type,
        timeout: OSTime,
    ) -> BOOL;
}
extern "C" {
    pub fn MPPrintTaskQStats(queue: *mut MPTaskQueue, unk: u32) -> BOOL;
}
extern "C" {
    pub fn MPInitTask(task: *mut MPTask, func: MPTaskFunc, userArg1: u32, userArg2: u32);
}
extern "C" {
    pub fn MPTermTask(task: *mut MPTask) -> BOOL;
}
extern "C" {
    pub fn MPGetTaskInfo(task: *mut MPTask, info: *mut MPTaskInfo) -> BOOL;
}
extern "C" {
    pub fn MPGetTaskUserData(task: *mut MPTask) -> *mut cty::c_void;
}
extern "C" {
    pub fn MPSetTaskUserData(task: *mut MPTask, userData: *mut cty::c_void);
}
extern "C" {
    pub fn MPRunTasksFromTaskQ(queue: *mut MPTaskQueue, count: u32) -> BOOL;
}
extern "C" {
    pub fn MPRunTask(task: *mut MPTask) -> BOOL;
}
extern "C" {
    pub fn OSGetTitleID() -> u64;
}
pub type UCError = i32;
pub mod UCCommand {
    pub type Type = cty::c_uint;
    pub const UC_CMD_READ_SYS_CONFIG: Type = 48;
    pub const UC_CMD_WRITE_SYS_CONFIG: Type = 49;
    pub const UC_CMD_DELETE_SYS_CONFIG: Type = 50;
    pub const UC_CMD_QUERY_SYS_CONFIG: Type = 51;
    pub const UC_CMD_LIST_SYS_CONFIG: Type = 52;
}
pub mod UCDataType {
    pub type Type = cty::c_uint;
    pub const UC_DATATYPE_UNDEFINED: Type = 0;
    pub const UC_DATATYPE_UNSIGNED_BYTE: Type = 1;
    pub const UC_DATATYPE_UNSIGNED_SHORT: Type = 2;
    pub const UC_DATATYPE_UNSIGNED_INT: Type = 3;
    pub const UC_DATATYPE_SIGNED_INT: Type = 4;
    pub const UC_DATATYPE_FLOAT: Type = 5;
    pub const UC_DATATYPE_STRING: Type = 6;
    pub const UC_DATATYPE_HEXBINARY: Type = 7;
    pub const UC_DATATYPE_COMPLEX: Type = 8;
    pub const UC_DATATYPE_INVALID: Type = 255;
}
pub mod UCErrors {
    pub type Type = cty::c_int;
    pub const UC_ERROR_OK: Type = 0;
    pub const UC_ERROR_ERROR: Type = -1;
    pub const UC_ERROR_OTHER: Type = -2097153;
    pub const UC_ERROR_SYSTEM: Type = -2097154;
    pub const UC_ERROR_ALLOC: Type = -2097155;
    pub const UC_ERROR_OPCODE: Type = -2097156;
    pub const UC_ERROR_INVALID_PARAM: Type = -2097157;
    pub const UC_ERROR_INVALID_TYPE: Type = -2097158;
    pub const UC_ERROR_UNSUPPORTED: Type = -2097159;
    pub const UC_ERROR_NON_LEAF_NODE: Type = -2097160;
    pub const UC_ERROR_KEY_NOT_FOUND: Type = -2097161;
    pub const UC_ERROR_MODIFY: Type = -2097162;
    pub const UC_ERROR_STRING_TOO_LONG: Type = -2097163;
    pub const UC_ERROR_ROOT_KEYS_DIFFER: Type = -2097164;
    pub const UC_ERROR_INVALID_LOCATION: Type = -2097165;
    pub const UC_ERROR_BAD_COMMENT: Type = -2097166;
    pub const UC_ERROR_READ_ACCESS: Type = -2097167;
    pub const UC_ERROR_WRITE_ACCESS: Type = -2097168;
    pub const UC_ERROR_CREATE_ACCESS: Type = -2097169;
    pub const UC_ERROR_FILE_SYS_NAME: Type = -2097170;
    pub const UC_ERROR_FILE_SYS_INIT: Type = -2097171;
    pub const UC_ERROR_FILE_SYS_MOUNT: Type = -2097172;
    pub const UC_ERROR_FILE_OPEN: Type = -2097173;
    pub const UC_ERROR_FILE_STAT: Type = -2097174;
    pub const UC_ERROR_FILE_READ: Type = -2097175;
    pub const UC_ERROR_FILE_WRITE: Type = -2097176;
    pub const UC_ERROR_FILE_TOO_BIG: Type = -2097177;
    pub const UC_ERROR_FILE_REMOVE: Type = -2097178;
    pub const UC_ERROR_FILE_RENAME: Type = -2097179;
    pub const UC_ERROR_FILE_CLOSE: Type = -2097180;
    pub const UC_ERROR_FILE_SEEK: Type = -2097181;
    pub const UC_ERROR_FILE_CONFIRM: Type = -2097182;
    pub const UC_ERROR_FILE_BACKUP: Type = -2097183;
    pub const UC_ERROR_MALFORMED_XML: Type = -2097184;
    pub const UC_ERROR_VERSION: Type = -2097185;
    pub const UC_ERROR_NO_IPC_BUFFERS: Type = -2097186;
    pub const UC_ERROR_FILE_LOCK_NEEDED: Type = -2097188;
    pub const UC_ERROR_SYS_PROT: Type = -2097192;
}
pub mod UCFileSys {
    pub type Type = cty::c_uint;
    pub const UC_FILE_SYS_INVALID: Type = 0;
    pub const UC_FILE_SYS_SYS: Type = 1;
    pub const UC_FILE_SYS_SLC: Type = 2;
    pub const UC_FILE_SYS_RAM: Type = 3;
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct UCSysConfig {
    pub name: [cty::c_char; 64usize],
    pub access: u32,
    pub dataType: UCDataType::Type,
    pub error: UCError,
    pub dataSize: u32,
    pub data: *mut cty::c_void,
}
#[test]
fn bindgen_test_layout_UCSysConfig() {
    assert_eq!(
        ::core::mem::size_of::<UCSysConfig>(),
        84usize,
        concat!("Size of: ", stringify!(UCSysConfig))
    );
    assert_eq!(
        ::core::mem::align_of::<UCSysConfig>(),
        1usize,
        concat!("Alignment of ", stringify!(UCSysConfig))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UCSysConfig>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UCSysConfig),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UCSysConfig>())).access as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(UCSysConfig),
            "::",
            stringify!(access)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UCSysConfig>())).dataType as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(UCSysConfig),
            "::",
            stringify!(dataType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UCSysConfig>())).error as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(UCSysConfig),
            "::",
            stringify!(error)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UCSysConfig>())).dataSize as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(UCSysConfig),
            "::",
            stringify!(dataSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UCSysConfig>())).data as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(UCSysConfig),
            "::",
            stringify!(data)
        )
    );
}
pub type UCAsyncCallbackFn = ::core::option::Option<
    unsafe extern "C" fn(
        result: UCError,
        command: UCCommand::Type,
        count: u32,
        settings: *mut UCSysConfig,
        context: *mut cty::c_void,
    ),
>;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct UCAsyncParams {
    pub callback: UCAsyncCallbackFn,
    pub context: *mut cty::c_void,
    pub command: UCCommand::Type,
    pub unk0x0C: u32,
    pub count: u32,
    pub settings: *mut UCSysConfig,
    pub vecs: *mut IOSVec,
}
#[test]
fn bindgen_test_layout_UCAsyncParams() {
    assert_eq!(
        ::core::mem::size_of::<UCAsyncParams>(),
        28usize,
        concat!("Size of: ", stringify!(UCAsyncParams))
    );
    assert_eq!(
        ::core::mem::align_of::<UCAsyncParams>(),
        1usize,
        concat!("Alignment of ", stringify!(UCAsyncParams))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UCAsyncParams>())).callback as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UCAsyncParams),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UCAsyncParams>())).context as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UCAsyncParams),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UCAsyncParams>())).command as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(UCAsyncParams),
            "::",
            stringify!(command)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UCAsyncParams>())).unk0x0C as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(UCAsyncParams),
            "::",
            stringify!(unk0x0C)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UCAsyncParams>())).count as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(UCAsyncParams),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UCAsyncParams>())).settings as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(UCAsyncParams),
            "::",
            stringify!(settings)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<UCAsyncParams>())).vecs as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(UCAsyncParams),
            "::",
            stringify!(vecs)
        )
    );
}
extern "C" {
    pub fn UCOpen() -> UCError;
}
extern "C" {
    pub fn UCClose(handle: IOSHandle) -> UCError;
}
extern "C" {
    pub fn UCDeleteSysConfig(handle: i32, count: u32, settings: *mut UCSysConfig) -> UCError;
}
extern "C" {
    pub fn UCDeleteSysConfigAsync(
        handle: i32,
        count: u32,
        settings: *mut UCSysConfig,
        asyncParams: *mut UCAsyncParams,
    ) -> UCError;
}
extern "C" {
    pub fn UCReadSysConfig(handle: i32, count: u32, settings: *mut UCSysConfig) -> UCError;
}
extern "C" {
    pub fn UCReadSysConfigAsync(
        handle: i32,
        count: u32,
        settings: *mut UCSysConfig,
        asyncParams: *mut UCAsyncParams,
    ) -> UCError;
}
extern "C" {
    pub fn UCWriteSysConfig(handle: i32, count: u32, settings: *mut UCSysConfig) -> UCError;
}
extern "C" {
    pub fn UCWriteSysConfigAsync(
        handle: i32,
        count: u32,
        settings: *mut UCSysConfig,
        asyncParams: *mut UCAsyncParams,
    ) -> UCError;
}
#[doc = "! Timestamp for a DMAE operation."]
pub type DMAETimeStamp = u64;
extern "C" {
    #[doc = " Waits for a DMAE operation to complete."]
    #[doc = ""]
    #[doc = " \\param timestamp"]
    #[doc = " Timestamp of the operation to wait for."]
    #[doc = ""]
    #[doc = " \\return"]
    #[doc = " TRUE when successful."]
    pub fn DMAEWaitDone(timestamp: DMAETimeStamp) -> BOOL;
}
pub mod DMAESwapMode {
    #[doc = "! DMAE Memory endian swappng mode."]
    pub type Type = cty::c_uint;
    #[doc = "! No memory swapping."]
    pub const DMAE_SWAP_NONE: Type = 0;
    #[doc = "! 16 bit memory swapping."]
    pub const DMAE_SWAP_16: Type = 1;
    #[doc = "! 32 bit memory swapping."]
    pub const DMAE_SWAP_32: Type = 2;
    #[doc = "! 64 bit memory swapping."]
    pub const DMAE_SWAP_64: Type = 3;
}
extern "C" {
    #[doc = " Starts a DMAE copy operation."]
    #[doc = ""]
    #[doc = " \\param dst"]
    #[doc = " Pointer to the destination buffer."]
    #[doc = ""]
    #[doc = " \\param src"]
    #[doc = " Pointer to the source buffer."]
    #[doc = ""]
    #[doc = " \\param wordCount"]
    #[doc = " Number of 32 bit words to copy."]
    #[doc = ""]
    #[doc = " \\param swap"]
    #[doc = " Memory endian swapping mode."]
    #[doc = ""]
    #[doc = " \\return"]
    #[doc = " DMAE operations queue timestamp."]
    pub fn DMAECopyMem(
        dst: *mut cty::c_void,
        src: *const cty::c_void,
        wordCount: u32,
        swap: DMAESwapMode::Type,
    ) -> DMAETimeStamp;
}
extern "C" {
    #[doc = " Starts a DMAE fill operation."]
    #[doc = ""]
    #[doc = " \\param dst"]
    #[doc = " Pointer to the destination buffer."]
    #[doc = ""]
    #[doc = " \\param val"]
    #[doc = " The value to fill the destination buffer."]
    #[doc = ""]
    #[doc = " \\param wordCount"]
    #[doc = " Number of 32 bit words to fill."]
    #[doc = ""]
    #[doc = " \\return"]
    #[doc = " DMAE operations queue timestamp."]
    pub fn DMAEFillMem(dst: *mut cty::c_void, val: u32, wordCount: u32) -> DMAETimeStamp;
}
extern "C" {
    #[doc = " Starts a DMAE fill operation for a physical address."]
    #[doc = ""]
    #[doc = " \\param dst"]
    #[doc = " Pointer to the destination buffer (physical address)."]
    #[doc = ""]
    #[doc = " \\param val"]
    #[doc = " The value to fill the destination buffer."]
    #[doc = ""]
    #[doc = " \\param wordCount"]
    #[doc = " Number of 32 bit words to fill."]
    #[doc = ""]
    #[doc = " \\return"]
    #[doc = " DMAE operations queue timestamp."]
    pub fn DMAEFillMemPhys(dst: *mut cty::c_void, val: u32, wordCount: u32) -> DMAETimeStamp;
}
pub mod GX2AAMode {
    pub type Type = cty::c_uint;
    pub const GX2_AA_MODE1X: Type = 0;
    pub const GX2_AA_MODE2X: Type = 1;
    pub const GX2_AA_MODE4X: Type = 2;
}
pub mod GX2AlphaToMaskMode {
    pub type Type = cty::c_uint;
    pub const GX2_ALPHA_TO_MASK_MODE_NON_DITHERED: Type = 0;
    pub const GX2_ALPHA_TO_MASK_MODE_DITHER_0: Type = 1;
    pub const GX2_ALPHA_TO_MASK_MODE_DITHER_90: Type = 2;
    pub const GX2_ALPHA_TO_MASK_MODE_DITHER_180: Type = 3;
    pub const GX2_ALPHA_TO_MASK_MODE_DITHER_270: Type = 4;
}
pub mod GX2AttribFormat {
    pub type Type = cty::c_uint;
    pub const GX2_ATTRIB_FORMAT_UNORM_8: Type = 0;
    pub const GX2_ATTRIB_FORMAT_UNORM_8_8: Type = 4;
    pub const GX2_ATTRIB_FORMAT_UNORM_8_8_8_8: Type = 10;
    pub const GX2_ATTRIB_FORMAT_UINT_8: Type = 256;
    pub const GX2_ATTRIB_FORMAT_UINT_8_8: Type = 260;
    pub const GX2_ATTRIB_FORMAT_UINT_8_8_8_8: Type = 266;
    pub const GX2_ATTRIB_FORMAT_SNORM_8: Type = 512;
    pub const GX2_ATTRIB_FORMAT_SNORM_8_8: Type = 516;
    pub const GX2_ATTRIB_FORMAT_SNORM_8_8_8_8: Type = 522;
    pub const GX2_ATTRIB_FORMAT_SINT_8: Type = 768;
    pub const GX2_ATTRIB_FORMAT_SINT_8_8: Type = 772;
    pub const GX2_ATTRIB_FORMAT_SINT_8_8_8_8: Type = 778;
    pub const GX2_ATTRIB_FORMAT_FLOAT_32: Type = 2054;
    pub const GX2_ATTRIB_FORMAT_FLOAT_32_32: Type = 2061;
    pub const GX2_ATTRIB_FORMAT_FLOAT_32_32_32: Type = 2065;
    pub const GX2_ATTRIB_FORMAT_FLOAT_32_32_32_32: Type = 2067;
}
pub mod GX2AttribIndexType {
    pub type Type = cty::c_uint;
    pub const GX2_ATTRIB_INDEX_PER_VERTEX: Type = 0;
    pub const GX2_ATTRIB_INDEX_PER_INSTANCE: Type = 1;
}
pub mod GX2BlendMode {
    pub type Type = cty::c_uint;
    pub const GX2_BLEND_MODE_ZERO: Type = 0;
    pub const GX2_BLEND_MODE_ONE: Type = 1;
    pub const GX2_BLEND_MODE_SRC_COLOR: Type = 2;
    pub const GX2_BLEND_MODE_INV_SRC_COLOR: Type = 3;
    pub const GX2_BLEND_MODE_SRC_ALPHA: Type = 4;
    pub const GX2_BLEND_MODE_INV_SRC_ALPHA: Type = 5;
    pub const GX2_BLEND_MODE_DST_ALPHA: Type = 6;
    pub const GX2_BLEND_MODE_INV_DST_ALPHA: Type = 7;
    pub const GX2_BLEND_MODE_DST_COLOR: Type = 8;
    pub const GX2_BLEND_MODE_INV_DST_COLOR: Type = 9;
    pub const GX2_BLEND_MODE_SRC_ALPHA_SAT: Type = 10;
    pub const GX2_BLEND_MODE_BOTH_SRC_ALPHA: Type = 11;
    pub const GX2_BLEND_MODE_BOTH_INV_SRC_ALPHA: Type = 12;
    pub const GX2_BLEND_MODE_BLEND_FACTOR: Type = 13;
    pub const GX2_BLEND_MODE_INV_BLEND_FACTOR: Type = 14;
    pub const GX2_BLEND_MODE_SRC1_COLOR: Type = 15;
    pub const GX2_BLEND_MODE_INV_SRC1_COLOR: Type = 16;
    pub const GX2_BLEND_MODE_SRC1_ALPHA: Type = 17;
    pub const GX2_BLEND_MODE_INV_SRC1_ALPHA: Type = 18;
}
pub mod GX2BlendCombineMode {
    pub type Type = cty::c_uint;
    pub const GX2_BLEND_COMBINE_MODE_ADD: Type = 0;
    pub const GX2_BLEND_COMBINE_MODE_SUB: Type = 1;
    pub const GX2_BLEND_COMBINE_MODE_MIN: Type = 2;
    pub const GX2_BLEND_COMBINE_MODE_MAX: Type = 3;
    pub const GX2_BLEND_COMBINE_MODE_REV_SUB: Type = 4;
}
pub mod GX2BufferingMode {
    pub type Type = cty::c_uint;
    pub const GX2_BUFFERING_MODE_SINGLE: Type = 1;
    pub const GX2_BUFFERING_MODE_DOUBLE: Type = 2;
    pub const GX2_BUFFERING_MODE_TRIPLE: Type = 3;
}
pub mod GX2ChannelMask {
    pub type Type = cty::c_uint;
    pub const GX2_CHANNEL_MASK_R: Type = 1;
    pub const GX2_CHANNEL_MASK_G: Type = 2;
    pub const GX2_CHANNEL_MASK_RG: Type = 3;
    pub const GX2_CHANNEL_MASK_B: Type = 4;
    pub const GX2_CHANNEL_MASK_RB: Type = 5;
    pub const GX2_CHANNEL_MASK_GB: Type = 6;
    pub const GX2_CHANNEL_MASK_RGB: Type = 7;
    pub const GX2_CHANNEL_MASK_A: Type = 8;
    pub const GX2_CHANNEL_MASK_RA: Type = 9;
    pub const GX2_CHANNEL_MASK_GA: Type = 10;
    pub const GX2_CHANNEL_MASK_RGA: Type = 11;
    pub const GX2_CHANNEL_MASK_BA: Type = 12;
    pub const GX2_CHANNEL_MASK_RBA: Type = 13;
    pub const GX2_CHANNEL_MASK_GBA: Type = 14;
    pub const GX2_CHANNEL_MASK_RGBA: Type = 15;
}
pub mod GX2ClearFlags {
    pub type Type = cty::c_uint;
    pub const GX2_CLEAR_FLAGS_DEPTH: Type = 1;
    pub const GX2_CLEAR_FLAGS_STENCIL: Type = 2;
    pub const GX2_CLEAR_FLAGS_BOTH: Type = 3;
}
pub mod GX2CompareFunction {
    pub type Type = cty::c_uint;
    pub const GX2_COMPARE_FUNC_NEVER: Type = 0;
    pub const GX2_COMPARE_FUNC_LESS: Type = 1;
    pub const GX2_COMPARE_FUNC_EQUAL: Type = 2;
    pub const GX2_COMPARE_FUNC_LEQUAL: Type = 3;
    pub const GX2_COMPARE_FUNC_GREATER: Type = 4;
    pub const GX2_COMPARE_FUNC_NOT_EQUAL: Type = 5;
    pub const GX2_COMPARE_FUNC_GEQUAL: Type = 6;
    pub const GX2_COMPARE_FUNC_ALWAYS: Type = 7;
}
pub mod GX2DrcRenderMode {
    pub type Type = cty::c_uint;
    pub const GX2_DRC_RENDER_MODE_DISABLED: Type = 0;
    pub const GX2_DRC_RENDER_MODE_SINGLE: Type = 1;
}
pub mod GX2EventType {
    pub type Type = cty::c_uint;
    pub const GX2_EVENT_TYPE_VSYNC: Type = 2;
    pub const GX2_EVENT_TYPE_FLIP: Type = 3;
    pub const GX2_EVENT_TYPE_DISPLAY_LIST_OVERRUN: Type = 4;
}
pub mod GX2EndianSwapMode {
    pub type Type = cty::c_uint;
    pub const GX2_ENDIAN_SWAP_NONE: Type = 0;
    pub const GX2_ENDIAN_SWAP_8_IN_16: Type = 1;
    pub const GX2_ENDIAN_SWAP_8_IN_32: Type = 2;
    pub const GX2_ENDIAN_SWAP_DEFAULT: Type = 3;
}
pub mod GX2FetchShaderType {
    pub type Type = cty::c_uint;
    pub const GX2_FETCH_SHADER_TESSELLATION_NONE: Type = 0;
    pub const GX2_FETCH_SHADER_TESSELLATION_LINE: Type = 1;
    pub const GX2_FETCH_SHADER_TESSELLATION_TRIANGLE: Type = 2;
    pub const GX2_FETCH_SHADER_TESSELLATION_QUAD: Type = 3;
}
pub mod GX2FrontFace {
    pub type Type = cty::c_uint;
    pub const GX2_FRONT_FACE_CCW: Type = 0;
    pub const GX2_FRONT_FACE_CW: Type = 1;
}
pub mod GX2IndexType {
    pub type Type = cty::c_uint;
    pub const GX2_INDEX_TYPE_U16_LE: Type = 0;
    pub const GX2_INDEX_TYPE_U32_LE: Type = 1;
    pub const GX2_INDEX_TYPE_U16: Type = 4;
    pub const GX2_INDEX_TYPE_U32: Type = 9;
}
pub mod GX2InvalidateMode {
    pub type Type = cty::c_uint;
    pub const GX2_INVALIDATE_MODE_ATTRIBUTE_BUFFER: Type = 1;
    pub const GX2_INVALIDATE_MODE_TEXTURE: Type = 2;
    pub const GX2_INVALIDATE_MODE_UNIFORM_BLOCK: Type = 4;
    pub const GX2_INVALIDATE_MODE_SHADER: Type = 8;
    pub const GX2_INVALIDATE_MODE_COLOR_BUFFER: Type = 16;
    pub const GX2_INVALIDATE_MODE_DEPTH_BUFFER: Type = 32;
    pub const GX2_INVALIDATE_MODE_CPU: Type = 64;
    pub const GX2_INVALIDATE_MODE_STREAM_OUT_BUFFER: Type = 128;
    pub const GX2_INVALIDATE_MODE_EXPORT_BUFFER: Type = 256;
    pub const GX2_INVALIDATE_MODE_CPU_ATTRIBUTE_BUFFER: Type = 65;
    pub const GX2_INVALIDATE_MODE_CPU_TEXTURE: Type = 66;
    pub const GX2_INVALIDATE_MODE_CPU_SHADER: Type = 72;
}
pub mod GX2InitAttributes {
    pub type Type = cty::c_uint;
    pub const GX2_INIT_END: Type = 0;
    pub const GX2_INIT_CMD_BUF_BASE: Type = 1;
    pub const GX2_INIT_CMD_BUF_POOL_SIZE: Type = 2;
    pub const GX2_INIT_ARGC: Type = 7;
    pub const GX2_INIT_ARGV: Type = 8;
}
pub mod GX2LogicOp {
    pub type Type = cty::c_uint;
    pub const GX2_LOGIC_OP_CLEAR: Type = 0;
    pub const GX2_LOGIC_OP_NOR: Type = 17;
    pub const GX2_LOGIC_OP_INV_AND: Type = 34;
    pub const GX2_LOGIC_OP_INV_COPY: Type = 51;
    pub const GX2_LOGIC_OP_REV_AND: Type = 68;
    pub const GX2_LOGIC_OP_INV: Type = 85;
    pub const GX2_LOGIC_OP_XOR: Type = 102;
    pub const GX2_LOGIC_OP_NOT_AND: Type = 119;
    pub const GX2_LOGIC_OP_AND: Type = 136;
    pub const GX2_LOGIC_OP_EQUIV: Type = 153;
    pub const GX2_LOGIC_OP_NOP: Type = 170;
    pub const GX2_LOGIC_OP_INV_OR: Type = 187;
    pub const GX2_LOGIC_OP_COPY: Type = 204;
    pub const GX2_LOGIC_OP_REV_OR: Type = 221;
    pub const GX2_LOGIC_OP_OR: Type = 238;
    pub const GX2_LOGIC_OP_SET: Type = 255;
}
pub mod GX2PrimitiveMode {
    pub type Type = cty::c_uint;
    pub const GX2_PRIMITIVE_MODE_POINTS: Type = 1;
    pub const GX2_PRIMITIVE_MODE_LINES: Type = 2;
    pub const GX2_PRIMITIVE_MODE_LINE_STRIP: Type = 3;
    pub const GX2_PRIMITIVE_MODE_TRIANGLES: Type = 4;
    pub const GX2_PRIMITIVE_MODE_TRIANGLE_FAN: Type = 5;
    pub const GX2_PRIMITIVE_MODE_TRIANGLE_STRIP: Type = 6;
    pub const GX2_PRIMITIVE_MODE_LINES_ADJACENCY: Type = 10;
    pub const GX2_PRIMITIVE_MODE_LINE_STRIP_ADJACENCY: Type = 11;
    pub const GX2_PRIMITIVE_MODE_TRIANGLES_ADJACENCY: Type = 12;
    pub const GX2_PRIMITIVE_MODE_TRIANGLE_STRIP_ADJACENCY: Type = 13;
    pub const GX2_PRIMITIVE_MODE_RECTS: Type = 17;
    pub const GX2_PRIMITIVE_MODE_LINE_LOOP: Type = 18;
    pub const GX2_PRIMITIVE_MODE_QUADS: Type = 19;
    pub const GX2_PRIMITIVE_MODE_QUAD_STRIP: Type = 20;
}
pub mod GX2PolygonMode {
    pub type Type = cty::c_uint;
    pub const GX2_POLYGON_MODE_POINT: Type = 0;
    pub const GX2_POLYGON_MODE_LINE: Type = 1;
    pub const GX2_POLYGON_MODE_TRIANGLE: Type = 2;
}
pub mod GX2RenderTarget {
    pub type Type = cty::c_uint;
    pub const GX2_RENDER_TARGET_0: Type = 0;
    pub const GX2_RENDER_TARGET_1: Type = 1;
    pub const GX2_RENDER_TARGET_2: Type = 2;
    pub const GX2_RENDER_TARGET_3: Type = 3;
    pub const GX2_RENDER_TARGET_4: Type = 4;
    pub const GX2_RENDER_TARGET_5: Type = 5;
    pub const GX2_RENDER_TARGET_6: Type = 6;
}
pub mod GX2RoundingMode {
    pub type Type = cty::c_uint;
    pub const GX2_ROUNDING_MODE_ROUND_TO_EVEN: Type = 0;
    pub const GX2_ROUNDING_MODE_TRUNCATE: Type = 1;
}
pub mod GX2SamplerVarType {
    pub type Type = cty::c_uint;
    pub const GX2_SAMPLER_VAR_TYPE_SAMPLER_1D: Type = 0;
    pub const GX2_SAMPLER_VAR_TYPE_SAMPLER_2D: Type = 1;
    pub const GX2_SAMPLER_VAR_TYPE_SAMPLER_3D: Type = 3;
    pub const GX2_SAMPLER_VAR_TYPE_SAMPLER_CUBE: Type = 4;
}
pub mod GX2ScanTarget {
    pub type Type = cty::c_uint;
    pub const GX2_SCAN_TARGET_TV: Type = 1;
    pub const GX2_SCAN_TARGET_DRC: Type = 4;
}
pub mod GX2ShaderMode {
    pub type Type = cty::c_uint;
    pub const GX2_SHADER_MODE_UNIFORM_REGISTER: Type = 0;
    pub const GX2_SHADER_MODE_UNIFORM_BLOCK: Type = 1;
    pub const GX2_SHADER_MODE_GEOMETRY_SHADER: Type = 2;
    pub const GX2_SHADER_MODE_COMPUTE_SHADER: Type = 3;
}
pub mod GX2ShaderVarType {
    pub type Type = cty::c_uint;
    pub const GX2_SHADER_VAR_TYPE_INT: Type = 2;
    pub const GX2_SHADER_VAR_TYPE_FLOAT: Type = 4;
    pub const GX2_SHADER_VAR_TYPE_FLOAT2: Type = 9;
    pub const GX2_SHADER_VAR_TYPE_FLOAT3: Type = 10;
    pub const GX2_SHADER_VAR_TYPE_FLOAT4: Type = 11;
    pub const GX2_SHADER_VAR_TYPE_INT2: Type = 15;
    pub const GX2_SHADER_VAR_TYPE_INT3: Type = 16;
    pub const GX2_SHADER_VAR_TYPE_INT4: Type = 17;
    pub const GX2_SHADER_VAR_TYPE_MATRIX4X4: Type = 29;
}
pub mod GX2StencilFunction {
    pub type Type = cty::c_uint;
    pub const GX2_STENCIL_FUNCTION_KEEP: Type = 0;
    pub const GX2_STENCIL_FUNCTION_ZERO: Type = 1;
    pub const GX2_STENCIL_FUNCTION_REPLACE: Type = 2;
    pub const GX2_STENCIL_FUNCTION_INCR_CLAMP: Type = 3;
    pub const GX2_STENCIL_FUNCTION_DECR_CLAMP: Type = 4;
    pub const GX2_STENCIL_FUNCTION_INV: Type = 5;
    pub const GX2_STENCIL_FUNCTION_INCR_WRAP: Type = 6;
    pub const GX2_STENCIL_FUNCTION_DECR_WRAP: Type = 7;
}
pub mod GX2SurfaceDim {
    pub type Type = cty::c_uint;
    pub const GX2_SURFACE_DIM_TEXTURE_1D: Type = 0;
    pub const GX2_SURFACE_DIM_TEXTURE_2D: Type = 1;
    pub const GX2_SURFACE_DIM_TEXTURE_3D: Type = 2;
    pub const GX2_SURFACE_DIM_TEXTURE_CUBE: Type = 3;
    pub const GX2_SURFACE_DIM_TEXTURE_1D_ARRAY: Type = 4;
    pub const GX2_SURFACE_DIM_TEXTURE_2D_ARRAY: Type = 5;
    pub const GX2_SURFACE_DIM_TEXTURE_2D_MSAA: Type = 6;
    pub const GX2_SURFACE_DIM_TEXTURE_2D_MSAA_ARRAY: Type = 7;
}
pub mod GX2SurfaceFormat {
    pub type Type = cty::c_uint;
    pub const GX2_SURFACE_FORMAT_INVALID: Type = 0;
    pub const GX2_SURFACE_FORMAT_UNORM_R4_G4: Type = 2;
    pub const GX2_SURFACE_FORMAT_UNORM_R4_G4_B4_A4: Type = 11;
    pub const GX2_SURFACE_FORMAT_UNORM_R8: Type = 1;
    pub const GX2_SURFACE_FORMAT_UNORM_R8_G8: Type = 7;
    pub const GX2_SURFACE_FORMAT_UNORM_R8_G8_B8_A8: Type = 26;
    pub const GX2_SURFACE_FORMAT_UNORM_R16: Type = 5;
    pub const GX2_SURFACE_FORMAT_UNORM_R16_G16: Type = 15;
    pub const GX2_SURFACE_FORMAT_UNORM_R16_G16_B16_A16: Type = 31;
    pub const GX2_SURFACE_FORMAT_UNORM_R5_G6_B5: Type = 8;
    pub const GX2_SURFACE_FORMAT_UNORM_R5_G5_B5_A1: Type = 10;
    pub const GX2_SURFACE_FORMAT_UNORM_A1_B5_G5_R5: Type = 12;
    pub const GX2_SURFACE_FORMAT_UNORM_R24_X8: Type = 17;
    pub const GX2_SURFACE_FORMAT_UNORM_A2_B10_G10_R10: Type = 27;
    pub const GX2_SURFACE_FORMAT_UNORM_R10_G10_B10_A2: Type = 25;
    pub const GX2_SURFACE_FORMAT_UNORM_BC1: Type = 49;
    pub const GX2_SURFACE_FORMAT_UNORM_BC2: Type = 50;
    pub const GX2_SURFACE_FORMAT_UNORM_BC3: Type = 51;
    pub const GX2_SURFACE_FORMAT_UNORM_BC4: Type = 52;
    pub const GX2_SURFACE_FORMAT_UNORM_BC5: Type = 53;
    pub const GX2_SURFACE_FORMAT_UNORM_NV12: Type = 129;
    pub const GX2_SURFACE_FORMAT_UINT_R8: Type = 257;
    pub const GX2_SURFACE_FORMAT_UINT_R8_G8: Type = 263;
    pub const GX2_SURFACE_FORMAT_UINT_R8_G8_B8_A8: Type = 282;
    pub const GX2_SURFACE_FORMAT_UINT_R16: Type = 261;
    pub const GX2_SURFACE_FORMAT_UINT_R16_G16: Type = 271;
    pub const GX2_SURFACE_FORMAT_UINT_R16_G16_B16_A16: Type = 287;
    pub const GX2_SURFACE_FORMAT_UINT_R32: Type = 269;
    pub const GX2_SURFACE_FORMAT_UINT_R32_G32: Type = 285;
    pub const GX2_SURFACE_FORMAT_UINT_R32_G32_B32_A32: Type = 290;
    pub const GX2_SURFACE_FORMAT_UINT_A2_B10_G10_R10: Type = 283;
    pub const GX2_SURFACE_FORMAT_UINT_R10_G10_B10_A2: Type = 281;
    pub const GX2_SURFACE_FORMAT_UINT_X24_G8: Type = 273;
    pub const GX2_SURFACE_FORMAT_UINT_G8_X24: Type = 284;
    pub const GX2_SURFACE_FORMAT_SNORM_R8: Type = 513;
    pub const GX2_SURFACE_FORMAT_SNORM_R8_G8: Type = 519;
    pub const GX2_SURFACE_FORMAT_SNORM_R8_G8_B8_A8: Type = 538;
    pub const GX2_SURFACE_FORMAT_SNORM_R16: Type = 517;
    pub const GX2_SURFACE_FORMAT_SNORM_R16_G16: Type = 527;
    pub const GX2_SURFACE_FORMAT_SNORM_R16_G16_B16_A16: Type = 543;
    pub const GX2_SURFACE_FORMAT_SNORM_R10_G10_B10_A2: Type = 537;
    pub const GX2_SURFACE_FORMAT_SNORM_BC4: Type = 564;
    pub const GX2_SURFACE_FORMAT_SNORM_BC5: Type = 565;
    pub const GX2_SURFACE_FORMAT_SINT_R8: Type = 769;
    pub const GX2_SURFACE_FORMAT_SINT_R8_G8: Type = 775;
    pub const GX2_SURFACE_FORMAT_SINT_R8_G8_B8_A8: Type = 794;
    pub const GX2_SURFACE_FORMAT_SINT_R16: Type = 773;
    pub const GX2_SURFACE_FORMAT_SINT_R16_G16: Type = 783;
    pub const GX2_SURFACE_FORMAT_SINT_R16_G16_B16_A16: Type = 799;
    pub const GX2_SURFACE_FORMAT_SINT_R32: Type = 781;
    pub const GX2_SURFACE_FORMAT_SINT_R32_G32: Type = 797;
    pub const GX2_SURFACE_FORMAT_SINT_R32_G32_B32_A32: Type = 802;
    pub const GX2_SURFACE_FORMAT_SINT_R10_G10_B10_A2: Type = 793;
    pub const GX2_SURFACE_FORMAT_SRGB_R8_G8_B8_A8: Type = 1050;
    pub const GX2_SURFACE_FORMAT_SRGB_BC1: Type = 1073;
    pub const GX2_SURFACE_FORMAT_SRGB_BC2: Type = 1074;
    pub const GX2_SURFACE_FORMAT_SRGB_BC3: Type = 1075;
    pub const GX2_SURFACE_FORMAT_FLOAT_R32: Type = 2062;
    pub const GX2_SURFACE_FORMAT_FLOAT_R32_G32: Type = 2078;
    pub const GX2_SURFACE_FORMAT_FLOAT_R32_G32_B32_A32: Type = 2083;
    pub const GX2_SURFACE_FORMAT_FLOAT_R16: Type = 2054;
    pub const GX2_SURFACE_FORMAT_FLOAT_R16_G16: Type = 2064;
    pub const GX2_SURFACE_FORMAT_FLOAT_R16_G16_B16_A16: Type = 2080;
    pub const GX2_SURFACE_FORMAT_FLOAT_R11_G11_B10: Type = 2070;
    pub const GX2_SURFACE_FORMAT_FLOAT_D24_S8: Type = 2065;
    pub const GX2_SURFACE_FORMAT_FLOAT_X8_X24: Type = 2076;
}
pub mod GX2SurfaceUse {
    pub type Type = cty::c_int;
    pub const GX2_SURFACE_USE_TEXTURE: Type = 1;
    pub const GX2_SURFACE_USE_COLOR_BUFFER: Type = 2;
    pub const GX2_SURFACE_USE_DEPTH_BUFFER: Type = 4;
    pub const GX2_SURFACE_USE_SCAN_BUFFER: Type = 8;
    pub const GX2_SURFACE_USE_TV: Type = -2147483648;
    pub const GX2_SURFACE_USE_TEXTURE_COLOR_BUFFER_TV: Type = -2147483645;
}
pub mod GX2TessellationMode {
    pub type Type = cty::c_uint;
    pub const GX2_TESSELLATION_MODE_DISCRETE: Type = 0;
    pub const GX2_TESSELLATION_MODE_CONTINUOUS: Type = 1;
    pub const GX2_TESSELLATION_MODE_ADAPTIVE: Type = 2;
}
pub mod GX2TexBorderType {
    pub type Type = cty::c_uint;
    pub const GX2_TEX_BORDER_TYPE_TRANSPARENT_BLACK: Type = 0;
    pub const GX2_TEX_BORDER_TYPE_BLACK: Type = 1;
    pub const GX2_TEX_BORDER_TYPE_WHITE: Type = 2;
    pub const GX2_TEX_BORDER_TYPE_VARIABLE: Type = 3;
}
pub mod GX2TexClampMode {
    pub type Type = cty::c_uint;
    pub const GX2_TEX_CLAMP_MODE_WRAP: Type = 0;
    pub const GX2_TEX_CLAMP_MODE_MIRROR: Type = 1;
    pub const GX2_TEX_CLAMP_MODE_CLAMP: Type = 2;
    pub const GX2_TEX_CLAMP_MODE_MIRROR_ONCE: Type = 3;
    pub const GX2_TEX_CLAMP_MODE_CLAMP_BORDER: Type = 6;
}
pub mod GX2TexMipFilterMode {
    pub type Type = cty::c_uint;
    pub const GX2_TEX_MIP_FILTER_MODE_NONE: Type = 0;
    pub const GX2_TEX_MIP_FILTER_MODE_POINT: Type = 1;
    pub const GX2_TEX_MIP_FILTER_MODE_LINEAR: Type = 2;
}
pub mod GX2TexMipPerfMode {
    pub type Type = cty::c_uint;
    pub const GX2_TEX_MIP_PERF_MODE_DISABLE: Type = 0;
}
pub mod GX2TexXYFilterMode {
    pub type Type = cty::c_uint;
    pub const GX2_TEX_XY_FILTER_MODE_POINT: Type = 0;
    pub const GX2_TEX_XY_FILTER_MODE_LINEAR: Type = 1;
}
pub mod GX2TexAnisoRatio {
    pub type Type = cty::c_uint;
    pub const GX2_TEX_ANISO_RATIO_NONE: Type = 0;
}
pub mod GX2TexZFilterMode {
    pub type Type = cty::c_uint;
    pub const GX2_TEX_Z_FILTER_MODE_NONE: Type = 0;
    pub const GX2_TEX_Z_FILTER_MODE_POINT: Type = 1;
    pub const GX2_TEX_Z_FILTER_MODE_LINEAR: Type = 2;
}
pub mod GX2TexZPerfMode {
    pub type Type = cty::c_uint;
    pub const GX2_TEX_Z_PERF_MODE_DISABLED: Type = 0;
}
pub mod GX2TileMode {
    pub type Type = cty::c_uint;
    pub const GX2_TILE_MODE_DEFAULT: Type = 0;
    pub const GX2_TILE_MODE_LINEAR_ALIGNED: Type = 1;
    pub const GX2_TILE_MODE_TILED_1D_THIN1: Type = 2;
    pub const GX2_TILE_MODE_TILED_1D_THICK: Type = 3;
    pub const GX2_TILE_MODE_TILED_2D_THIN1: Type = 4;
    pub const GX2_TILE_MODE_TILED_2D_THIN2: Type = 5;
    pub const GX2_TILE_MODE_TILED_2D_THIN4: Type = 6;
    pub const GX2_TILE_MODE_TILED_2D_THICK: Type = 7;
    pub const GX2_TILE_MODE_TILED_2B_THIN1: Type = 8;
    pub const GX2_TILE_MODE_TILED_2B_THIN2: Type = 9;
    pub const GX2_TILE_MODE_TILED_2B_THIN4: Type = 10;
    pub const GX2_TILE_MODE_TILED_2B_THICK: Type = 11;
    pub const GX2_TILE_MODE_TILED_3D_THIN1: Type = 12;
    pub const GX2_TILE_MODE_TILED_3D_THICK: Type = 13;
    pub const GX2_TILE_MODE_TILED_3B_THIN1: Type = 14;
    pub const GX2_TILE_MODE_TILED_3B_THICK: Type = 15;
    pub const GX2_TILE_MODE_LINEAR_SPECIAL: Type = 16;
}
pub mod GX2TVRenderMode {
    pub type Type = cty::c_uint;
    pub const GX2_TV_RENDER_MODE_STANDARD_480P: Type = 1;
    pub const GX2_TV_RENDER_MODE_WIDE_480P: Type = 2;
    pub const GX2_TV_RENDER_MODE_WIDE_720P: Type = 3;
    pub const GX2_TV_RENDER_MODE_WIDE_1080P: Type = 5;
}
pub mod GX2TVScanMode {
    pub type Type = cty::c_uint;
    pub const GX2_TV_SCAN_MODE_NONE: Type = 0;
    pub const GX2_TV_SCAN_MODE_576I: Type = 1;
    pub const GX2_TV_SCAN_MODE_480I: Type = 2;
    pub const GX2_TV_SCAN_MODE_480P: Type = 3;
    pub const GX2_TV_SCAN_MODE_720P: Type = 4;
    pub const GX2_TV_SCAN_MODE_1080I: Type = 6;
    pub const GX2_TV_SCAN_MODE_1080P: Type = 7;
}
extern "C" {
    pub fn GX2ClearColor(
        colorBuffer: *mut GX2ColorBuffer,
        red: f32,
        green: f32,
        blue: f32,
        alpha: f32,
    );
}
extern "C" {
    pub fn GX2ClearDepthStencilEx(
        depthBuffer: *mut GX2DepthBuffer,
        depth: f32,
        stencil: u8,
        clearMode: GX2ClearFlags::Type,
    );
}
extern "C" {
    pub fn GX2ClearBuffersEx(
        colorBuffer: *mut GX2ColorBuffer,
        depthBuffer: *mut GX2DepthBuffer,
        red: f32,
        green: f32,
        blue: f32,
        alpha: f32,
        depth: f32,
        stencil: u8,
        clearMode: GX2ClearFlags::Type,
    );
}
extern "C" {
    pub fn GX2SetClearDepth(depthBuffer: *mut GX2DepthBuffer, depth: f32);
}
extern "C" {
    pub fn GX2SetClearStencil(depthBuffer: *mut GX2DepthBuffer, stencil: u8);
}
extern "C" {
    pub fn GX2SetClearDepthStencil(depthBuffer: *mut GX2DepthBuffer, depth: f32, stencil: u8);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct GX2ShadowState {
    pub config: [u32; 2816usize],
    pub context: [u32; 1024usize],
    pub alu: [u32; 2048usize],
    pub loop_: [u32; 96usize],
    pub __unk43: [cty::c_char; 128usize],
    pub resource: [u32; 3486usize],
    pub __unk44: [cty::c_char; 136usize],
    pub sampler: [u32; 162usize],
    pub __unk45: [cty::c_char; 120usize],
}
#[test]
fn bindgen_test_layout_GX2ShadowState() {
    assert_eq!(
        ::core::mem::size_of::<GX2ShadowState>(),
        38912usize,
        concat!("Size of: ", stringify!(GX2ShadowState))
    );
    assert_eq!(
        ::core::mem::align_of::<GX2ShadowState>(),
        4usize,
        concat!("Alignment of ", stringify!(GX2ShadowState))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2ShadowState>())).config as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2ShadowState),
            "::",
            stringify!(config)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2ShadowState>())).context as *const _ as usize },
        11264usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2ShadowState),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2ShadowState>())).alu as *const _ as usize },
        15360usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2ShadowState),
            "::",
            stringify!(alu)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2ShadowState>())).loop_ as *const _ as usize },
        23552usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2ShadowState),
            "::",
            stringify!(loop_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2ShadowState>())).__unk43 as *const _ as usize },
        23936usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2ShadowState),
            "::",
            stringify!(__unk43)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2ShadowState>())).resource as *const _ as usize },
        24064usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2ShadowState),
            "::",
            stringify!(resource)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2ShadowState>())).__unk44 as *const _ as usize },
        38008usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2ShadowState),
            "::",
            stringify!(__unk44)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2ShadowState>())).sampler as *const _ as usize },
        38144usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2ShadowState),
            "::",
            stringify!(sampler)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2ShadowState>())).__unk45 as *const _ as usize },
        38792usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2ShadowState),
            "::",
            stringify!(__unk45)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct GX2ContextState {
    pub shadowState: GX2ShadowState,
    pub __unk46: [cty::c_char; 4usize],
    pub shadowDisplayListSize: u32,
    pub __unk47: [cty::c_char; 1528usize],
    pub shadowDisplayList: [u32; 192usize],
}
#[test]
fn bindgen_test_layout_GX2ContextState() {
    assert_eq!(
        ::core::mem::size_of::<GX2ContextState>(),
        41216usize,
        concat!("Size of: ", stringify!(GX2ContextState))
    );
    assert_eq!(
        ::core::mem::align_of::<GX2ContextState>(),
        4usize,
        concat!("Alignment of ", stringify!(GX2ContextState))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2ContextState>())).shadowState as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2ContextState),
            "::",
            stringify!(shadowState)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2ContextState>())).__unk46 as *const _ as usize },
        38912usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2ContextState),
            "::",
            stringify!(__unk46)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<GX2ContextState>())).shadowDisplayListSize as *const _ as usize
        },
        38916usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2ContextState),
            "::",
            stringify!(shadowDisplayListSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2ContextState>())).__unk47 as *const _ as usize },
        38920usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2ContextState),
            "::",
            stringify!(__unk47)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<GX2ContextState>())).shadowDisplayList as *const _ as usize
        },
        40448usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2ContextState),
            "::",
            stringify!(shadowDisplayList)
        )
    );
}
extern "C" {
    pub fn GX2SetupContextStateEx(state: *mut GX2ContextState, unk1: BOOL);
}
extern "C" {
    pub fn GX2GetContextStateDisplayList(
        state: *const GX2ContextState,
        outDisplayList: *mut cty::c_void,
        outSize: *mut u32,
    );
}
extern "C" {
    pub fn GX2SetContextState(state: *mut GX2ContextState);
}
extern "C" {
    pub fn GX2SetDefaultState();
}
pub mod GX2RResourceFlags {
    pub type Type = cty::c_uint;
    #[doc = "! This resource is to be used as a texture"]
    pub const GX2R_RESOURCE_BIND_TEXTURE: Type = 1;
    #[doc = "! This resource is to be used as a colour buffer"]
    pub const GX2R_RESOURCE_BIND_COLOR_BUFFER: Type = 2;
    #[doc = "! This resource is to be used as a depth buffer"]
    pub const GX2R_RESOURCE_BIND_DEPTH_BUFFER: Type = 4;
    #[doc = "! This resource is to be used as a scan buffer"]
    pub const GX2R_RESOURCE_BIND_SCAN_BUFFER: Type = 8;
    #[doc = "! This resource is to be used as a vertex buffer"]
    pub const GX2R_RESOURCE_BIND_VERTEX_BUFFER: Type = 16;
    #[doc = "! This resource is to be used as a index buffer"]
    pub const GX2R_RESOURCE_BIND_INDEX_BUFFER: Type = 32;
    #[doc = "! This resource is to be used as a uniform block"]
    pub const GX2R_RESOURCE_BIND_UNIFORM_BLOCK: Type = 64;
    #[doc = "! This resource is to be used as a shader program"]
    pub const GX2R_RESOURCE_BIND_SHADER_PROGRAM: Type = 128;
    #[doc = "! This resource is to be used as a stream output"]
    pub const GX2R_RESOURCE_BIND_STREAM_OUTPUT: Type = 256;
    #[doc = "! This resource is to be used as a display list"]
    pub const GX2R_RESOURCE_BIND_DISPLAY_LIST: Type = 512;
    #[doc = "! This resource is to be used as a geometry shader ring buffer"]
    pub const GX2R_RESOURCE_BIND_GS_RING_BUFFER: Type = 1024;
    #[doc = "! Invalidate resource for a CPU read"]
    pub const GX2R_RESOURCE_USAGE_CPU_READ: Type = 2048;
    #[doc = "! Invalidate resource for a CPU write"]
    pub const GX2R_RESOURCE_USAGE_CPU_WRITE: Type = 4096;
    #[doc = "! Invalidate resource for a GPU read"]
    pub const GX2R_RESOURCE_USAGE_GPU_READ: Type = 8192;
    #[doc = "! Invalidate resource for a GPU write"]
    pub const GX2R_RESOURCE_USAGE_GPU_WRITE: Type = 16384;
    #[doc = "! Invalidate resource for a DMA read"]
    pub const GX2R_RESOURCE_USAGE_DMA_READ: Type = 32768;
    #[doc = "! Invalidate resource for a DMA write"]
    pub const GX2R_RESOURCE_USAGE_DMA_WRITE: Type = 65536;
    #[doc = "! Force resource allocation to be in MEM1"]
    pub const GX2R_RESOURCE_USAGE_FORCE_MEM1: Type = 131072;
    #[doc = "! Force resource allocation to be in MEM2"]
    pub const GX2R_RESOURCE_USAGE_FORCE_MEM2: Type = 262144;
    #[doc = "! Disable CPU invalidation"]
    pub const GX2R_RESOURCE_DISABLE_CPU_INVALIDATE: Type = 1048576;
    #[doc = "! Disable GPU invalidation"]
    pub const GX2R_RESOURCE_DISABLE_GPU_INVALIDATE: Type = 2097152;
    #[doc = "! Resource is locked for read-only access"]
    pub const GX2R_RESOURCE_LOCKED_READ_ONLY: Type = 4194304;
    #[doc = "! Resource was allocated by GX2R."]
    pub const GX2R_RESOURCE_GX2R_ALLOCATED: Type = 536870912;
    #[doc = "! Resource is locked for all access"]
    pub const GX2R_RESOURCE_LOCKED: Type = 1073741824;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct GX2Surface {
    pub dim: GX2SurfaceDim::Type,
    pub width: u32,
    pub height: u32,
    pub depth: u32,
    pub mipLevels: u32,
    pub format: GX2SurfaceFormat::Type,
    pub aa: GX2AAMode::Type,
    pub __bindgen_anon_1: GX2Surface__bindgen_ty_1,
    pub imageSize: u32,
    pub image: *mut cty::c_void,
    pub mipmapSize: u32,
    pub mipmaps: *mut cty::c_void,
    pub tileMode: GX2TileMode::Type,
    pub swizzle: u32,
    pub alignment: u32,
    pub pitch: u32,
    pub mipLevelOffset: [u32; 13usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union GX2Surface__bindgen_ty_1 {
    pub use_: GX2SurfaceUse::Type,
    pub resourceFlags: GX2RResourceFlags::Type,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_GX2Surface__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<GX2Surface__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(GX2Surface__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<GX2Surface__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(GX2Surface__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface__bindgen_ty_1>())).use_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface__bindgen_ty_1),
            "::",
            stringify!(use_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<GX2Surface__bindgen_ty_1>())).resourceFlags as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface__bindgen_ty_1),
            "::",
            stringify!(resourceFlags)
        )
    );
}
#[test]
fn bindgen_test_layout_GX2Surface() {
    assert_eq!(
        ::core::mem::size_of::<GX2Surface>(),
        116usize,
        concat!("Size of: ", stringify!(GX2Surface))
    );
    assert_eq!(
        ::core::mem::align_of::<GX2Surface>(),
        4usize,
        concat!("Alignment of ", stringify!(GX2Surface))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface>())).dim as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface),
            "::",
            stringify!(dim)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface>())).width as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface>())).height as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface>())).depth as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface>())).mipLevels as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface),
            "::",
            stringify!(mipLevels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface>())).format as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface>())).aa as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface),
            "::",
            stringify!(aa)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface>())).imageSize as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface),
            "::",
            stringify!(imageSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface>())).image as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface),
            "::",
            stringify!(image)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface>())).mipmapSize as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface),
            "::",
            stringify!(mipmapSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface>())).mipmaps as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface),
            "::",
            stringify!(mipmaps)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface>())).tileMode as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface),
            "::",
            stringify!(tileMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface>())).swizzle as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface),
            "::",
            stringify!(swizzle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface>())).alignment as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface),
            "::",
            stringify!(alignment)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface>())).pitch as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2Surface>())).mipLevelOffset as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2Surface),
            "::",
            stringify!(mipLevelOffset)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct GX2DepthBuffer {
    pub surface: GX2Surface,
    pub viewMip: u32,
    pub viewFirstSlice: u32,
    pub viewNumSlices: u32,
    pub hiZPtr: *mut cty::c_void,
    pub hiZSize: u32,
    pub depthClear: f32,
    pub stencilClear: u32,
    pub regs: [u32; 7usize],
}
#[test]
fn bindgen_test_layout_GX2DepthBuffer() {
    assert_eq!(
        ::core::mem::size_of::<GX2DepthBuffer>(),
        172usize,
        concat!("Size of: ", stringify!(GX2DepthBuffer))
    );
    assert_eq!(
        ::core::mem::align_of::<GX2DepthBuffer>(),
        4usize,
        concat!("Alignment of ", stringify!(GX2DepthBuffer))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2DepthBuffer>())).surface as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2DepthBuffer),
            "::",
            stringify!(surface)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2DepthBuffer>())).viewMip as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2DepthBuffer),
            "::",
            stringify!(viewMip)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2DepthBuffer>())).viewFirstSlice as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2DepthBuffer),
            "::",
            stringify!(viewFirstSlice)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2DepthBuffer>())).viewNumSlices as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2DepthBuffer),
            "::",
            stringify!(viewNumSlices)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2DepthBuffer>())).hiZPtr as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2DepthBuffer),
            "::",
            stringify!(hiZPtr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2DepthBuffer>())).hiZSize as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2DepthBuffer),
            "::",
            stringify!(hiZSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2DepthBuffer>())).depthClear as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2DepthBuffer),
            "::",
            stringify!(depthClear)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2DepthBuffer>())).stencilClear as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2DepthBuffer),
            "::",
            stringify!(stencilClear)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<GX2DepthBuffer>())).regs as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(GX2DepthBuffer),
            "::",
            stringify!(regs)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct GX2ColorBuffer {
    pub surface: GX2Surface,
    pub viewMip: u32,
    pub viewFirstSlice: u32,
    pub viewNumSlices: u32,
    pub aaBuffer: *mut cty::c_void,
    pub aaSize: u32,
    pub regs: [u32; 5usize],
}
#[test]
fn bindgen_test_layout_GX2ColorBuffer() {
    assert_eq!(
        ::core::mem::size_of::<GX2ColorBuffer>(),
        156usize,
        concat!("Size of: ", stringify!(GX2ColorBuffer))
    );
    assert_eq!(
        ::core::mem::align_of::<GX2ColorBuffer>(),
        4usize,
        concat!("Alignment of ", stringify!(GX2ColorBuffer))
    );
    assert_eq!(
